
&НаКлиенте
Процедура Расш1_ТоварыПриНачалеРедактированияПосле(Элемент, НоваяСтрока, Копирование)
	
	//************************************************************************
	//ИЗМЕНЕНО Сухарев Б.В. 04.07.2018
	//Преренести в обновление
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если НЕ НоваяСтрока Тогда
		Если ТекущиеДанные.Упаковка.Пустая() Тогда
	//		_СтараяУпаковка = ТекущиеДанные.Номенклатура.ЕдиницаИзмерения;
			_СтараяУпаковка = ТекущиеДанные.Номенклатура;
		Иначе
			_СтараяУпаковка = ТекущиеДанные.Упаковка;
		КонецЕсли;
	КонецЕсли;
	//************************************************************************
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("СкладПриИзмененииСервер")
Процедура Кт_СкладПриИзмененииСервер(ОчищатьСтроки, ОтвязатьВсеСтрокиОтЗаказа)
	
	СкладГруппа = ЭтоГруппаСкладовИСкладыИспользуютсяВТЧДокументовПродажи(Объект.Склад);
	Склад = Объект.Склад;
	
	УстановитьПараметрыВыбораТоварыСклад();
	
	СтруктураОтветственного = ПродажиСервер.ПолучитьОтветственногоПоСкладу(Объект.Склад);
	Если СтруктураОтветственного <> Неопределено Тогда
		Объект.Отпустил = СтруктураОтветственного.Ответственный;
		Объект.ОтпустилДолжность = СтруктураОтветственного.ОтветственныйДолжность;
	КонецЕсли;
	
	#Вставка
	СтруктураОтветственных = ОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(Объект.Организация, Объект.Дата); 
	Если Объект.Организация.ИНН <> "7718302970" Тогда
		Объект.Отпустил = СтруктураОтветственных.Руководитель;
		Объект.ОтпустилДолжность = СтруктураОтветственных.РуководительДолжность;	
	КонецЕсли;
	#КонецВставки
	Если Объект.РеализацияПоЗаказам И Не СкладГруппа И Объект.Товары.Количество() > 0 И ОчищатьСтроки Тогда
		Объект.Товары.Очистить();
	КонецЕсли;
	
	Если ОтвязатьВсеСтрокиОтЗаказа Тогда
		ОтвязатьОтЗаказаСервер();
	КонецЕсли;
	
	Элементы.ТоварыЗаполнитьСкладВВыделенныхСтроках.Доступность = СкладГруппа;
	СкладыСервер.ЗаполнитьСкладыВТабличнойЧасти(Объект.Склад, СкладГруппа, Объект.Товары, Истина);
	
	ПриИзмененииСкладаВТабличнойЧастиСервер();

	ОбновитьИнформациюПоЗаказам();
	РассчитатьИтоговыеПоказатели(ЭтотОбъект);
	ВзаиморасчетыКлиентСервер.ОбновитьТекстГиперссылкиВалюты(ЭтаФорма);

	ЗаполнитьУстановитьВидимостьСерийДоступностьПерезаполнитьПоОтгрузке();
	
	ЗаполнитьНалогообложениеНДСПродажи();
	НалогообложениеНДСПриИзмененииСервер();

	УстановитьЗаголовокТоварыГруппаОтправитель();

	УстановитьЗаголовокЗаполнитьПоЗаказамОрдерам();
	Элементы.ГруппаНадписьИКартинкаНесколькоСкладов.Видимость = СкладГруппа;
	
	УстановитьДоступностьВидимостьЭлементовСборкиИДоставки();
	
КонецПроцедуры

&НаСервере
&После("ОрганизацияПриИзмененииСервер")
Процедура Кт_ОрганизацияПриИзмененииСервер()    
	
		Если Объект.Организация.ИНН <> "7718302970" Тогда
		СтруктураОтветственных = ОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(Объект.Организация, Объект.Дата);
		Объект.Отпустил = СтруктураОтветственных.Руководитель;
		Объект.ОтпустилДолжность = СтруктураОтветственных.РуководительДолжность;
	Иначе
		СтруктураОтветственного = ПродажиСервер.ПолучитьОтветственногоПоСкладу(Объект.Склад, Объект.Менеджер);
		Если СтруктураОтветственного <> Неопределено Тогда
			Объект.Отпустил = СтруктураОтветственного.Ответственный;
			Объект.ОтпустилДолжность = СтруктураОтветственного.ОтветственныйДолжность;
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ТоварыУпаковкаПриИзменении")
Процедура Кт_ТоварыУпаковкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураЗаполненияБонусныхБаллов = Неопределено;
	ПроверкаОплатыБонуснымиБаллами(ТекущаяСтрока, СтруктураЗаполненияБонусныхБаллов);

	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
#Вставка
	//************************************************************************
	//ИЗМЕНЕНО Сухарев Б.В. 04.07.2018
	//Преренести в обновление
	СтруктураДействий.Вставить("ПересчитатьУпаковокиЕдиницы", Истина);
	СтруктураДействий.Вставить("ТекущийДокумент", Объект.Ссылка);
	СтруктураДействий.Вставить("СтараяУпаковка"  , _СтараяУпаковка);
	Если ТекущаяСтрока.Упаковка.Пустая() Тогда
	//	СтруктураДействий.Вставить("НоваяУпаковка"   , ТекущаяСтрока.Номенклатура.ЕдиницаИзмерения);
		СтруктураДействий.Вставить("НоваяУпаковка"   , ТекущаяСтрока.Номенклатура);
	Иначе	
		СтруктураДействий.Вставить("НоваяУпаковка"   , ТекущаяСтрока.Упаковка);
	КонецЕсли;
	//************************************************************************
#КонецВставки
	
	Если ТекущаяСтрока.Количество > 0 И Не ЗначениеЗаполнено(ТекущаяСтрока.ВидЦены) Тогда
		СтруктураДействий.Вставить("ПересчитатьЦенуЗаУпаковку", ТекущаяСтрока.Количество);
	ИначеЕсли ТекущаяСтрока.Количество > 0 И ЗначениеЗаполнено(ТекущаяСтрока.ВидЦены) Тогда
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияЦеныВСтрокеТЧ(Объект));
	ИначеЕсли (ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение)) 
		Или (Не ИспользоватьСоглашенияСКлиентами И ИспользуетсяЦенообразование25) Тогда
		СтруктураДействий.Вставить("ЗаполнитьУсловияПродаж", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ(Объект));
	КонецЕсли;
	
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами", СтруктураЗаполненияБонусныхБаллов);
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
		
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказатели(ЭтотОбъект);
	СкидкиНаценкиЗаполнениеКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Кт_ДоговорПриИзмененииПосле(Элемент)
	//РИВ +++ 24.11.25
	Подразд = ПолучитьПодразделение(Объект.Договор);
	Если ЗначениеЗаполнено(Подразд) Тогда
		Объект.Подразделение = Подразд;
	КонецЕсли;	
    //РИВ --- 24.11.25

КонецПроцедуры

&НаСервере
Функция ПолучитьПодразделение(Договор)

	Возврат Договор.Подразделение;	

КонецФункции // ПолучитьПодразделение()


&НаСервере
&ИзменениеИКонтроль("СоглашениеПриИзмененииСервер")
Процедура Кт_СоглашениеПриИзмененииСервер()

	ХозОперация = Объект.ХозяйственнаяОперация;

	ДокументПродажи = РеквизитФормыВЗначение("Объект");
	ДокументПродажи.ЗаполнитьУсловияПродажПоСоглашению();
	ОтветственныеЛицаСервер.ЗаполнитьСписокВыбораМенеджера(Элементы.Менеджер, Объект);
	#Удаление
	ОтветственныеЛицаСервер.УстановитьМенеджера(ДокументПродажи,
	ПродажиСервер.ДокументОснование(ДокументПродажи, "РеализацияПоЗаказам, ЗаказКлиента, Товары.ЗаказКлиента"));
	#КонецУдаления
	ЗначениеВРеквизитФормы(ДокументПродажи, "Объект");

	ЗаполнитьСписокВыбораОпераций();
	ВалютаДокумента = Объект.Валюта;

	Если ХозОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет Тогда
		Объект.ХозяйственнаяОперация = ХозОперация;
	КонецЕсли;

	СкладГруппа = ЭтоГруппаСкладовИСкладыИспользуютсяВТЧДокументовПродажи(Объект.Склад);
	СкладПриИзмененииСервер();
	ХозяйственнаяОперацияПриИзмененииСервер();
	УстановитьДоступностьЭлементовПоСтатусуСервер();

	ОбновитьТекстДокументыНаОсновании();

	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();

	ПродажиСервер.УстановитьДоступностьДоговора(Объект, Элементы.Договор.Доступность, Элементы.ГруппаДоговор.Видимость, Объект.Договор);
	Элементы.ГруппаНадписьДоговор.Видимость = Элементы.ГруппаДоговор.Видимость;

	Если Объект.РеализацияПоЗаказам Тогда
		ОбновитьОтклоненияОтЗаказа();
	КонецЕсли;

	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("Валюта");
	МассивРеквизитов.Добавить("ВалютаВзаиморасчетов");
	МассивРеквизитов.Добавить("Партнер");
	МассивРеквизитов.Добавить("Договор");
	МассивРеквизитов.Добавить("НаправлениеДеятельности");
	МассивРеквизитов.Добавить("Контрагент");
	МассивРеквизитов.Добавить("Организация");
	МассивРеквизитов.Добавить("Соглашение");
	ВзаиморасчетыСервер.ФормаПриИзмененииРеквизитов(ЭтаФорма, МассивРеквизитов);

	Объект.БанковскийСчетКонтрагента = ПолучитьБанковскийСчетКонтрагентаПоУмолчаниюСервер(Объект.Контрагент, Объект.БанковскийСчетОрганизации);
	ОбновитьДоступностьЭлементовВозвратнойТары(ЭтаФорма);
	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Объект);

	ЗаполнитьПодчиненныеСвойстваПоСтатистике("Договор");

	МногооборотнаяТараСервер.ОбновитьПризнакБезВозвратнойТары(Объект.Товары, Объект.ВернутьМногооборотнуюТару);
	ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.Товары, ЗависимыеРеквизиты());
	РассчитатьИтоговыеПоказатели(ЭтотОбъект);

	// ЭлектронноеВзаимодействие.ЭлектронноеАктированиеЕИС
	ЭлектронноеАктированиеЕИСУТ.ДоговорПриИзмененииЭлектронноеАктированиеЕИС(ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ЭлектронноеАктированиеЕИС


	Если ИспользоватьНаправленияДеятельности Тогда
		НаправленияДеятельностиСервер.ЗаполнитьНаправлениеПоУмолчанию(Объект.НаправлениеДеятельности, Объект.Соглашение, Объект.Договор);
	КонецЕсли;
	НаправленияДеятельностиСервер.ПриИзмененииНаправленияДеятельности(ЭтотОбъект);

	УстановитьДоступностьВидимостьЭлементовСборкиИДоставки();

	ЗаполнитьОснованиеДляПечати();

КонецПроцедуры



&НаКлиенте
&Вместо ("ТоварыНоменклатураПартнераПриИзменении")
Процедура Кт_ТоварыНоменклатураПартнераПриИзменении(Элемент)
	
	//## Ничего не делаем
	Возврат;
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	ДополнительныеПараметры = ДополнительныеПараметрыОбработкиЗавершения();
	ДополнительныеПараметры. ТекущаяСтрока = ТекущаяСтрока;
	ВопросПользователюПриИзмененииРеквизитаСтроки(
		Новый ОписаниеОповещения("ТоварыНоменклатураПартнераПриИзмененииВопросПользователюЗавершение", ЭтотОбъект, ДополнительныеПараметры),
		ТекущаяСтрока);
	
КонецПроцедуры
