

Функция Расш1_СформироватьЗаданиеНаОтборРазмещениеТовараВВВ(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПараметрыПечати.Свойство("ТипЗадания") И
		ЗначениеЗаполнено(ПараметрыПечати.ТипЗадания) Тогда
		ТипЗадания = ПараметрыПечати.ТипЗадания;
	Иначе
		ТипЗадания = "ЗаданиеНаРазмещение";
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_" + ПараметрыПечати.ИмяФормы;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_" + ТипЗадания;
	НомерТипаДокумента = 0;
	
	Если ТипЗнч(МассивОбъектов) = Тип("Соответствие") Тогда 
		СтруктураТипов = МассивОбъектов;
	Иначе
		СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
	КонецЕсли;
	
	//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.
	нТаб = Новый ТаблицаЗначений;
	нТаб.Колонки.Добавить("НомерСтроки"	 		, Новый ОписаниеТипов("Строка"));
	нТаб.Колонки.Добавить("Артикул"				, Новый ОписаниеТипов("Строка"));
	нТаб.Колонки.Добавить("Товар"				, Новый	ОписаниеТипов("Строка"));
	нТаб.Колонки.Добавить("КоличествоУпаковок"	, Новый	ОписаниеТипов("Число")); 
	нТаб.Колонки.Добавить("ЕдиницаИзмерения"	, Новый ОписаниеТипов("Строка"));
	//**ИЗМЕНЕНИЕ Ниронов В.А.  Добавил тип Склады
	нТаб.Колонки.Добавить("Поставщик"			, Новый	ОписаниеТипов("СправочникСсылка.Контрагенты, СправочникСсылка.Склады"));
	//******************
	нТаб.Колонки.Добавить("НомерДокумента"		, Новый	ОписаниеТипов("Строка")); 																
	нТаб.Колонки.Добавить("ДатаДокумента"		, Новый	ОписаниеТипов("Дата")); 																								
	//******************
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов().ИмяКолонки;
		ВыводитьКоды = ЗначениеЗаполнено(КолонкаКодов);
		ВыводитьУпаковки = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры") 
		И Не(ПараметрыПечати.Свойство("БезДопКолонки"));
		ВыводитьПоУчету = ВыводитьУпаковки;
		ЗаданиеНаДобор 	= ТипЗадания = "ЗаданиеНаДобор";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьЗаданияНаОтборРазмещениеТоваров.ПФ_MXL_ЗаданиеНаОтборРазмещениеТовараРасш");
		
		ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");
		
		ОбластьШапка 			  = Макет.ПолучитьОбласть("Шапка");
		ОбластьОснование 		  = Макет.ПолучитьОбласть("Основание");
		ОбластьЗаданиеНаПеревозку = Макет.ПолучитьОбласть("ЗаданиеНаПеревозку"); 
		//***************************************************************
		//ИЗМЕНЕНО Стефутин В.П. 29.04.2023
		ОбластьЗаявкаНаДоставку = Макет.ПолучитьОбласть("_ЗаявкаНаДоставку");
		//***************************************************************
		//**Изменено 17.09.19 Максимов
		ОбластьКонтрагент		  = Макет.ПолучитьОбласть("СтрокаКонтрагент");		
		//****************************		
		
		// Области макета для склада со справочным использованием ячеек, с использованием упаковок, с кодами.
		ОбластьШапкаТаблицыОснова	  		= Макет.ПолучитьОбласть("ШапкаТаблицыОснова");
		ОбластьРабочийУчастокОснова		  	= Макет.ПолучитьОбласть("РабочийУчастокОснова");
		ОбластьСтрокаТаблицыОснова	        = Макет.ПолучитьОбласть("СтрокаТаблицыОснова");
		ОбластьПодвалТаблицыОснова	      	= Макет.ПолучитьОбласть("ПодвалТаблицыОснова");
		
		ОбластьШапкаТаблицыОснова.Параметры.ИмяКолонкиКодов = КолонкаКодов;
		
		// Области макета для склада со справочным использованием ячеек, без использования упаковок, с кодами.
		ОбластьШапкаТаблицыБезУпаковок 			  = Макет.ПолучитьОбласть("ШапкаТаблицыБезУпаковок");
		ОбластьРабочийУчастокБезУпаковок		  = Макет.ПолучитьОбласть("РабочийУчастокБезУпаковок");
		ОбластьСтрокаТаблицыБезУпаковок	   		  = Макет.ПолучитьОбласть("СтрокаТаблицыБезУпаковок");
		ОбластьПодвалТаблицыБезУпаковок	     	  = Макет.ПолучитьОбласть("ПодвалТаблицыБезУпаковок");
		
		ОбластьШапкаТаблицыБезУпаковок.Параметры.ИмяКолонкиКодов = КолонкаКодов;
		
		// Области макета для склада без справочного использования ячеек, с использованием упаковок, с кодами.
		ОбластьШапкаТаблицыБезЯчеек 			= Макет.ПолучитьОбласть("ШапкаТаблицыБезЯчеек");
		ОбластьРабочийУчастокБезЯчеек			= Макет.ПолучитьОбласть("РабочийУчастокБезЯчеек");
		ОбластьСтрокаТаблицыБезЯчеек 			= Макет.ПолучитьОбласть("СтрокаТаблицыБезЯчеек");
		ОбластьПодвалТаблицыБезЯчеек			= Макет.ПолучитьОбласть("ПодвалТаблицыБезЯчеек");
		
		ОбластьШапкаТаблицыБезЯчеек.Параметры.ИмяКолонкиКодов = КолонкаКодов;
		
		// Области макета для склада без справочного использования ячеек, без использования упаковок, с кодами.
		ОбластьШапкаТаблицыБезЯчеекБезУпаковок 				= Макет.ПолучитьОбласть("ШапкаТаблицыБезЯчеекБезУпаковок");
		ОбластьРабочийУчастокБезЯчеекБезУпаковок			= Макет.ПолучитьОбласть("РабочийУчастокБезЯчеекБезУпаковок");
		ОбластьСтрокаТаблицыБезЯчеекБезУпаковок				= Макет.ПолучитьОбласть("СтрокаТаблицыБезЯчеекБезУпаковок");
		ОбластьПодвалТаблицыБезЯчеекБезУпаковок				= Макет.ПолучитьОбласть("ПодвалТаблицыБезЯчеекБезУпаковок");
		
		ОбластьШапкаТаблицыБезЯчеекБезУпаковок.Параметры.ИмяКолонкиКодов = КолонкаКодов; 
		
		// Области макета для склада со справочным использованием ячеек, с использованием упаковок, без кодов.
		ОбластьШапкаТаблицыБезКодов 		  = Макет.ПолучитьОбласть("ШапкаТаблицыБезКодов");
		ОбластьРабочийУчастокБезКодов		  = Макет.ПолучитьОбласть("РабочийУчастокБезКодов");
		ОбластьСтрокаТаблицыБезКодов	      = Макет.ПолучитьОбласть("СтрокаТаблицыБезКодов");
		ОбластьПодвалТаблицыБезКодов	      = Макет.ПолучитьОбласть("ПодвалТаблицыБезКодов");	
		
		// Области макета для склада со справочным использованием ячеек, без использования упаковок, без кодов.
		ОбластьШапкаТаблицыБезУпаковокБезКодов 			  = Макет.ПолучитьОбласть("ШапкаТаблицыБезУпаковокБезКодов");
		ОбластьРабочийУчастокБезУпаковокБезКодов		  = Макет.ПолучитьОбласть("РабочийУчастокБезУпаковокБезКодов");
		ОбластьСтрокаТаблицыБезУпаковокБезКодов	   		  = Макет.ПолучитьОбласть("СтрокаТаблицыБезУпаковокБезКодов");
		ОбластьПодвалТаблицыБезУпаковокБезКодов	     	  = Макет.ПолучитьОбласть("ПодвалТаблицыБезУпаковокБезКодов");
		
		// Области макета для склада без справочного использования ячеек, с использованием упаковок, без кодов.
		ОбластьШапкаТаблицыБезЯчеекБезКодов 			= Макет.ПолучитьОбласть("ШапкаТаблицыБезЯчеекБезКодов");
		ОбластьРабочийУчастокБезЯчеекБезКодов			= Макет.ПолучитьОбласть("РабочийУчастокБезЯчеекБезКодов");
		ОбластьСтрокаТаблицыБезЯчеекБезКодов 			= Макет.ПолучитьОбласть("СтрокаТаблицыБезЯчеекБезКодов");
		ОбластьПодвалТаблицыБезЯчеекБезКодов			= Макет.ПолучитьОбласть("ПодвалТаблицыБезЯчеекБезКодов");
		
		// Области макета для склада без справочного использования ячеек, без использования упаковок, без кодов.
		ОбластьШапкаТаблицыБезЯчеекБезУпаковокБезКодов 				= Макет.ПолучитьОбласть("ШапкаТаблицыБезЯчеекБезУпаковокБезКодов");
		ОбластьРабочийУчастокБезЯчеекБезУпаковокБезКодов			= Макет.ПолучитьОбласть("РабочийУчастокБезЯчеекБезУпаковокБезКодов");
		ОбластьСтрокаТаблицыБезЯчеекБезУпаковокБезКодов				= Макет.ПолучитьОбласть("СтрокаТаблицыБезЯчеекБезУпаковокБезКодов");
		ОбластьПодвалТаблицыБезЯчеекБезУпаковокБезКодов				= Макет.ПолучитьОбласть("ПодвалТаблицыБезЯчеекБезУпаковокБезКодов");
		
		ОбластьИсполнитель = Макет.ПолучитьОбласть("Исполнитель");
		
		ЭтоЗаданиеНаРазмещение 	= Неопределено;
		ПервыйДокумент 	 		= Истина;
		
		Если ТипЗадания  = "ЗаданиеНаПересчет" Тогда							
			ОбластьШапкаТаблицыОснова.Параметры.НадписьКоличествоУпаковки 				= НСтр("ru='(По учету)'");
			ОбластьШапкаТаблицыБезКодов.Параметры.НадписьКоличествоУпаковки 			= НСтр("ru='(По учету)'");
			ОбластьШапкаТаблицыБезЯчеек.Параметры.НадписьКоличествоУпаковки 			= НСтр("ru='(По учету)'");
			ОбластьШапкаТаблицыБезЯчеекБезКодов.Параметры.НадписьКоличествоУпаковки 	= НСтр("ru='(По учету)'");
			ОбластьШапкаТаблицыОснова.Параметры.НадписьКоличество 						= НСтр("ru='(Факт)'");
			ОбластьШапкаТаблицыБезКодов.Параметры.НадписьКоличество 					= НСтр("ru='(Факт)'");
			ОбластьШапкаТаблицыБезЯчеек.Параметры.НадписьКоличество 					= НСтр("ru='(Факт)'");
			ОбластьШапкаТаблицыБезЯчеекБезКодов.Параметры.НадписьКоличество 			= НСтр("ru='(Факт)'");
			НазваниеФормы 																= НСтр("ru = 'Задание на пересчет товаров'");
		ИначеЕсли ТипЗадания  = "ЗаданиеНаРазмещение" Тогда				
			Если СтруктураОбъектов.Ключ = "Документ.РасходныйОрдерНаТовары" 
				ИЛИ СтруктураОбъектов.Ключ = "Документ.ПорчаТоваров" 
				ИЛИ СтруктураОбъектов.Ключ = "Документ.ПересортицаТоваров"
				ИЛИ СтруктураОбъектов.Ключ = "Документ.СписаниеНедостачТоваров"
				ИЛИ СтруктураОбъектов.Ключ = "Документ.ИнвентаризационнаяОпись" Тогда
				Для Каждого РасходныйОрдер Из СтруктураОбъектов.Значение Цикл
					ТекстСообщения = НСтр("ru = 'Печать задания на размещение для документа ""%Документ%"" не предусмотрена.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%Документ%", РасходныйОрдер);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);	
				КонецЦикла;
				Продолжить;
			КонецЕсли;
			ЭтоЗаданиеНаРазмещение 														= Истина;
			НазваниеФормы 																= НСтр("ru = 'Задание на размещение товаров'");
			ОбластьШапкаТаблицыОснова.Параметры.НадписьКоличествоУпаковки 				= НСтр("ru='(упаковок)'");
			ОбластьШапкаТаблицыБезКодов.Параметры.НадписьКоличествоУпаковки 			= НСтр("ru='(упаковок)'");
			ОбластьШапкаТаблицыБезЯчеек.Параметры.НадписьКоличествоУпаковки 			= НСтр("ru='(упаковок)'");
			ОбластьШапкаТаблицыБезЯчеекБезКодов.Параметры.НадписьКоличествоУпаковки		= НСтр("ru='(упаковок)'");				
			
		ИначеЕсли ТипЗадания  = "ЗаданиеНаОтбор" Тогда				
			ЭтоЗаданиеНаРазмещение 														= Ложь;
			НазваниеФормы 																= НСтр("ru = 'Задание на отбор товаров'");
			ОбластьШапкаТаблицыОснова.Параметры.НадписьКоличествоУпаковки 				= НСтр("ru='(упаковок)'");
			ОбластьШапкаТаблицыБезКодов.Параметры.НадписьКоличествоУпаковки 			= НСтр("ru='(упаковок)'");
			ОбластьШапкаТаблицыБезЯчеек.Параметры.НадписьКоличествоУпаковки 			= НСтр("ru='(упаковок)'");
			ОбластьШапкаТаблицыБезЯчеекБезКодов.Параметры.НадписьКоличествоУпаковки 	= НСтр("ru='(упаковок)'");
		КонецЕсли;
		
		Если ЗаданиеНаДобор Тогда
			ЭтоЗаданиеНаРазмещение 														= Ложь;
			НазваниеФормы 																= НСтр("ru = 'Задание на добор товаров'");
			ОбластьШапкаТаблицыОснова.Параметры.НадписьКоличество 						= НСтр("ru='(упаковок)'");
			ОбластьШапкаТаблицыБезКодов.Параметры.НадписьКоличество 					= НСтр("ru='(упаковок)'");
			ОбластьШапкаТаблицыБезЯчеек.Параметры.НадписьКоличество 					= НСтр("ru='(упаковок)'");
			ОбластьШапкаТаблицыБезЯчеекБезКодов.Параметры.НадписьКоличество 			= НСтр("ru='(упаковок)'");
			ДанныеДляПечати = 
			Обработки.ПроверкаКоличестваТоваровВДокументе.ПолучитьДанныеДляПечатнойФормыЗаданиеНаДоборТоваров(ПараметрыПечати, 
			ПараметрыПечати.Ордер);
		Иначе
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ);
			ДанныеДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатнойФормыОтборРазмещениеТоваров(ПараметрыПечати, 
			СтруктураОбъектов.Значение);
		КонецЕсли;
		
		ДанныеПоШапке 			= ДанныеДляПечати.РезультатПоШапке;
		ДанныеПоТабличнойЧасти	= ДанныеДляПечати.РезультатПоТабличнойЧасти;
		ДанныеПоУпаковкам 		= ДанныеДляПечати.РезультатПоУпаковкам;
		ДанныеПоСериям			= ДанныеДляПечати.РезультатПоСериям;
		
		ДанныеПоРаспоряжениям	= Неопределено;
		ДанныеДляПечати.Свойство("РезультатПоРаспоряжениям", ДанныеПоРаспоряжениям);
		
		ЕстьПолеИспользоватьСерииНоменклатуры = ДанныеПоШапке.Колонки.Найти("ИспользоватьСерииНоменклатуры") <> Неопределено;
		
		ВыборкаПоШапке			= ДанныеПоШапке.Выбрать();
		ВыборкаПоСсылкам		= ДанныеПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаПоСериям			= ДанныеПоСериям.Выбрать();
		
		Если ТипЗадания  <> "ЗаданиеНаПересчет" И СтруктураОбъектов.Ключ <> "Документ.ПересчетТоваров" Тогда
			ВыборкаПоУпаковкам 	= ДанныеПоУпаковкам.Выбрать();
		КонецЕсли;
		
		Если СтруктураОбъектов.Ключ = "Документ.РасходныйОрдерНаТовары" Тогда
			ВыборкаПоРаспоряжениям = ДанныеПоРаспоряжениям.Выбрать();
		КонецЕсли;
		
		ТекущаяСсылка = Неопределено;
		
		Пока ВыборкаПоШапке.Следующий() Цикл
			
			ТекстСообщения = "";
			
			Если Не ЗначениеЗаполнено(ВыборкаПоШапке.СкладПредставление) Тогда
				ТекстСообщения = НСтр("ru='Невозможно напечатать %НазваниеФормы% для ""%Документ%"",
				|т.к. не заполнено поле ""Склад"".'");
				
			ИначеЕсли ВыборкаПоШапке.НарушенаОрдернаяСхема Тогда
				ТекстСообщения = НСтр("ru='Невозможно напечатать %НазваниеФормы% для ""%Документ%"",
				|т.к. на складе ""%Склад%"" используется ордерная схема, поэтому печать задания должна вестись из ордера.'");
				
			ИначеЕсли (ТипЗнч(ВыборкаПоШапке.Ссылка) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары")
				ИЛИ ТипЗнч(ВыборкаПоШапке.Ссылка) = Тип("ДокументСсылка.ОрдерНаПеремещениеТоваров")
				ИЛИ ТипЗнч(ВыборкаПоШапке.Ссылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары"))
				И ВыборкаПоШапке.ИспользуетсяАдресноеХранение Тогда
				
				ТекстСообщения = НСтр("ru='Невозможно напечатать %НазваниеФормы% для ""%Документ%"",
				|т.к. для склада (помещения) с ячейками, используемыми для хранения остатков номенклатуры, эта печатная форма не предусмотрена.
				|Печать задания на отбор (размещение) возможна из документа ""Отбор (размещение) товаров"".'");
				
			ИначеЕсли ТипЗнч(ВыборкаПоШапке.Ссылка) = Тип("ДокументСсылка.ПересчетТоваров")
				И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаПоШапке.Ссылка, "Статус") 
				= Перечисления.СтатусыПересчетовТоваров.Подготовлено Тогда
				ТекстСообщения = НСтр("ru='Невозможно напечатать ""%НазваниеФормы%"" для ""%Документ%"",
				|в статусе ""%СтатусПересчета%"".'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СтатусПересчета%", Перечисления.СтатусыПересчетовТоваров.Подготовлено);
			ИначеЕсли ТекущаяСсылка <> ВыборкаПоШапке.Ссылка
				И НЕ ВыборкаПоСсылкам.НайтиСледующий(Новый Структура("Ссылка", ВыборкаПоШапке.Ссылка)) Тогда
				Если ТипЗнч(ВыборкаПоШапке.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
					ТекстСообщения = НСтр("ru='Невозможно напечатать ""%НазваниеФормы%"" для ""%Документ%"",
					|т.к. в табличной части отсутствуют строки номенклатуры с типом ""Товар"" и действием ""Отгрузить"" или ""Отгрузить обособленно"".'");
				ИначеЕсли ТипЗнч(ВыборкаПоШапке.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
					ТекстСообщения = НСтр("ru='Невозможно напечатать ""%НазваниеФормы%"" для ""%Документ%"",
					|т.к. в табличной части отсутствуют строки номенклатуры с типом ""Товар"" и действием ""Отгрузить"".'");
				Иначе
					ТекстСообщения = НСтр("ru='Невозможно напечатать ""%НазваниеФормы%"" для ""%Документ%"",
					|т.к. в табличной части отсутствует отгружаемая номенклатура с типом ""Товар"".'");
				КонецЕсли;
			ИначеЕсли ТекущаяСсылка <> ВыборкаПоШапке.Ссылка Тогда 
				ТекущаяСсылка = ВыборкаПоШапке.Ссылка;	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекстСообщения) Тогда
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"%Документ%", ВыборкаПоШапке.СсылкаПредставление);
				ТекстСообщения = СтрЗаменить(ТекстСообщения,
				"%Склад%",
				СкладыСервер.ПолучитьПредставлениеСклада(ВыборкаПоШапке.СкладПредставление, 
				ВыборкаПоШапке.ПомещениеПредставление));
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"%НазваниеФормы%",НазваниеФормы);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецЕсли;
			
			ИспользоватьСерии = Ложь;
			
			Если ЕстьПолеИспользоватьСерииНоменклатуры Тогда
				ИспользоватьСерии = ВыборкаПоШапке.ИспользоватьСерииНоменклатуры;
			КонецЕсли;
			
			ИспользуетсяСправочноеХранение = ВыборкаПоШапке.ИспользуетсяСправочноеХранение;
			
			ВыборкаПоСкладам = ВыборкаПоСсылкам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоСкладам.НайтиСледующий(Новый Структура("Склад",ВыборкаПоШапке.Склад)) Цикл
				ВыборкаРабочиеУчастки = ВыборкаПоСкладам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Если Не ПервыйДокумент Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				
				Если ДанныеПоШапке.Колонки.Найти("ВыводитьПоУчету") <> Неопределено И ТипЗадания  = "ЗаданиеНаПересчет" Тогда
					ВыводитьПоУчету = ВыборкаПоШапке.ВыводитьПоУчету;
				КонецЕсли;
				
				Если ВыводитьКоды И ИспользуетсяСправочноеХранение И (ВыводитьУпаковки ИЛИ ВыводитьПоУчету) Тогда
					ОбластьШапкаТаблицы	  		  =  ОбластьШапкаТаблицыОснова;
					ОбластьРабочийУчасток		  =  ОбластьРабочийУчастокОснова;
					ОбластьСтрокаТаблицы	      =  ОбластьСтрокаТаблицыОснова;
					ОбластьПодвалТаблицы 		  =  ОбластьПодвалТаблицыОснова;
				ИначеЕсли ВыводитьКоды И ИспользуетсяСправочноеХранение И НЕ (ВыводитьУпаковки И ВыводитьПоУчету) Тогда
					ОбластьШапкаТаблицы	  		  =  ОбластьШапкаТаблицыБезУпаковок;
					ОбластьРабочийУчасток		  =  ОбластьРабочийУчастокБезУпаковок;
					ОбластьСтрокаТаблицы	      =  ОбластьСтрокаТаблицыБезУпаковок;
					ОбластьПодвалТаблицы 		  =  ОбластьПодвалТаблицыБезУпаковок;
				ИначеЕсли ВыводитьКоды И НЕ ИспользуетсяСправочноеХранение И (ВыводитьУпаковки ИЛИ ВыводитьПоУчету) Тогда
					ОбластьШапкаТаблицы	  		  =  ОбластьШапкаТаблицыБезЯчеек;
					ОбластьРабочийУчасток		  =  ОбластьРабочийУчастокБезЯчеек;
					ОбластьСтрокаТаблицы	      =  ОбластьСтрокаТаблицыБезЯчеек;
					ОбластьПодвалТаблицы 		  =  ОбластьПодвалТаблицыБезЯчеек;
				ИначеЕсли ВыводитьКоды И НЕ ИспользуетсяСправочноеХранение И НЕ (ВыводитьУпаковки И ВыводитьПоУчету) Тогда
					ОбластьШапкаТаблицы	  		  =  ОбластьШапкаТаблицыБезЯчеекБезУпаковок;
					ОбластьРабочийУчасток		  =  ОбластьРабочийУчастокБезЯчеекБезУпаковок;
					ОбластьСтрокаТаблицы	      =  ОбластьСтрокаТаблицыБезЯчеекБезУпаковок;
					ОбластьПодвалТаблицы 		  =  ОбластьПодвалТаблицыБезЯчеекБезУпаковок;
				ИначеЕсли НЕ ВыводитьКоды И ИспользуетсяСправочноеХранение И (ВыводитьУпаковки ИЛИ ВыводитьПоУчету)  Тогда
					ОбластьШапкаТаблицы	  		  =  ОбластьШапкаТаблицыБезКодов;
					ОбластьРабочийУчасток		  =  ОбластьРабочийУчастокБезКодов;
					ОбластьСтрокаТаблицы	      =  ОбластьСтрокаТаблицыБезКодов;
					ОбластьПодвалТаблицы 		  =  ОбластьПодвалТаблицыБезКодов;
				ИначеЕсли НЕ ВыводитьКоды И ИспользуетсяСправочноеХранение И НЕ (ВыводитьУпаковки И ВыводитьПоУчету) Тогда
					ОбластьШапкаТаблицы	  		  =  ОбластьШапкаТаблицыБезУпаковокБезКодов;
					ОбластьРабочийУчасток		  =  ОбластьРабочийУчастокБезУпаковокБезКодов;
					ОбластьСтрокаТаблицы	      =  ОбластьСтрокаТаблицыБезУпаковокБезКодов;
					ОбластьПодвалТаблицы 		  =  ОбластьПодвалТаблицыБезУпаковокБезКодов;
				ИначеЕсли НЕ ВыводитьКоды И НЕ ИспользуетсяСправочноеХранение И (ВыводитьУпаковки И ВыводитьПоУчету) Тогда	
					ОбластьШапкаТаблицы	  		  =  ОбластьШапкаТаблицыБезЯчеекБезКодов;
					ОбластьРабочийУчасток		  =  ОбластьРабочийУчастокБезЯчеекБезКодов;
					ОбластьСтрокаТаблицы	      =  ОбластьСтрокаТаблицыБезЯчеекБезКодов;
					ОбластьПодвалТаблицы 		  =  ОбластьПодвалТаблицыБезЯчеекБезКодов;
				ИначеЕсли НЕ ВыводитьКоды И НЕ ИспользуетсяСправочноеХранение И НЕ (ВыводитьУпаковки И ВыводитьПоУчету) Тогда
					ОбластьШапкаТаблицы	  		  =  ОбластьШапкаТаблицыБезЯчеекБезУпаковокБезКодов;
					ОбластьРабочийУчасток		  =  ОбластьРабочийУчастокБезЯчеекБезУпаковокБезКодов;
					ОбластьСтрокаТаблицы	      =  ОбластьСтрокаТаблицыБезЯчеекБезУпаковокБезКодов;
					ОбластьПодвалТаблицы 		  =  ОбластьПодвалТаблицыБезЯчеекБезУпаковокБезКодов;
				КонецЕсли;
				
				ПервыйДокумент 		= Ложь;
				НомерСтрокиНачало 	= ТабличныйДокумент.ВысотаТаблицы + 1;
				ПредставлениеСклада = СкладыСервер.ПолучитьПредставлениеСклада(ВыборкаПоШапке.СкладПредставление,
				ВыборкаПоШапке.ПомещениеПредставление);
				
				РеквизитыДокумента 	= Новый Структура("Номер, Дата, Префикс, Представление");
				ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ВыборкаПоШапке);
				РеквизитыДокумента.Представление = ВыборкаПоШапке.СсылкаПредставление;
				
				ПредставлениеРаспоряжения = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента,, Истина);
				
				ОбластьЗаголовок.Параметры.ТекстЗаголовка = НазваниеФормы;
				//ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьЗаголовок, ВыборкаПоШапке.Ссылка);
				
				ТабличныйДокумент.Вывести(ОбластьЗаголовок);
				
				ОбластьШапка.Параметры.ПредставлениеСклада 		 = ПредставлениеСклада;
				ОбластьШапка.Параметры.ПредставлениеРаспоряжения = ПредставлениеРаспоряжения;
				
				ТабличныйДокумент.Вывести(ОбластьШапка);
				
				Если ТипЗнч(ВыборкаПоШапке.Ссылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
					
					Счетчик = 0;
					ПредставлениеОснований = "";
					ПервоеРаспоряжение = Истина;
					РеквизитыДокумента = Новый Структура("Дата, Номер, Префикс, Представление");
					
					Пока ВыборкаПоРаспоряжениям.НайтиСледующий(Новый Структура("Ссылка", ВыборкаПоШапке.Ссылка)) Цикл
						
						РеквизитыДокумента.Дата          = ВыборкаПоРаспоряжениям.ОснованиеДата;
						РеквизитыДокумента.Номер         = ВыборкаПоРаспоряжениям.ОснованиеНомер;
						РеквизитыДокумента.Префикс       = "";
						РеквизитыДокумента.Представление = ВыборкаПоРаспоряжениям.ОснованиеПредставление;
						
						ПредставлениеОснования = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента);
						
						Если Не ПервоеРаспоряжение Тогда
							ПредставлениеОснований = ПредставлениеОснований + ", ";		
						КонецЕсли;
						
						ПервоеРаспоряжение = Ложь;
						
						ПредставлениеОснований = ПредставлениеОснований + ПредставлениеОснования;
						
						Счетчик = Счетчик + 1;
						
					КонецЦикла;
					
					ЗаголовокОснования = "";
					Если Счетчик > 1 Тогда 
						ЗаголовокОснования = НСтр("ru = 'Основания:'");
					Иначе
						ЗаголовокОснования = НСтр("ru = 'Основание:'");
					КонецЕсли;
					
					ОбластьОснование.Параметры.ПредставлениеОснований = ПредставлениеОснований;
					ОбластьОснование.Параметры.Основания = ЗаголовокОснования;
					
					ТабличныйДокумент.Вывести(ОбластьОснование);
					
					//**Изменено 17.09.19 Максимов
					Если ТипЗнч(ВыборкаПоСсылкам.Ссылка.Получатель) = Тип("СправочникСсылка.Склады") Тогда 
						ОбластьКонтрагент.Параметры.Контрагент = ВыборкаПоСсылкам.Ссылка.Получатель.Наименование;
					Иначе	
						ОбластьКонтрагент.Параметры.Контрагент = ВыборкаПоСсылкам.Ссылка.Получатель.НаименованиеПолное;
					КонецЕсли;	
					ТабличныйДокумент.Вывести(ОбластьКонтрагент);				
					//****************************					
					
					Если ВыборкаПоШапке.ОтгрузкаПоЗаданиюНаПеревозку Тогда
						
						РеквизитыДокумента.Дата          = ВыборкаПоШапке.ЗаданиеНаПеревозкуДата;
						РеквизитыДокумента.Номер         = ВыборкаПоШапке.ЗаданиеНаПеревозкуНомер;
						РеквизитыДокумента.Префикс       = "";
						РеквизитыДокумента.Представление = ВыборкаПоШапке.ЗаданиеНаПеревозкуПредставление;
						
						ОбластьЗаданиеНаПеревозку.Параметры.ЗаданиеНаПеревозкуПредставление	= 
						ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента);
						ОбластьЗаданиеНаПеревозку.Параметры.ПорядокДоставки = ВыборкаПоШапке.ПорядокДоставки;
						
						ТабличныйДокумент.Вывести(ОбластьЗаданиеНаПеревозку);
						
					КонецЕсли;
					
				КонецЕсли;
				
				//***************************************************************
				//ИЗМЕНЕНО Стефутин В.П. 29.04.2023                         
				Если ТипЗнч(ВыборкаПоШапке.Ссылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
					Если НЕ ( ВыборкаПоШапке.Ссылка._ЗаявкаНаДоставку.Пустая() ) Тогда 
						ЗаявкаНаДоставку = ВыборкаПоШапке.Ссылка._ЗаявкаНаДоставку;
						Если ( ЗаявкаНаДоставку.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз ) Тогда
							ОбластьЗаявкаНаДоставку.Параметры.ВариантДоставки = "Доставка:";
							ОбластьЗаявкаНаДоставку.Параметры.ТекстДоставки = "Самовывоз";
						Иначе
							ОбластьЗаявкаНаДоставку.Параметры.ВариантДоставки = "Адрес доставки:";
							ОбластьЗаявкаНаДоставку.Параметры.ТекстДоставки = ЗаявкаНаДоставку.АдресДоставки;
						КонецЕсли;
						ТабличныйДокумент.Вывести(ОбластьЗаявкаНаДоставку);
					КонецЕсли; 
				КонецЕсли;	
				//***************************************************************	
				
				
				
				Если ТипЗадания = "ЗаданиеНаПересчет" Тогда
					ОбластьИсполнитель.Параметры.ИсполнительПредставление = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ВыборкаПоШапке.ИсполнительПредставление, РеквизитыДокумента.Дата);
					ТабличныйДокумент.Вывести(ОбластьИсполнитель);
				КонецЕсли;
				
				ВыводитьУчастки = Ложь;
				ВыводитьУчастки = (ВыборкаПоШапке.ИспользованиеРабочихУчастков = Перечисления.ИспользованиеСкладскихРабочихУчастков.Использовать);
				
				ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
				
				НомерСтроки = 1;
				
				Пока ВыборкаРабочиеУчастки.Следующий() Цикл
					
					Если ВыводитьУчастки И ЗначениеЗаполнено(ВыборкаРабочиеУчастки.РабочийУчасток) Тогда
						ОбластьРабочийУчасток.Параметры.Заполнить(ВыборкаРабочиеУчастки);
						ТабличныйДокумент.Вывести(ОбластьРабочийУчасток);
					КонецЕсли;
					
					ВыборкаНомерСтроки = ВыборкаРабочиеУчастки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаНомерСтроки.Следующий() Цикл
						
						ВыборкаПоТовару = ВыборкаНомерСтроки.Выбрать();
						
						Пока ВыборкаПоТовару.Следующий() Цикл  
							
							//**Изменено 16.09.19 Максимов
							СтрокаСерий = "";
							Заказ = ПолучитьЗаказПоРаспоряжению(ВыборкаПоШапке.Ссылка.ТоварыПоРаспоряжениям);
							
							Если ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
								Заказ = Заказ.Назначение.Заказ;
							КонецЕсли;	
							
							Если  ТипЗнч(ВыборкаПоШапке.Ссылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
								Запрос = ПолучитьЗаказОрдер();
								
								Запрос.УстановитьПараметр("РасходныйОрдер"	, ВыборкаПоШапке.Ссылка);
								Запрос.УстановитьПараметр("Номенклатура"	, ВыборкаПоТовару.Номенклатура);
								Запрос.УстановитьПараметр("Заказ"			, Заказ			);
								
								Результат = Запрос.ВыполнитьПакет();
								тРасход = Результат.Получить(5).Выгрузить();
								Если тРасход.Количество() = 0 Тогда
									Запрос = ПолучитьЗаказОрдер2();
									
									Запрос.УстановитьПараметр("РасходныйОрдер"	, ВыборкаПоШапке.Ссылка);
									Запрос.УстановитьПараметр("Номенклатура"	, ВыборкаПоТовару.Номенклатура);
									Запрос.УстановитьПараметр("Заказ"			, Заказ			);
									
									Результат = Запрос.ВыполнитьПакет();									
								КонецЕсли;	
								//Результат = Запрос.Выполнить().Выгрузить();
							Иначе							
								Запрос = ПолучитьПроизводителя();
								
								Запрос.УстановитьПараметр("Номенклатура", ВыборкаПоТовару.Номенклатура);
								Запрос.УстановитьПараметр("ДокументОснование", ВыборкаПоРаспоряжениям.Ссылка._ЗаявкаНаДоставку.ДокументОснование);							
								Запрос.УстановитьПараметр("Заказ"			, Заказ			);
								
								Результат = Запрос.Выполнить().Выгрузить();		
							КонецЕсли;														
							//****************************							
							
							Если ВыборкаПоТовару.НастройкаИспользованияСерий = Перечисления.НастройкиИспользованияСерийНоменклатуры.ЭкземплярТовара Тогда
								
								ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаПоТовару);
								ОбластьСтрокаТаблицы.Параметры.НомерСтроки = НомерСтроки;
								НомерСтроки = НомерСтроки + 1;
								
								Если ВыводитьКоды Тогда
									ОбластьСтрокаТаблицы.Параметры.Артикул = ВыборкаПоТовару[КолонкаКодов];
								КонецЕсли;
								
								СтруктураПоиска = Новый Структура("Ссылка, Склад, РабочийУчасток, Номенклатура, Характеристика");
								ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаПоТовару);
								
								СтрокаСерий = "";
								Пока ВыборкаПоСериям.НайтиСледующий(СтруктураПоиска) Цикл 
									СтрокаСерий = СтрокаСерий + ВыборкаПоСериям.ПредставлениеСерии + ", ";
								КонецЦикла;
								
								Если СтрДлина(СтрокаСерий) <> 0 Тогда
									СтрокаСерий = Лев(СтрокаСерий, СтрДлина(СтрокаСерий) - 2);
								КонецЕсли;
								
								ОбластьСтрокаТаблицы.Параметры.Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
								ВыборкаПоТовару.ПредставлениеНоменклатуры,
								ВыборкаПоТовару.ПредставлениеХарактеристики,
								, // Упаковка
								СтрокаСерий);
								
								Если ИспользуетсяСправочноеХранение Тогда
									
									ВыборкаПоТовару.Сбросить();
									
									ДопЯчейки = "";
									Пока ВыборкаПоТовару.Следующий() Цикл	
										ДопЯчейки = ДопЯчейки + ВыборкаПоТовару.ЯчейкаПредставление + Символы.ПС;	
									КонецЦикла;
									ОбластьСтрокаТаблицы.Параметры.ДополнительныеЯчейки = ДопЯчейки;
								КонецЕсли;
								
								ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
								
							Иначе	
								
								//**Изменено Максимов
								
								ТекНоменклатура   	= Неопределено;
								ТекХарактеристика 	= Неопределено;
								ТекСерия 		  	= Неопределено;
								ЗаказПоРаспоряжению = Неопределено;
								Количество 		  	= 0;								
								РазделениеСтрок = Ложь;
								
								тПриход = Результат.Получить(4).Выгрузить();
								тРасход = Результат.Получить(5).Выгрузить();
								
								Если ВыборкаПоТовару.Номенклатура.ВидНоменклатуры.Наименование = "Комплекты" Тогда
									//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.								
									нСтрока = нТаб.Добавить();		
									//******************
									
									Результат = ПолучитьДокументСборки(Заказ);
									Если Результат.Количество() = 0 Тогда
										Для Каждого Строка Из Результат Цикл
											
											//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.
											нСтрока.Поставщик 		= Строка.Склад; 
											нСтрока.НомерДокумента 	= Строка.Номер;
											нСтрока.ДатаДокумента 	= Строка.Дата; 																						
											//ОбластьСтрокаТаблицы.Параметры.Поставщик = Строка.Склад;
											//ОбластьСтрокаТаблицы.Параметры.НомерДокумента = Строка.Номер + " " + Формат(Строка.Дата, "ДЛФ=Д");											
											//******************
										КонецЦикла;	
									Иначе	
										Для Каждого Строка Из Результат Цикл
											Если ВыборкаПоТовару.Номенклатура = Строка.Номенклатура Тогда
												//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.
												Попытка
													нСтрока.Поставщик 		= Строка.Склад; 
													нСтрока.НомерДокумента 	= Строка.Номер;
													нСтрока.ДатаДокумента 	= Строка.Дата; 	
												Исключение
													нСтрока.Поставщик 		= Строка.Склад; 
													нСтрока.НомерДокумента 	= Строка.Ссылка.Номер;
													нСтрока.ДатаДокумента 	= Строка.Ссылка.Дата; 	
												КонецПопытки;	
												//ОбластьСтрокаТаблицы.Параметры.Поставщик 		= Строка.Ссылка.Склад;
												//ОбластьСтрокаТаблицы.Параметры.НомерДокумента 	= Строка.Ссылка.Номер + " " + Формат(Строка.Ссылка.Дата, "ДЛФ=Д");												
												//******************
											КонецЕсли;											
										КонецЦикла;	
									КонецЕсли;	
									
									Количество 			= ВыборкаПоТовару.Количество;											
									
									//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.
									//ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаПоТовару);																		
									нСтрока.НомерСтроки = НомерСтроки;									
									//ОбластьСтрокаТаблицы.Параметры.НомерСтроки = НомерСтроки;									
									//******************
									
									НомерСтроки = НомерСтроки + 1;
									
									Если ВыводитьКоды Тогда
										//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.
										нСтрока.Артикул = ВыборкаПоТовару[КолонкаКодов]; 
										//ОбластьСтрокаТаблицы.Параметры.Артикул = ВыборкаПоТовару[КолонкаКодов];
										//******************										
									КонецЕсли;
									
									//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.
									нСтрока.Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
									?(ЗначениеЗаполнено(ВыборкаПоТовару.Номенклатура), 
									ВыборкаПоТовару.ПредставлениеНоменклатуры, 
									НСтр("ru = '<пустая ячейка>'")),
									ВыборкаПоТовару.ПредставлениеХарактеристики,
									, // Упаковка
									ВыборкаПоТовару.ПредставлениеСерии); 
									
									//ОбластьСтрокаТаблицы.Параметры.Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
									//	?(ЗначениеЗаполнено(ВыборкаПоТовару.Номенклатура), 
									//		ВыборкаПоТовару.ПредставлениеНоменклатуры, 
									//		НСтр("ru = '<пустая ячейка>'")),
									//	ВыборкаПоТовару.ПредставлениеХарактеристики,
									//	, // Упаковка
									//	ВыборкаПоТовару.ПредставлениеСерии);	
									//******************
									
									СтрокаКоличестваУпаковок = "";
									СтрокаИменованийУпаковок = "";
									
									ПредставлениеЕдининицыИзмеренияУпаковки = ВыборкаПоТовару.ПредставлениеБазовойЕдиницыИзмерения;
									
									Если ИспользуетсяСправочноеХранение Тогда
										
										ДопЯчейки = ВыборкаПоТовару.ЯчейкаПредставление + Символы.ПС;
										СтуктураПоискаТовара = Новый Структура;
										СтуктураПоискаТовара.Вставить("Номенклатура", ВыборкаПоТовару.Номенклатура);
										СтуктураПоискаТовара.Вставить("Характеристика", ВыборкаПоТовару.Характеристика);
										СтуктураПоискаТовара.Вставить("Серия", ВыборкаПоТовару.Серия);
										
										Пока ВыборкаПоТовару.НайтиСледующий(СтуктураПоискаТовара) Цикл	
											ДопЯчейки = ДопЯчейки + ВыборкаПоТовару.ЯчейкаПредставление + Символы.ПС;	
										КонецЦикла;
										ОбластьСтрокаТаблицы.Параметры.ДополнительныеЯчейки = ДопЯчейки;
									КонецЕсли;
									
									Если (ВыводитьУпаковки ИЛИ ВыводитьПоУчету) Тогда 
										Если ТипЗадания  <> "ЗаданиеНаПересчет" И СтруктураОбъектов.Ключ <> "Документ.ПересчетТоваров" Тогда
											СтруктураПоиска = Новый Структура("Ссылка,Склад,РабочийУчасток,НомерСтроки");
											ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаПоТовару);
											ВыборкаПоУпаковкам.Сбросить();
											Пока ВыборкаПоУпаковкам.НайтиСледующий(СтруктураПоиска) Цикл
												Если Количество <> Неопределено Тогда
													КоличествоВДокумент = Цел(Количество / ВыборкаПоУпаковкам.КоличествоВУпаковке);
													Если КоличествоВДокумент > 0 Тогда
														СтрокаКоличестваУпаковок = СтрокаКоличестваУпаковок + КоличествоВДокумент + Символы.ПС;
														СтрокаИменованийУпаковок = СтрокаИменованийУпаковок 
														+ ВыборкаПоУпаковкам.ПредставлениеЕдининицыИзмеренияУпаковки 
														+ Символы.ПС;
														Если Количество = КоличествоВДокумент * ВыборкаПоУпаковкам.КоличествоВУпаковке Тогда
															Количество = Неопределено;
														Иначе
															Количество = Количество - КоличествоВДокумент * ВыборкаПоУпаковкам.КоличествоВУпаковке;
														КонецЕсли;
													КонецЕсли;
												КонецЕсли;
											КонецЦикла;
											
											Если Количество <> Неопределено Тогда							
												СтрокаКоличестваУпаковок = СтрокаКоличестваУпаковок + Количество;
												СтрокаИменованийУпаковок = СтрокаИменованийУпаковок + ПредставлениеЕдининицыИзмеренияУпаковки;	
											КонецЕсли;
											
											//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.
											нСтрока.КоличествоУпаковок 	= СтрокаКоличестваУпаковок;
											нСтрока.ЕдиницаИзмерения	= СтрокаИменованийУпаковок;
											//ОбластьСтрокаТаблицы.Параметры.КоличествоУпаковок = СтрокаКоличестваУпаковок;
											//ОбластьСтрокаТаблицы.Параметры.ПредставлениеЕдининицыИзмеренияУпаковки = СтрокаИменованийУпаковок;
											//******************
										КонецЕсли;
									КонецЕсли;
									ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);		
								Иначе								
									тКеш = ПолучитьЗапросОтбора(ВыборкаПоШапке.Ссылка,ВыборкаПоТовару.Номенклатура, Заказ);
									
									Для Каждого СтрокаПриход Из тКеш Цикл
										Для Каждого Эл Из СтрокаПриход.тРасход Цикл
											
											Если тКеш.Количество() > 1 Тогда 
												РазделениеСтрок = Истина;
											КонецЕсли;
											
											Если ВыборкаПоТовару.Ссылка <> Эл.Ссылка Тогда
												Продолжить;												
											КонецЕсли;	
											
											Если Эл.Количество = 0 Тогда
												Продолжить;
											КонецЕсли;	
											
											//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.								
											нСтрока = нТаб.Добавить();		
											//******************
											
											Если НЕ РазделениеСтрок Тогда
												Если ВыборкаПоТовару.Номенклатура.ВидНоменклатуры.Наименование = "Комплекты" Тогда
													Результат = ПолучитьДокументСборки(Заказ);
													Если Результат.Количество() = 0 Тогда
														Для Каждого Строка Из Результат Цикл
															//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.
															нСтрока.Поставщик 		= Строка.Склад; 
															нСтрока.НомерДокумента 	= Строка.Номер;
															нСтрока.ДатаДокумента 	= Строка.Дата; 																										
															//ОбластьСтрокаТаблицы.Параметры.Поставщик = Строка.Склад;
															//ОбластьСтрокаТаблицы.Параметры.НомерДокумента = Строка.Номер + " " + Формат(Строка.Дата, "ДЛФ=Д");
															//******************
														КонецЦикла;	
													Иначе
														//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.
														нСтрока.Поставщик 		= Строка.СтрокаПриход.Контрагент;
														нСтрока.НомерДокумента 	= Строка.СсылкаПриход.Номер;
														нСтрока.ДатаДокумента 	= Строка.СсылкаПриход.Дата; 																									
														//ОбластьСтрокаТаблицы.Параметры.Поставщик 		= Строка.СтрокаПриход.Контрагент;
														//ОбластьСтрокаТаблицы.Параметры.НомерДокумента 	= Строка.СсылкаПриход.Номер + " " + Формат(Строка.СсылкаПриход.Дата, "ДЛФ=Д");
														//******************
													КонецЕсли;	
												Иначе
													Если СтрокаПриход.СсылкаПриход.Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
														//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.
														нСтрока.Поставщик 		= СтрокаПриход.ЗаказПоставщику.Контрагент;
														нСтрока.НомерДокумента 	= СтрокаПриход.Номер;
														нСтрока.ДатаДокумента 	= СтрокаПриход.Дата; 																																							
														//ОбластьСтрокаТаблицы.Параметры.Поставщик 		= СтрокаПриход.ЗаказПоставщику.Контрагент;
														//ОбластьСтрокаТаблицы.Параметры.НомерДокумента 	= СтрокаПриход.Номер + " " + Формат(СтрокаПриход.Дата, "ДЛФ=Д");
														//******************
													Иначе	
														//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.
														нСтрока.Поставщик 		= СтрокаПриход.СсылкаПриход.Контрагент;
														нСтрока.НомерДокумента 	= СтрокаПриход.СсылкаПриход.Номер;
														нСтрока.ДатаДокумента 	= СтрокаПриход.СсылкаПриход.Дата;														
														//ОбластьСтрокаТаблицы.Параметры.Поставщик 		= СтрокаПриход.СсылкаПриход.Контрагент;
														//ОбластьСтрокаТаблицы.Параметры.НомерДокумента 	= СтрокаПриход.СсылкаПриход.Номер + " " + Формат(СтрокаПриход.СсылкаПриход.Дата, "ДЛФ=Д");
														//******************
													КонецЕсли;	
												КонецЕсли;
												Если ВыборкаПоТовару.Номенклатура <> ТекНоменклатура  
													И ВыборкаПоТовару.Характеристика <> ТекХарактеристика
													И ВыборкаПоТовару.Серия <> ТекСерия Тогда
													
													Количество 			= ВыборкаПоТовару.Количество;											
												КонецЕсли
											КонецЕсли;
											
											Если РазделениеСтрок Тогда
												
												Если Эл.Ссылка = ВыборкаПоШапке.Ссылка Тогда
													Если ВыборкаПоТовару.Номенклатура.ВидНоменклатуры.Наименование = "Комплекты" Тогда
														//Заказ = ПолучитьЗаказПоРаспоряжению(Заказ);
														Результат = ПолучитьДокументСборки(Заказ);
														Если Результат.Количество() = 0 Тогда
															Для Каждого Строка Из Результат Цикл
																//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.
																нСтрока.Поставщик 		= Строка.Склад;
																нСтрока.НомерДокумента 	= Строка.Номер;
																нСтрока.ДатаДокумента 	= Строка.Дата;																															
																//ОбластьСтрокаТаблицы.Параметры.Поставщик = Строка.Склад;
																//ОбластьСтрокаТаблицы.Параметры.НомерДокумента = Строка.Номер + " " + Формат(Строка.Дата, "ДЛФ=Д");
																//******************
															КонецЦикла;	
														Иначе
															//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.
															нСтрока.Поставщик 		= Эл.Контрагент;
															нСтрока.НомерДокумента 	= Эл.СсылкаПриход.Номер;
															нСтрока.ДатаДокумента 	= Эл.СсылкаПриход.Дата;																																															
															//ОбластьСтрокаТаблицы.Параметры.Поставщик 		= Эл.Контрагент;
															//ОбластьСтрокаТаблицы.Параметры.НомерДокумента 	= Эл.СсылкаПриход.Номер + " " + Формат(Эл.СсылкаПриход.Дата, "ДЛФ=Д");
															//******************
														КонецЕсли;	
													Иначе
														
														//**ИЗМЕНЕНО Максимов В.А.
														
														Если ТипЗнч(СтрокаПриход.СсылкаПриход) = Тип("Null") Тогда
															
														Иначе	
															Если СтрокаПриход.СсылкаПриход.Контрагент = Справочники.Контрагенты.ПустаяСсылка() И 
																СтрокаПриход.СсылкаПриход.Партнер = Справочники.Партнеры.ПустаяСсылка() Тогда
																
																//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.
																нСтрока.Поставщик 		= Эл.ЗаказПоставщику.Контрагент;
																нСтрока.НомерДокумента 	= Эл.Номер;
																нСтрока.ДатаДокумента 	= Эл.Дата;																 
																//ОбластьСтрокаТаблицы.Параметры.Поставщик 		= Эл.ЗаказПоставщику.Контрагент;
																//ОбластьСтрокаТаблицы.Параметры.НомерДокумента 	= ЭЛ.Номер + " " + Формат(Эл.Дата, "ДЛФ=Д");
																//******************
															Иначе	
																//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.
																Если СтрокаПриход.СсылкаПриход.Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда																		
																	нСтрока.Поставщик 		= СтрокаПриход.СсылкаПриход.Партнер;
																	//ОбластьСтрокаТаблицы.Параметры.Поставщик 		= СтрокаПриход.СсылкаПриход.Партнер;
																Иначе	
																	нСтрока.Поставщик 		= СтрокаПриход.СсылкаПриход.Контрагент; 
																	//ОбластьСтрокаТаблицы.Параметры.Поставщик 		= СтрокаПриход.СсылкаПриход.Контрагент;
																КонецЕсли;
																
																нСтрока.НомерДокумента 	= СтрокаПриход.СсылкаПриход.Номер;
																нСтрока.ДатаДокумента 	= СтрокаПриход.СсылкаПриход.Дата;																 
																//ОбластьСтрокаТаблицы.Параметры.НомерДокумента 	= СтрокаПриход.СсылкаПриход.Номер + " " + Формат(СтрокаПриход.СсылкаПриход.Дата, "ДЛФ=Д");
																//*****************
																
															КонецЕсли;	
														КонецЕсли;	
														
														//***********************
														
													КонецЕсли;
												Иначе
													Продолжить;
												КонецЕсли;
												Если ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
													Количество 			= ВыборкаПоТовару.Количество;											
												Иначе
													//Если ВыборкаПоТовару.Количество > Эл.Количество Тогда 
													//	Количество = СтрокаПриход.КоличествоПоставщику;
													//Иначе	
													Количество = Эл.Количество; 
													//КонецЕсли;	
												КонецЕсли;	
												//КонецЦикла;
											КонецЕсли;
											
											//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.
											//ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаПоТовару);
											нСтрока.НомерСтроки = НомерСтроки; 
											//ОбластьСтрокаТаблицы.Параметры.НомерСтроки = НомерСтроки;
											//******************
											
											НомерСтроки = НомерСтроки + 1;
											
											Если ВыводитьКоды Тогда
												//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.
												нСтрока.Артикул = ВыборкаПоТовару[КолонкаКодов]; 												
												//ОбластьСтрокаТаблицы.Параметры.Артикул = ВыборкаПоТовару[КолонкаКодов];
												//******************
											КонецЕсли;
											
											//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.											
											нСтрока.Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
											?(ЗначениеЗаполнено(ВыборкаПоТовару.Номенклатура), 
											ВыборкаПоТовару.ПредставлениеНоменклатуры, 
											НСтр("ru = '<пустая ячейка>'")),
											ВыборкаПоТовару.ПредставлениеХарактеристики,
											, // Упаковка
											ВыборкаПоТовару.ПредставлениеСерии);
											
											//ОбластьСтрокаТаблицы.Параметры.Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
											//	?(ЗначениеЗаполнено(ВыборкаПоТовару.Номенклатура), 
											//		ВыборкаПоТовару.ПредставлениеНоменклатуры, 
											//		НСтр("ru = '<пустая ячейка>'")),
											//	ВыборкаПоТовару.ПредставлениеХарактеристики,
											//	, // Упаковка
											//	ВыборкаПоТовару.ПредставлениеСерии);	
											//*****************
											
											СтрокаКоличестваУпаковок = "";
											СтрокаИменованийУпаковок = "";
											
											ПредставлениеЕдининицыИзмеренияУпаковки = ВыборкаПоТовару.ПредставлениеБазовойЕдиницыИзмерения;
											
											Если ИспользуетсяСправочноеХранение Тогда
												
												ДопЯчейки = ВыборкаПоТовару.ЯчейкаПредставление + Символы.ПС;
												СтуктураПоискаТовара = Новый Структура;
												СтуктураПоискаТовара.Вставить("Номенклатура", ВыборкаПоТовару.Номенклатура);
												СтуктураПоискаТовара.Вставить("Характеристика", ВыборкаПоТовару.Характеристика);
												СтуктураПоискаТовара.Вставить("Серия", ВыборкаПоТовару.Серия);
												
												Пока ВыборкаПоТовару.НайтиСледующий(СтуктураПоискаТовара) Цикл	
													ДопЯчейки = ДопЯчейки + ВыборкаПоТовару.ЯчейкаПредставление + Символы.ПС;	
												КонецЦикла;
												ОбластьСтрокаТаблицы.Параметры.ДополнительныеЯчейки = ДопЯчейки;
											КонецЕсли;
											
											Если (ВыводитьУпаковки ИЛИ ВыводитьПоУчету) Тогда 
												Если ТипЗадания  <> "ЗаданиеНаПересчет" И СтруктураОбъектов.Ключ <> "Документ.ПересчетТоваров" Тогда
													СтруктураПоиска = Новый Структура("Ссылка,Склад,РабочийУчасток,НомерСтроки");
													ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаПоТовару);
													ВыборкаПоУпаковкам.Сбросить();
													Пока ВыборкаПоУпаковкам.НайтиСледующий(СтруктураПоиска) Цикл
														Если Количество <> Неопределено Тогда
															КоличествоВДокумент = Цел(Количество / ВыборкаПоУпаковкам.КоличествоВУпаковке);
															Если КоличествоВДокумент > 0 Тогда
																СтрокаКоличестваУпаковок = СтрокаКоличестваУпаковок + КоличествоВДокумент + Символы.ПС;
																СтрокаИменованийУпаковок = СтрокаИменованийУпаковок 
																+ ВыборкаПоУпаковкам.ПредставлениеЕдининицыИзмеренияУпаковки 
																+ Символы.ПС;
																Если Количество = КоличествоВДокумент * ВыборкаПоУпаковкам.КоличествоВУпаковке Тогда
																	Количество = Неопределено;
																Иначе
																	Количество = Количество - КоличествоВДокумент * ВыборкаПоУпаковкам.КоличествоВУпаковке;
																КонецЕсли;
															КонецЕсли;
														КонецЕсли;
													КонецЦикла;
													
													Если Количество <> Неопределено Тогда							
														СтрокаКоличестваУпаковок = СтрокаКоличестваУпаковок + Количество;
														СтрокаИменованийУпаковок = СтрокаИменованийУпаковок + ПредставлениеЕдининицыИзмеренияУпаковки;	
													КонецЕсли;
													//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.
													нСтрока.КоличествоУпаковок 	= СтрокаКоличестваУпаковок;
													нСтрока.ЕдиницаИзмерения	= СтрокаИменованийУпаковок;													
													//ОбластьСтрокаТаблицы.Параметры.КоличествоУпаковок = СтрокаКоличестваУпаковок;
													//ОбластьСтрокаТаблицы.Параметры.ПредставлениеЕдининицыИзмеренияУпаковки = СтрокаИменованийУпаковок;
													//******************
												КонецЕсли;
											КонецЕсли;
											//***********************************
											//**ИЗМЕНЕНО Максимов В.А. 16.06.2020
											//**Заглушка вывода нулевого значения
											//Если НЕ ( ОбластьСтрокаТаблицы.Параметры.КоличествоУпаковок = "0" ) Тогда	
											//	ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);		
											//КонецЕсли;	
											//***********************************
										КонецЦикла;		
									КонецЦикла;	
								КонецЕсли;	
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;	
				КонецЦикла;
				
				//**НОВОЕ ДОБАВЛЕНИЕ Максимов В.А.
				нТаб.Сортировать("Поставщик, НомерДокумента"); 
				
				НомерСтроки = 0;
				Для Каждого Строка_нТаб ИЗ нТаб Цикл 
					НомерСтроки = НомерСтроки + 1;
					ОбластьСтрокаТаблицы.Параметры.НомерСтроки 			= НомерСтроки;
					ОбластьСтрокаТаблицы.Параметры.Артикул 				= Строка_нТаб.Артикул;					
					ОбластьСтрокаТаблицы.Параметры.Товар				= Строка_нТаб.Товар;
					ОбластьСтрокаТаблицы.Параметры.КоличествоУпаковок 	= Строка_нТаб.КоличествоУпаковок;
					ОбластьСтрокаТаблицы.Параметры.Поставщик 			= Строка_нТаб.Поставщик;
					ОбластьСтрокаТаблицы.Параметры.НомерДокумента 		= Строка_нТаб.НомерДокумента + " " + Формат(Строка_нТаб.ДатаДокумента, "ДЛФ=Д"); 										
					ОбластьСтрокаТаблицы.Параметры.ПредставлениеЕдининицыИзмеренияУпаковки = Строка_нТаб.ЕдиницаИзмерения;
					
					//***********************************
					//**Заглушка вывода нулевого значения
					Если НЕ ( ОбластьСтрокаТаблицы.Параметры.КоличествоУпаковок = "0" ) Тогда	
						ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);		
					КонецЕсли;	
					//***********************************
				КонецЦикла;	
				//***********************	
				
				ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
				
				//***************************************************************
				//ИЗМЕНЕНО Стефутин В.П. 15.10.2023
				Если ( ТипЗнч( ВыборкаПоШапке.Ссылка ) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") ) Тогда
					Если НЕ ( ПустаяСтрока( ВыборкаПоШапке.Ссылка.Комментарий ) ) Тогда
						ОбластьПодвалКомментарий = Макет.ПолучитьОбласть("ПодвалКомментарий");
						ОбластьПодвалКомментарий.Параметры.Комментарий = ВыборкаПоШапке.Ссылка.Комментарий;
						ТабличныйДокумент.Вывести(ОбластьПодвалКомментарий); 
					КонецЕсли;	
				КонецЕсли;	
				//***************************************************************
				
				
				
				
				УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
				ТабличныйДокумент,
				НомерСтрокиНачало,
				ОбъектыПечати,
				ВыборкаПоШапке.Ссылка);
				
			КонецЦикла;
		КонецЦикла;
		
		ТекстСообщения = "";
		Если ВыборкаПоШапке.Количество() = 0 И СтруктураОбъектов.Ключ = "Документ.ВводОстатков" Тогда
			Если ПолучитьФункциональнуюОпцию("ИспользоватьМногооборотнуюТару") Тогда	
				ТекстСообщения = НСтр("ru='Для данного типа операции документа ""Ввод остатков""
				|печать ""%НазваниеФормы%"" не требуется. 
				|Печать возможна только для операций типа ""Собственные товары"", ""Полученные на комиссию товары""  
				|и ""Принятая от поставщиков возвратная тара""'");
			Иначе 
				ТекстСообщения = НСтр("ru='Для данного типа операции документа ""Ввод остатков""
				|печать ""%НазваниеФормы%"" не требуется. 
				|Печать возможна только для операций типа ""Собственные товары"" и ""Полученные на комиссию товары""'");
			КонецЕсли;
			ТекстСообщения = СтрЗаменить(ТекстСообщения,"%НазваниеФормы%",НазваниеФормы);
			ТекстСообщения = СтрЗаменить(ТекстСообщения,"%Документ%", ВыборкаПоШапке.СсылкаПредставление);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

//**Добавлено 16.09.19 Максимов В.А.
Функция ПолучитьПроизводителя()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриобретениеТоваровУслуг.Ссылка КАК Ссылка,
	|	ПриобретениеТоваровУслуг.Номер КАК Номер,
	|	ПриобретениеТоваровУслуг.Дата КАК Дата,
	|	ПриобретениеТоваровУслуг.Контрагент КАК Контрагент,
	|	ПриобретениеТоваровУслуг.Товары.(
	|		Номенклатура КАК Номенклатура
	|	) КАК Товары,
	|	ПриобретениеТоваровУслуг.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ПриобретениеТоваровУслуг.ЗаказПоставщику.ДокументОснование КАК ЗаказПоставщикуДокументОснование,
	|	ПриобретениеТоваровУслуг.ЗаказПоставщику.Товары.(
	|		_ЗаявкаНаЗакупку.ДокументОснование КАК ЗаказПоставщику_ЗаявкаНаЗакупкуДокументОснование
	|	) КАК ЗаказПоставщику1
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|ГДЕ
	|	ПриобретениеТоваровУслуг.Товары.Номенклатура = &Номенклатура
	|	И ПриобретениеТоваровУслуг.ЗаказПоставщику.Товары._ЗаявкаНаЗакупку.ДокументОснование = &ДокументОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Возврат Запрос;
	
КонецФункции	

Функция ПолучитьЗаказОрдер2()
	
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	РасходныйОрдерНаТовары.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку
	|ПОМЕСТИТЬ тЗаданияНаперевозку
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|ГДЕ
	|	РасходныйОрдерНаТовары.Ссылка = &РасходныйОрдер
	|	И РасходныйОрдерНаТовары.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка КАК Ссылка,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура КАК Номенклатура,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Количество КАК Количество,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Назначение.Заказ КАК Заказ,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Назначение КАК Назначение,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ тОрдер
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК РасходныйОрдерНаТоварыОтгружаемыеТовары
	|ГДЕ
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка = &РасходныйОрдер
	|	И РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказПоставщикуТовары.Ссылка КАК Ссылка,
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
	|	ЗаказПоставщикуТовары.Количество КАК Количество,
	|	ЗаказПоставщикуТовары.ЗаказКлиента КАК ЗаказКлиента
	|ПОМЕСТИТЬ тЗаказыПоставщику
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка.Проведен = ИСТИНА
	|	И ЗаказПоставщикуТовары.ЗаказКлиента В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				тОрдер.Заказ
	|			ИЗ
	|				тОрдер КАК тОрдер)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПриобретениеТоваровУслуг.Ссылка КАК Ссылка,
	|	ПриобретениеТоваровУслуг.Контрагент КАК Контрагент,
	|	ПриобретениеТоваровУслуг.Номер КАК Номер,
	|	ПриобретениеТоваровУслуг.Дата КАК Дата,
	|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	|	СУММА(ПриобретениеТоваровУслугТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ тПриход
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|		ПО ПриобретениеТоваровУслугТовары.Ссылка = ПриобретениеТоваровУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ тЗаказыПоставщику КАК тЗаказыПоставщику
	|		ПО ПриобретениеТоваровУслугТовары.Номенклатура = тЗаказыПоставщику.Номенклатура
	|			И ПриобретениеТоваровУслугТовары.Характеристика = тЗаказыПоставщику.Характеристика
	|ГДЕ
	|	ПриобретениеТоваровУслуг.Проведен = ИСТИНА
	|	И ПриобретениеТоваровУслуг.ЗаказПоставщику В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				тЗаказыПоставщику.Ссылка
	|			ИЗ
	|				тЗаказыПоставщику КАК тЗаказыПоставщику)
	|	И ПриобретениеТоваровУслугТовары.Назначение.Заказ = &Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеТоваровУслуг.Ссылка,
	|	ПриобретениеТоваровУслуг.Контрагент,
	|	ПриобретениеТоваровУслуг.Номер,
	|	ПриобретениеТоваровУслуг.Дата,
	|	ПриобретениеТоваровУслугТовары.Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тОрдер.Заказ КАК Заказ,
	|	тОрдер.Назначение КАК Назначение,
	|	тОрдер.Ссылка КАК Ссылка,
	|	тОрдер.Характеристика КАК Характеристика,
	|	тОрдер.Номенклатура КАК Номенклатура,
	|	тПриход.Ссылка КАК СсылкаПриход,
	|	тПриход.Контрагент КАК Контрагент,
	|	тОрдер.Количество КАК КоличествоОрдер,
	|	СУММА(тПриход.Количество) КАК КоличествоПриход
	|ИЗ
	|	тОрдер КАК тОрдер
	|		ЛЕВОЕ СОЕДИНЕНИЕ тПриход КАК тПриход
	|		ПО тОрдер.Номенклатура = тПриход.Номенклатура
	|			И тОрдер.Характеристика = тПриход.Характеристика
	|ГДЕ
	|	тОрдер.Ссылка.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	тОрдер.Заказ,
	|	тОрдер.Назначение,
	|	тОрдер.Ссылка,
	|	тОрдер.Характеристика,
	|	тОрдер.Номенклатура,
	|	тПриход.Ссылка,
	|	тПриход.Контрагент,
	|	тОрдер.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛОЖЬ КАК ОтработаннаяСтрока,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура КАК Номенклатура,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Количество КАК Количество,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Назначение.Заказ КАК Заказ,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка КАК Ссылка,
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Характеристика КАК Характеристика
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК РасходныйОрдерНаТоварыОтгружаемыеТовары
	|ГДЕ
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Назначение.Заказ В
	|			(ВЫБРАТЬ
	|				тЗаказыПоставщику.ЗаказКлиента
	|			ИЗ
	|				тЗаказыПоставщику КАК тЗаказыПоставщику)
	|	И РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура = &Номенклатура
	|	И РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура";
	
	Возврат Запрос;
	
КонецФункции

Функция ПолучитьЗаказОрдер()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходныйОрдерНаТовары.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку
	|ПОМЕСТИТЬ тЗаданияНаперевозку
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|ГДЕ
	|	РасходныйОрдерНаТовары.Ссылка = &РасходныйОрдер
	|	И РасходныйОрдерНаТовары.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыПоРаспоряжениям.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	ТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
	|	ТоварыПоРаспоряжениям.Количество КАК Количество,
	|	ТоварыПоРаспоряжениям.Распоряжение КАК Заказ,
	|	ТоварыПоРаспоряжениям.Назначение КАК Назначение,
	|	ТоварыПоРаспоряжениям.Ссылка КАК Ссылка,
	|	ТоварыПоРаспоряжениям.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ тОрдер
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК ТоварыПоРаспоряжениям
	|ГДЕ
	|	ТоварыПоРаспоряжениям.Ссылка = &РасходныйОрдер
	|	И ТоварыПоРаспоряжениям.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ТоварыПоРаспоряжениям.Ссылка.Проведен = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыПоРаспоряжениям.Номенклатура.Артикул,
	|	ТоварыПоРаспоряжениям.Номенклатура,
	|	ТоварыПоРаспоряжениям.Количество,
	|	ТоварыПоРаспоряжениям.Распоряжение,
	|	ТоварыПоРаспоряжениям.Назначение,
	|	ТоварыПоРаспоряжениям.Ссылка,
	|	ТоварыПоРаспоряжениям.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Ссылка КАК Ссылка,
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
	|	ЗаказПоставщикуТовары.Количество КАК Количество,
	|	ЗаказПоставщикуТовары.Назначение КАК Назначение,
	|	ЗаказПоставщикуТовары.ЗаказКлиента КАК ЗаказКлиента
	|ПОМЕСТИТЬ тЗаказыПоставщику
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка.Проведен = ИСТИНА
	|	И ЗаказПоставщикуТовары.Назначение В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				тОрдер.Назначение
	|			ИЗ
	|				тОрдер КАК тОрдер)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПоставщикуТовары.Ссылка,
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.Характеристика,
	|	ЗаказПоставщикуТовары.ЗаказКлиента,
	|	ЗаказПоставщикуТовары.Назначение,
	|	ЗаказПоставщикуТовары.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриобретениеТоваровУслуг.Ссылка КАК Ссылка,
	|	ПриобретениеТоваровУслуг.Контрагент КАК Контрагент,
	|	ПриобретениеТоваровУслуг.Номер КАК Номер,
	|	ПриобретениеТоваровУслуг.Дата КАК Дата,
	|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	|	СУММА(ПриобретениеТоваровУслугТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ тПриход
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|		ПО ПриобретениеТоваровУслугТовары.Ссылка = ПриобретениеТоваровУслуг.Ссылка
	|ГДЕ
	|	ПриобретениеТоваровУслуг.Проведен = ИСТИНА
	|	И ПриобретениеТоваровУслуг.ЗаказПоставщику В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				тЗаказыПоставщику.Ссылка
	|			ИЗ
	|				тЗаказыПоставщику КАК тЗаказыПоставщику)
	|	И ПриобретениеТоваровУслугТовары.Назначение.Заказ = &Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеТоваровУслуг.Ссылка,
	|	ПриобретениеТоваровУслуг.Контрагент,
	|	ПриобретениеТоваровУслуг.Номер,
	|	ПриобретениеТоваровУслуг.Дата,
	|	ПриобретениеТоваровУслугТовары.Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тОрдер.Заказ КАК Заказ,
	|	тОрдер.Назначение КАК Назначение,
	|	тОрдер.Ссылка КАК Ссылка,
	|	тОрдер.Характеристика КАК Характеристика,
	|	тОрдер.Номенклатура КАК Номенклатура,
	|	тПриход.Ссылка КАК СсылкаПриход,
	|	тПриход.Контрагент КАК Контрагент,
	|	тОрдер.Количество КАК КоличествоОрдер,
	|	тПриход.Количество КАК КоличествоПриход
	|ИЗ
	|	тОрдер КАК тОрдер
	|		ЛЕВОЕ СОЕДИНЕНИЕ тПриход КАК тПриход
	|		ПО тОрдер.Номенклатура = тПриход.Номенклатура
	|			И тОрдер.Характеристика = тПриход.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ тЗаказыПоставщику КАК тЗаказыПоставщику
	|		ПО тОрдер.Номенклатура = тЗаказыПоставщику.Номенклатура
	|			И тОрдер.Характеристика = тЗаказыПоставщику.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	тОрдер.Заказ,
	|	тОрдер.Назначение,
	|	тОрдер.Ссылка,
	|	тОрдер.Характеристика,
	|	тОрдер.Номенклатура,
	|	тПриход.Ссылка,
	|	тПриход.Контрагент,
	|	тОрдер.Количество,
	|	тПриход.Количество
	|
	|УПОРЯДОЧИТЬ ПО
	|	СсылкаПриход,
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыПоРаспоряжениям.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	ТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
	|	ТоварыПоРаспоряжениям.Количество КАК Количество,
	|	ТоварыПоРаспоряжениям.Распоряжение КАК Заказ,
	|	ТоварыПоРаспоряжениям.Назначение КАК Назначение,
	|	ТоварыПоРаспоряжениям.Ссылка КАК Ссылка,
	|	ЛОЖЬ КАК ОтработаннаяСтрока,
	|	ТоварыПоРаспоряжениям.Характеристика КАК Характеристика
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК ТоварыПоРаспоряжениям
	|ГДЕ
	|//	ТоварыПоРаспоряжениям.Распоряжение В
	|//			(ВЫБРАТЬ
	|//				тЗаказыПоставщику.ЗаказКлиента
	|//			ИЗ
	|//				тЗаказыПоставщику КАК тЗаказыПоставщику)
	|	ТоварыПоРаспоряжениям.Распоряжение = &Заказ
	|	И ТоварыПоРаспоряжениям.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ТоварыПоРаспоряжениям.Ссылка.Проведен = ИСТИНА
	|	И ТоварыПоРаспоряжениям.Номенклатура = &Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура" ;
	
	
	Возврат Запрос;
	
КонецФункции	

Функция ПолучитьЗапросОтбора(Ордер, Номенклатура, Заказ)
	
	Запрос = ПолучитьЗаказОрдер();
	
	Запрос.УстановитьПараметр("РасходныйОрдер"	, Ордер			);
	Запрос.УстановитьПараметр("Номенклатура"	, Номенклатура	);
	Запрос.УстановитьПараметр("Заказ"			, Заказ			);
	
	Результат = Запрос.ВыполнитьПакет();
	
	тПриход = Результат.Получить(4).Выгрузить();
	тРасход = Результат.Получить(5).Выгрузить();				
	
	Если тРасход.Количество() = 0 Тогда
		Запрос = ПолучитьЗаказОрдер2();
		
		Запрос.УстановитьПараметр("РасходныйОрдер"	, Ордер			);
		Запрос.УстановитьПараметр("Номенклатура"	, Номенклатура	);
		Запрос.УстановитьПараметр("Заказ"			, Заказ			);
		
		Результат = Запрос.ВыполнитьПакет();
		
		тПриход = Результат.Получить(4).Выгрузить();
		тРасход = Результат.Получить(5).Выгрузить();
	КонецЕсли;
	
	ОбщееКоличествоПриходу = тПриход.Итог("КоличествоПриход");
	
	тРасход.Сортировать("Ссылка ВОЗР");
	
	тКеш = Новый ТаблицаЗначений;
	тКеш.Колонки.Добавить("СсылкаПриход");
	тКеш.Колонки.Добавить("Номенклатура");
	тКеш.Колонки.Добавить("Характеристика");
	тКеш.Колонки.Добавить("КоличествоПриход");
	тКеш.Колонки.Добавить("тРасход");
	тКеш.Колонки.Добавить("КоличествоПоставщику");
	
	тКеш.Сортировать("тРасход");
	
	Отбор = Новый Структура;
	Для Каждого  СтрокаТаб Из тПриход Цикл
		
		СтрокаКеш = тКеш.Добавить();
		ЗаполнитьЗначенияСвойств( СтрокаКеш, СтрокаТаб );
		
		тКешРасход = Новый ТаблицаЗначений;
		тКешРасход.Колонки.Добавить("Ссылка");
		тКешРасход.Колонки.Добавить("Количество");
		
		СтрокаКеш.тРасход = тКешРасход;
		
		Отбор.Очистить();
		Отбор.Вставить("Номенклатура",СтрокаТаб.Номенклатура);
		Отбор.Вставить("Характеристика",СтрокаТаб.Характеристика);
		Отбор.Вставить("ОтработаннаяСтрока",ЛОЖЬ);
		
		М = тРасход.НайтиСтроки(Отбор);
		Фл = Ложь;
		Если СтрокаКеш.КоличествоПриход = NULL Тогда
			исхсумма = СтрокаТаб.КоличествоОрдер	
		Иначе
			исхсумма = СтрокаКеш.КоличествоПриход;
		КонецЕсли;
		
		Для Каждого Элемент Из М Цикл
			Если (исхсумма - Элемент.Количество >= 0 ) Тогда
				НоваяСтрока = СтрокаКеш.тРасход.Добавить();
				ЗаполнитьЗначенияСвойств( НоваяСтрока, Элемент );
				Фл = Истина;
				исхсумма = исхсумма - Элемент.Количество;
				Элемент.ОтработаннаяСтрока = Истина;
			Иначе
				НоваяСтрока = СтрокаКеш.тРасход.Добавить();
				ЗаполнитьЗначенияСвойств( НоваяСтрока, Элемент );
				НоваяСтрока.Количество = исхсумма;
				Элемент.Количество = Элемент.Количество - исхсумма;
				Прервать;
			КонецЕсли;
			
			Фл = Истина;
		КонецЦикла;
		
		Если ( Фл ) Тогда
			СтрокаКеш.тРасход.Свернуть("Ссылка,Количество");
		КонецЕсли;	
	КонецЦикла;
	
	Возврат тКеш;
	
КонецФункции

Функция ПолучитьДокументСборки(Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаСборку.Ссылка КАК Ссылка,
	|	ЗаказНаСборку.ДокументОснование КАК ДокументОснование,
	|	ЗаказНаСборку.Номенклатура КАК Номенклатура,
	|	ЗаказНаСборку.Организация КАК Организация,
	|	ЗаказНаСборку.Склад КАК Склад,
	|	ЗаказНаСборку.Склад.Представление КАК СкладПредставление
	|ИЗ
	|	Документ.ЗаказНаСборку КАК ЗаказНаСборку
	|ГДЕ
	|	ЗаказНаСборку.ДокументОснование = &ДокументОснование
	|	И ЗаказНаСборку.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДокументОснование", Заказ);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗаказПоРаспоряжению(ЗаказПораспоряжению);
	
	//Стр.Товары.Свернуть("Номенклатура, Количество");
	Для Каждого Строка Из ЗаказПораспоряжению Цикл
		Заказ = Строка.Распоряжение;
		Прервать;
	КонецЦикла;
	
	Возврат Заказ;
	
КонецФункции
//**********************************

Функция РазбитьПоступленияПоОрдерам(ЗаказКлиента, Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриобретениеТоваровУслуг_ТоварыТ.Ссылка КАК ПоступлениеТоваровУслуг,
	|	СУММА(ПриобретениеТоваровУслуг_ТоварыТ.Количество) КАК Количество,
	|	ПриобретениеТоваровУслуг_ТоварыТ.Ссылка.Контрагент КАК Поставщик,
	|	ПриобретениеТоваровУслуг_ТоварыТ.Ссылка.Номер КАК Номер,
	|	ПриобретениеТоваровУслуг_ТоварыТ.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслуг_ТоварыТ
	|ГДЕ
	|	ПриобретениеТоваровУслуг_ТоварыТ.Назначение.Заказ = &ЗаказКлиента
	|	И ПриобретениеТоваровУслуг_ТоварыТ.Номенклатура = &Номенклатура
	|	И ПриобретениеТоваровУслуг_ТоварыТ.Ссылка.Проведен = Истина
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеТоваровУслуг_ТоварыТ.Ссылка,
	|	ПриобретениеТоваровУслуг_ТоварыТ.Ссылка.Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоступлениеТоваровУслуг
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходныйОрдерНаТовары_ОтгружаемыеТоварыТ.Ссылка КАК РасходныйОрдерНаТовары,
	|	РасходныйОрдерНаТовары_ОтгружаемыеТоварыТ.Количество КАК Количество
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК РасходныйОрдерНаТовары_ОтгружаемыеТоварыТ
	|ГДЕ
	|	РасходныйОрдерНаТовары_ОтгружаемыеТоварыТ.Назначение.Заказ = &ЗаказКлиента
	|	И РасходныйОрдерНаТовары_ОтгружаемыеТоварыТ.Номенклатура = &Номенклатура
	|	И РасходныйОрдерНаТовары_ОтгружаемыеТоварыТ.Ссылка.Проведен = Истина
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасходныйОрдерНаТовары
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.Параметры.Вставить("ЗаказКлиента", ЗаказКлиента);
	Запрос.Параметры.Вставить("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Поступило = РезультатЗапроса[0].Выгрузить();
	Расход    = РезультатЗапроса[1].Выгрузить();
	Результат = Расход.СкопироватьКолонки();
	Результат.Колонки.Добавить("Поставщик");
	Результат.Колонки.Добавить("НомерДокумента");
	
	Для каждого СтрРасход Из Расход Цикл
		КоличествоРасход = СтрРасход.Количество;
		Для каждого СтрПоступило Из Поступило Цикл
			Если СтрПоступило.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			Если КоличествоРасход = 0 Тогда
				Прервать;
			КонецЕсли;
			НовСтрока = Результат.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, СтрРасход);
			НовСтрока.Поставщик = Строка(СтрПоступило.Поставщик);
			НовСтрока.НомерДокумента = СтрПоступило.Номер + " " + Формат(СтрПоступило.Дата, "ДФ=dd.MM.yyyy");
			Если СтрПоступило.Количество < КоличествоРасход Тогда
				НовСтрока.Количество = СтрПоступило.Количество;
			Иначе
				НовСтрока.Количество = КоличествоРасход;
			КонецЕсли;
			КоличествоРасход        = КоличествоРасход - НовСтрока.Количество;
			СтрПоступило.Количество = СтрПоступило.Количество - НовСтрока.Количество;
		КонецЦикла;
		Если КоличествоРасход > 0 Тогда
			// что-то не нашли
			НовСтрока = Результат.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, СтрРасход);
			НовСтрока.Количество = КоличествоРасход;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


&ИзменениеИКонтроль("СформироватьЗаданиеНаОтборРазмещениеТовара")
Функция Кт_СформироватьЗаданиеНаОтборРазмещениеТовара(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	Если ТипЗнч(МассивОбъектов) = Тип("Соответствие") Тогда
		СтруктураТипов = МассивОбъектов;
	Иначе
		СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
	КонецЕсли;
	
	Если ПараметрыПечати.Свойство("ТипЗадания") И
		ЗначениеЗаполнено(ПараметрыПечати.ТипЗадания) Тогда
		ТипЗадания = ПараметрыПечати.ТипЗадания;
	Иначе
		ТипЗадания = "ЗаданиеНаРазмещение";
	КонецЕсли;
	
	ПечатьПоДаннымДокумента	= ПараметрыПечати.Свойство("ПечатьПоДаннымДокумента");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_" + ТипЗадания;
	
#Удаление
	ПутьКМакету			= "Обработка.ПечатьЗаданияНаОтборРазмещениеТоваров.ПФ_MXL_ЗаданиеНаОтборРазмещениеТовара";
#КонецУдаления
#Вставка
	ПутьКМакету			= "Обработка.ПечатьЗаданияНаОтборРазмещениеТоваров.ПФ_MXL_ЗаданиеНаОтборРазмещениеТовара_КТ";
#КонецВставки
	КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов();
	ИмяКолонкиКодов = КолонкаКодов.ИмяКолонки;
	ПредставлениеКолонкиКодов = КолонкаКодов.ПредставлениеКолонки;
	
	ВыводитьКоды		= ЗначениеЗаполнено(ИмяКолонкиКодов);
	ВыводитьУпаковки	= ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры")
							И Не (ПараметрыПечати.Свойство("БезДопКолонки"));
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		ПервыйДокумент = Истина;
		
		НазваниеФормы = НазваниеПечатнойФормы(ТипЗадания);
		
		Если ТипЗадания = "ЗаданиеНаДобор" Тогда
			ДанныеПечати = Обработки.ПроверкаКоличестваТоваровВДокументе.ПолучитьДанныеДляПечатнойФормыЗаданиеНаДоборТоваров(
								ПараметрыПечати,
								ПараметрыПечати.Ордер);
		ИначеЕсли ПечатьПоДаннымДокумента Тогда
			МенеджерОбъекта	= ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ);
#Удаление
			ДанныеПечати	= МенеджерОбъекта.ПолучитьДанныеДляПечатнойФормыОтборРазмещениеТоваров(ПараметрыПечати,
																									СтруктураОбъектов.Значение);
#КонецУдаления
#Вставка
			ДанныеПечати	= ПолучитьДанныеДляПечатнойФормыОтборРазмещениеТоваров(ПараметрыПечати, СтруктураОбъектов.Значение);
#КонецВставки
		Иначе
			МенеджерОбъекта			= ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ);
			ПравилаДокумента		= МенеджерОбъекта.ПравилаПечатиЗаданияНаОтборРазмещение();
			ПравилаПечатиЗадания	= ?(ТипЗнч(ПравилаДокумента) <> Тип("Массив"),
										ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПравилаДокумента),
										ПравилаДокумента);
			ДанныеПечати			= ПолучитьДанныеЗаданияНаОтборРазмещениеТоваров(ПравилаПечатиЗадания,
																					СтруктураОбъектов.Ключ,
																					ТипЗадания,
																					СтруктураОбъектов.Значение);
		КонецЕсли;
		
		ДанныеПоОшибкам			= ДанныеПечати.РезультатПоОшибкам;
		ДанныеПоУпаковкам		= ДанныеПечати.РезультатПоУпаковкам;//РезультатЗапроса
		Если ДанныеПечати.Свойство("РезультатПоМаркам") Тогда
			ДанныеПоМаркам		= ДанныеПечати.РезультатПоМаркам; // РезультатЗапроса
			ВыборкаПоМаркам 	= ?(ЗначениеЗаполнено(ДанныеПоМаркам),
									ДанныеПоМаркам.Выбрать(),
									Неопределено);
		Иначе
			ВыборкаПоМаркам 	= Неопределено;
		КонецЕсли;
		ВыборкаПоШапке			= ДанныеПечати.РезультатПоШапке.Выбрать();
		ВыборкаПоРаспоряжениям	= ?(ЗначениеЗаполнено(ДанныеПечати.РезультатПоРаспоряжениям),
									ДанныеПечати.РезультатПоРаспоряжениям.Выбрать(),
									Неопределено);
		ВыборкаПоТабличнойЧасти	= ДанныеПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаПоУпаковкам		= ?(ЗначениеЗаполнено(ДанныеПоУпаковкам),
									ДанныеПоУпаковкам.Выбрать(),
									Неопределено);
		ВыборкаПоСериям			= ?(ЗначениеЗаполнено(ДанныеПечати.РезультатПоСериям),
									ДанныеПечати.РезультатПоСериям.Выбрать(),
									Неопределено);
		
		Если ЗначениеЗаполнено(ДанныеПоОшибкам)
			И Не ДанныеПоОшибкам.Пустой() Тогда
			
			ВыборкаДокументовБезДанных = ДанныеПоОшибкам.Выбрать();
			
			Пока ВыборкаДокументовБезДанных.Следующий() Цикл
				СкладскяОперация = ?(ТипЗадания <> "ЗаданиеНаРазмещение", НСтр("ru = 'отгружаемая'"), НСтр("ru = 'размещаемая'"));
				
				ТекстОшибки = НСтр("ru = 'Невозможно напечатать ""%НазваниеФормы%"" для ""%Документ%"",
				|потому что в документе отсутствует %СкладскяОперация% номенклатура.'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НазваниеФормы%",		НазваниеФормы);
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%",			ВыборкаДокументовБезДанных.Ссылка);
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%СкладскяОперация%",	СкладскяОперация);
				
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			КонецЦикла;
			
		КонецЕсли;
		
		ТекущийДокумент = Неопределено;
		
		Пока ВыборкаПоШапке.Следующий() Цикл
			
			ТекстОшибки = ТекстОшибкиПоДаннымДокумента(ВыборкаПоШапке,
														ВыборкаПоТабличнойЧасти,
														ТекущийДокумент,
														ТипЗадания,
														НазваниеФормы);
			
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				
				Продолжить;
			КонецЕсли;
			
			ИспользуетсяСправочноеХранение	= ВыборкаПоШапке.ИспользуетсяСправочноеХранение;
			ИспользованиеРабочихУчастков	= ВыборкаПоШапке.ИспользованиеРабочихУчастков;
			ВыводитьУчастки					= ИспользованиеРабочихУчастков = Перечисления.ИспользованиеСкладскихРабочихУчастков.Использовать;
			ВыводитьПоУчету					= ?(ТипЗадания = "ЗаданиеНаПересчет", ВыборкаПоШапке.ВыводитьПоУчету, ВыводитьУпаковки);
			ИспользоватьУпаковки			= ВыводитьУпаковки
												Или ВыводитьПоУчету;
			НазванияОбластей                = НазванияОбластей(ИспользуетсяСправочноеХранение, ИспользоватьУпаковки, ВыводитьКоды);
			
			ОтборПоСкладу		= Новый Структура("Склад", ВыборкаПоШапке.Склад);
			ВыборкаПоСкладам	= ВыборкаПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоСкладам.НайтиСледующий(ОтборПоСкладу) Цикл
				
				Макет = УправлениеПечатью.МакетПечатнойФормы(ПутьКМакету);
				
				Если Не ПервыйДокумент Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				
				НомерСтроки			= 1;
				ПервыйДокумент		= Ложь;
				НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
				
				ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
				ОбластьЗаголовок.Параметры.Заполнить(Новый Структура("ТекстЗаголовка", НазваниеФормы));
				ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент,
																				Макет,
																				ОбластьЗаголовок,
																				ВыборкаПоШапке.Ссылка);
																				
				Если Не ВыборкаПоМаркам = Неопределено Тогда
					
					ВыборкаПоМаркам.Сбросить();
					Если ВыборкаПоМаркам.НайтиСледующий(Новый Структура("Ссылка",ВыборкаПоСкладам.Ссылка)) Тогда
						
						ВыводитьМарки = ВыборкаПоМаркам.ЕстьМаркируемаяПродукция;
						ОбластьЗаголовок.Параметры.ПризнакМаркировки = ?(ВыводитьМарки, "[М]", "");
					КонецЕсли;
					
				Иначе
					ВыводитьМарки = Ложь;
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьЗаголовок);
				
				ПараметрыШапки = ПараметрыЗаполненияОбластиШапки(ВыборкаПоШапке);
				
				ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
				ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
				ТабличныйДокумент.Вывести(ОбластьШапка);
				
#Вставка
				ОбластьКонтрагент		= Макет.ПолучитьОбласть("СтрокаКонтрагент");
				Если ТипЗнч(ВыборкаПоШапке.Ссылка.Получатель) = Тип("СправочникСсылка.Склады") Тогда 
					ОбластьКонтрагент.Параметры.Контрагент = ВыборкаПоШапке.Ссылка.Получатель.Наименование;
				Иначе
					ОбластьКонтрагент.Параметры.Контрагент = ВыборкаПоШапке.Ссылка.Получатель.НаименованиеПолное;
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьКонтрагент);
#КонецВставки
				Если ТипЗнч(ВыборкаПоШапке.Ссылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
					
					ПараметрыОснования = ПараметрыЗаполненияОбластиОснования(ВыборкаПоШапке.Ссылка, ВыборкаПоРаспоряжениям);
					
					ОбластьОснование = Макет.ПолучитьОбласть("Основание");
					ОбластьОснование.Параметры.Заполнить(ПараметрыОснования);
					ТабличныйДокумент.Вывести(ОбластьОснование);
					
					Если ВыборкаПоШапке.ОтгрузкаПоЗаданиюНаПеревозку Тогда
						ПараметрыЗаданияНаПеревозку = ПараметрыЗаполненияОбластиЗаданияНаПеревозку(ВыборкаПоШапке);
						
						ОбластьЗаданиеНаПеревозку = Макет.ПолучитьОбласть("ЗаданиеНаПеревозку");
						ОбластьЗаданиеНаПеревозку.Параметры.Заполнить(ПараметрыЗаданияНаПеревозку);
						ТабличныйДокумент.Вывести(ОбластьЗаданиеНаПеревозку);
					КонецЕсли;
					
				КонецЕсли;
#Вставка
				ОбластьЗаявкаНаДоставку	= Макет.ПолучитьОбласть("_ЗаявкаНаДоставку");
				Если ТипЗнч(ВыборкаПоШапке.Ссылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
					Если НЕ ( ВыборкаПоШапке.Ссылка._ЗаявкаНаДоставку.Пустая() ) Тогда 
						ЗаявкаНаДоставку = ВыборкаПоШапке.Ссылка._ЗаявкаНаДоставку;
						Если ( ЗаявкаНаДоставку.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз ) Тогда
							ОбластьЗаявкаНаДоставку.Параметры.ВариантДоставки = "Доставка:";
							ОбластьЗаявкаНаДоставку.Параметры.ТекстДоставки = "Самовывоз";
						Иначе
							ОбластьЗаявкаНаДоставку.Параметры.ВариантДоставки = "Адрес доставки:";
							ОбластьЗаявкаНаДоставку.Параметры.ТекстДоставки = ЗаявкаНаДоставку.АдресДоставки;
						КонецЕсли;
						ТабличныйДокумент.Вывести(ОбластьЗаявкаНаДоставку);
					КонецЕсли; 
				КонецЕсли;
#КонецВставки
				
				Если ТипЗадания = "ЗаданиеНаПересчет" Тогда
					ПараметрыОбластиИсполнитель = Новый Структура("ИсполнительПредставление",
																	ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ВыборкаПоШапке.ИсполнительПредставление,
																											ВыборкаПоШапке.Дата));
					
					ОбластьИсполнитель = Макет.ПолучитьОбласть("Исполнитель");
					ОбластьИсполнитель.Параметры.Заполнить(ПараметрыОбластиИсполнитель);
					ТабличныйДокумент.Вывести(ОбластьИсполнитель);
				КонецЕсли;
				
				ОбластьШапкаТаблицы		= Макет.ПолучитьОбласть(НазванияОбластей.ШапкаТаблицы);
				ОбластьРабочийУчасток	= Макет.ПолучитьОбласть(НазванияОбластей.РабочийУчасток);
				ОбластьСтрокаТаблицы	= Макет.ПолучитьОбласть(НазванияОбластей.СтрокаТаблицы);
				ОбластьПодвалТаблицы	= Макет.ПолучитьОбласть(НазванияОбластей.ПодвалТаблицы);
				
				ПараметрыОбластиШапкиТаблицы = ПараметрыЗаполненияОбластиШапкиТаблицы(ВыводитьКоды,
																						ПредставлениеКолонкиКодов,
																						ИспользоватьУпаковки,
																						Типзадания);
				
				ОбластьШапкаТаблицы.Параметры.Заполнить(ПараметрыОбластиШапкиТаблицы);
				ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
				
				ВыборкаРабочиеУчастки = ВыборкаПоСкладам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
#Вставка
				нТаб = Новый ТаблицаЗначений;
				нТаб.Колонки.Добавить("НомерСтроки"       , Новый ОписаниеТипов("Строка"));
				нТаб.Колонки.Добавить("Артикул"           , Новый ОписаниеТипов("Строка"));
				нТаб.Колонки.Добавить("КоличествоУпаковок", Новый ОписаниеТипов("Число")); 
				
				нТаб.Колонки.Добавить("Поставщик"         , Новый ОписаниеТипов("Строка"));
				нТаб.Колонки.Добавить("НомерДокумента"    , Новый ОписаниеТипов("Строка"));
				
				нТаб.Колонки.Добавить("Товар"             , Новый ОписаниеТипов("Строка"));
				нТаб.Колонки.Добавить("ПризнакМаркировки" , Новый ОписаниеТипов("Строка"));
				
				нТаб.Колонки.Добавить("ПредставлениеЕдиницыИзмеренияУпаковки", Новый ОписаниеТипов("Строка"));
#КонецВставки
				Пока ВыборкаРабочиеУчастки.Следующий() Цикл
					
					Если ВыводитьУчастки
						И ЗначениеЗаполнено(ВыборкаРабочиеУчастки.РабочийУчасток) Тогда
						
						ОбластьРабочийУчасток.Параметры.Заполнить(ВыборкаРабочиеУчастки);
						ТабличныйДокумент.Вывести(ОбластьРабочийУчасток);
						
					КонецЕсли;
					
					ВыборкаПоТовару = ВыборкаРабочиеУчастки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаПоТовару.Следующий() Цикл
						
						ПредставлениеНоменклатуры	= ?(ЗначениеЗаполнено(ВыборкаПоТовару.Номенклатура),
														ВыборкаПоТовару.ПредставлениеНоменклатуры,
														НСтр("ru = '<пустая ячейка>'", ОбщегоНазначения.КодОсновногоЯзыка()));
						ПредставлениеСерии			= ПредставлениеСерии(ВыборкаПоТовару, ВыборкаПоСериям);
						
						ДопПараметрыПредставлениеНоменклатуры = НоменклатураКлиентСервер.ДополнительныеПараметрыПредставлениеНоменклатурыДляПечати();
						ДопПараметрыПредставлениеНоменклатуры.КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
						
						Если ВыводитьМарки И ВыборкаПоТовару.МаркируемаяПродукция Тогда
							ОбластьСтрокаТаблицы.Параметры.ПризнакМаркировки = "[М]";
						Иначе	
							ОбластьСтрокаТаблицы.Параметры.ПризнакМаркировки = "";
						КонецЕсли; 
						
						Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(ПредставлениеНоменклатуры,
																							ВыборкаПоТовару.ПредставлениеХарактеристики,
																							Неопределено,
																							ПредставлениеСерии,
																							ДопПараметрыПредставлениеНоменклатуры);
						
						ПараметрыОбластиСтрокиТЧ = Новый Структура;
						ПараметрыОбластиСтрокиТЧ.Вставить("НомерСтроки",	НомерСтроки);
						ПараметрыОбластиСтрокиТЧ.Вставить("Товар",			Товар);
						
						Если ВыводитьКоды Тогда
							ПараметрыОбластиСтрокиТЧ.Вставить("Артикул", ВыборкаПоТовару[ИмяКолонкиКодов]);
						КонецЕсли;
						
						Если ИспользуетсяСправочноеХранение Тогда
							ДополнительныеЯчейки = ДополнительныеЯчейкиТовара(ВыборкаПоТовару,
																				Не ЗначениеЗаполнено(ВыборкаПоУпаковкам));
							
							ПараметрыОбластиСтрокиТЧ.Вставить("ДополнительныеЯчейки", ДополнительныеЯчейки);
						КонецЕсли;
						
						ПараметрыЗаполненияУпаковок = ПараметрыЗаполненияУпаковок(ВыборкаПоТовару,
																					ВыборкаПоУпаковкам,
																					ИспользоватьУпаковки);
						
						ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаПоТовару);
						ОбластьСтрокаТаблицы.Параметры.Заполнить(ПараметрыОбластиСтрокиТЧ);
						ОбластьСтрокаТаблицы.Параметры.Заполнить(ПараметрыЗаполненияУпаковок);
#Удаление
						ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
#КонецУдаления
						
						НомерСтроки = НомерСтроки + 1;
#Вставка
						//Заказ = ПолучитьЗаказПоРаспоряжению(ВыборкаПоТовару.Ссылка.ТоварыПоРаспоряжениям);
						//Если ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
						//	Заказ = Заказ.Назначение.Заказ;
						//КонецЕсли;
						
						ПараметрыПоставка = Новый Структура("Поставщик, НомерДокумента");
						
						Если ВыборкаПоТовару.Номенклатура.ВидНоменклатуры.Наименование = "Комплекты" Тогда
							// если комплект, то ищем склад и заказ на сборку
							Результат = ПолучитьДокументСборки(ВыборкаПоТовару.НазначениеЗаказ);
							Если Результат.Количество() > 0 Тогда
								Для каждого СтрокаРезультат Из Результат Цикл
									Если ВыборкаПоТовару.Номенклатура = СтрокаРезультат.Номенклатура Тогда
										ПараметрыПоставка.Поставщик = СтрокаРезультат.СкладПредставление;
										ПараметрыПоставка.НомерДокумента = СтрокаРезультат.Ссылка.Номер + " " + Формат(СтрокаРезультат.Ссылка.Дата, "ДФ=dd.MM.yyyy");
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
							НовСтрока = нТаб.Добавить();
							ЗаполнитьЗначенияСвойств(НовСтрока, ОбластьСтрокаТаблицы.Параметры);
							ЗаполнитьЗначенияСвойств(НовСтрока, ПараметрыПоставка);
						Иначе // если не комплект, то ищем поставщика.
							ДанныеПоПоступлениям = РазбитьПоступленияПоОрдерам(ВыборкаПоТовару.НазначениеЗаказ, ВыборкаПоТовару.Номенклатура);
							Отбор = Новый Структура("РасходныйОрдерНаТовары", ВыборкаПоТовару.Ссылка);
							СтрокиОтбор = ДанныеПоПоступлениям.НайтиСтроки(Отбор);
							Если СтрокиОтбор.Количество() = 1 Тогда
								ПараметрыПоставка.Поставщик = СтрокиОтбор[0].Поставщик;
								ПараметрыПоставка.НомерДокумента = СтрокиОтбор[0].НомерДокумента;
								НовСтрока = нТаб.Добавить();
								ЗаполнитьЗначенияСвойств(НовСтрока, ОбластьСтрокаТаблицы.Параметры);
								ЗаполнитьЗначенияСвойств(НовСтрока, ПараметрыПоставка);
							ИначеЕсли СтрокиОтбор.Количество() > 1 Тогда
								Для каждого СтрОтбор Из СтрокиОтбор Цикл
									ПараметрыПоставка.Поставщик = СтрОтбор.Поставщик;
									ПараметрыПоставка.НомерДокумента = СтрОтбор.НомерДокумента;
									
									НовСтрока = нТаб.Добавить();
									ЗаполнитьЗначенияСвойств(НовСтрока, ОбластьСтрокаТаблицы.Параметры);
									ЗаполнитьЗначенияСвойств(НовСтрока, ПараметрыПоставка);
									НовСтрока.КоличествоУпаковок = СтрОтбор.Количество;
								КонецЦикла;
					
								
							КонецЕсли;
						КонецЕсли;
						
#КонецВставки

					КонецЦикла;
				
				КонецЦикла;
#Вставка
				НомерСтроки = 1;
				нТаб.Сортировать("Поставщик, НомерДокумента, Товар");
				Для каждого СтрТаб Из нТаб Цикл
					ОбластьСтрокаТаблицы.Параметры.Заполнить(СтрТаб);
					ОбластьСтрокаТаблицы.Параметры.НомерСтроки = НомерСтроки;
					ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
					НомерСтроки = НомерСтроки + 1;
				КонецЦикла;
#КонецВставки

				ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
#Вставка
				Если ( ТипЗнч( ВыборкаПоШапке.Ссылка ) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") ) Тогда
					Если НЕ ( ПустаяСтрока( ВыборкаПоШапке.Ссылка.Комментарий ) ) Тогда
						ОбластьПодвалКомментарий = Макет.ПолучитьОбласть("ПодвалКомментарий");
						ОбластьПодвалКомментарий.Параметры.Комментарий = ВыборкаПоШапке.Ссылка.Комментарий;
						ТабличныйДокумент.Вывести(ОбластьПодвалКомментарий);
					КонецЕсли;
				КонецЕсли;
#КонецВставки
				
				УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати,
					ВыборкаПоШапке.Ссылка);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Возвращает структуру данных документа, используемую для печати печатной формы Задания на отбор (размещение) товаров.
//
// Процедура из модуля менеджера документа Расходный ордер на товары
//
// Параметры:
//	ПараметрыПечати	- Структура - дополнительные параметры печати.
//	МассивОбъектов	- Массив Из ДокументСсылка - ссылки на объекты которые нужно распечатать.
//	
// Возвращаемое значение:
//	Структура - структура со следующими ключами:
//		*РезультатПоОшибкам			- Неопределено		- ошибки в данных документа, из-за которых невозможно вывести
//															документ на печать.
//		*РезультатПоРаспоряжениям	- РезультатЗапроса	- информация о распоряжениях на отгрузку документа.
//		*РезультатПоШапке			- РезультатЗапроса	- данные шапки документа, используемые для печати Задания
//															на отбор товаров.
//		*РезультатПоТабличнойЧасти	- РезультатЗапроса	- данные товарной части документа, используемые для печати
//															Задания на отбор товаров.
//		*РезультатПоУпаковкам		- Неопределено		- данные об упаковках товаров табличной части документа,
//															используемые для печати Задания на отбор товаров.
//		*РезультатПоСериям			- РезультатЗапроса	- данные о сериях товаров табличной части документа,
//															используемые для печати Задания на отбор товаров.
//		*РезультатПоМаркам			- РезультатЗапроса	- данные о маркированности товаров табличной части документа,
//															используемые для печати Задания на размещение товаров.
//
Функция ПолучитьДанныеДляПечатнойФормыОтборРазмещениеТоваров(ПараметрыПечати, МассивОбъектов) Экспорт
	
	ИспользуетсяМаркируемаяПродукция = РасходныйОрдерНаТоварыЛокализация.ИспользуетсяМаркируемаяПродукция();
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Склад КАК Склад,
	|	ДанныеДокумента.Помещение КАК Помещение,
	|	МИНИМУМ(ТоварыДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТоварыДокумента.Номенклатура КАК Номенклатура,
	|	ТоварыДокумента.Характеристика КАК Характеристика,
	|	ТоварыДокумента.Серия КАК Серия,
	|	ТоварыДокумента.Упаковка КАК Упаковка,
	|	СУММА(ТоварыДокумента.Количество) КАК Количество,
	|	СУММА(ТоварыДокумента.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	&ОпределениеПризнакаМаркируемаяПродукция КАК МаркируемаяПродукция,
	|	ТоварыДокумента.Назначение КАК Назначение
	|ПОМЕСТИТЬ ТоварыЗадания
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК ТоварыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары КАК ДанныеДокумента
	|		ПО ТоварыДокумента.Ссылка = ДанныеДокумента.Ссылка
	|ГДЕ
	|	ТоварыДокумента.Ссылка В(&МассивОбъектов)
	|	И НЕ ТоварыДокумента.ЭтоУпаковочныйЛист
	|	И ТоварыДокумента.Действие <> ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиОрдеровНаОтгрузку.НеОтгружать)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Склад,
	|	ДанныеДокумента.Помещение,
	|	ТоварыДокумента.Номенклатура,
	|	ТоварыДокумента.Характеристика,
	|	ТоварыДокумента.Серия,
	|	ТоварыДокумента.Упаковка,
	|	ТоварыДокумента.Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.Ссылка КАК Ссылка,
	|	ТаблицаТовары.Склад КАК Склад,
	|	ТаблицаТовары.Помещение КАК Помещение,
	|	МИНИМУМ(ТаблицаТовары.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Номенклатура.ВидНоменклатуры.НастройкаИспользованияСерий = &НастройкаИспользованияСерий
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаТовары.Серия
	|	КОНЕЦ КАК Серия,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Номенклатура.ВидНоменклатуры.НастройкаИспользованияСерий = &НастройкаИспользованияСерий
	|				ИЛИ ТаблицаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ТаблицаТовары.Упаковка
	|	КОНЕЦ КАК Упаковка,
	|	СУММА(ТаблицаТовары.Количество) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаТовары.Номенклатура.ВидНоменклатуры.НастройкаИспользованияСерий = &НастройкаИспользованияСерий
	|				ТОГДА ТаблицаТовары.Количество
	|			ИНАЧЕ ТаблицаТовары.КоличествоУпаковок
	|		КОНЕЦ) КАК КоличествоУпаковок,
	|	ТаблицаТовары.МаркируемаяПродукция КАК МаркируемаяПродукция,
	|	ТаблицаТовары.Назначение КАК Назначение
	|ПОМЕСТИТЬ ТаблицаТоваровСуммированная
	|ИЗ
	|	ТоварыЗадания КАК ТаблицаТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.Ссылка,
	|	ТаблицаТовары.Склад,
	|	ТаблицаТовары.Помещение,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Номенклатура.ВидНоменклатуры.НастройкаИспользованияСерий = &НастройкаИспользованияСерий
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаТовары.Серия
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Номенклатура.ВидНоменклатуры.НастройкаИспользованияСерий = &НастройкаИспользованияСерий
	|				ИЛИ ТаблицаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ТаблицаТовары.Упаковка
	|	КОНЕЦ,
	|	ТаблицаТовары.МаркируемаяПродукция,
	|	ТаблицаТовары.Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспоряженияДокумента.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(РаспоряженияДокумента.Распоряжение) КАК ОснованиеПредставление,
	|	РаспоряженияДокумента.Распоряжение.Номер КАК ОснованиеНомер,
	|	РаспоряженияДокумента.Распоряжение.Дата КАК ОснованиеДата,
	|	МИНИМУМ(РаспоряженияДокумента.НомерСтроки) КАК НомерСтроки
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РаспоряженияДокумента
	|ГДЕ
	|	РаспоряженияДокумента.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспоряженияДокумента.Ссылка,
	|	РаспоряженияДокумента.Распоряжение.Номер,
	|	РаспоряженияДокумента.Распоряжение.Дата,
	|	ПРЕДСТАВЛЕНИЕ(РаспоряженияДокумента.Распоряжение)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗадания.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеЗадания.Ссылка) КАК СсылкаПредставление,
	|	ДанныеЗадания.Номер КАК Номер,
	|	ДанныеЗадания.ДатаОтгрузки КАК Дата,
	|	ДанныеЗадания.Склад КАК Склад,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеЗадания.Склад) КАК СкладПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеЗадания.Помещение) КАК ПомещениеПредставление,
	|	ЛОЖЬ КАК ЭтоНакладная,
	|	ВЫБОР
	|		КОГДА ДанныеЗадания.Склад.ИспользоватьСкладскиеПомещения
	|				И ДанныеЗадания.ДатаОтгрузки >= ДанныеЗадания.Склад.ДатаНачалаИспользованияСкладскихПомещений
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеЗадания.Помещение.ИспользоватьАдресноеХранение
	|							И ДанныеЗадания.ДатаОтгрузки >= ДанныеЗадания.Помещение.ДатаНачалаАдресногоХраненияОстатков
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеЗадания.Склад.ИспользоватьАдресноеХранение
	|						И ДанныеЗадания.ДатаОтгрузки >= ДанныеЗадания.Склад.ДатаНачалаАдресногоХраненияОстатков
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|	КОНЕЦ КАК ИспользуетсяАдресноеХранение,
	|	ВЫБОР
	|		КОГДА ДанныеЗадания.Склад.ИспользоватьСкладскиеПомещения
	|				И ДанныеЗадания.ДатаОтгрузки >= ДанныеЗадания.Склад.ДатаНачалаИспользованияСкладскихПомещений
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеЗадания.Помещение.ИспользоватьАдресноеХранениеСправочно
	|							И (НЕ ДанныеЗадания.Помещение.ИспользоватьАдресноеХранение
	|								ИЛИ ДанныеЗадания.ДатаОтгрузки < ДанныеЗадания.Помещение.ДатаНачалаАдресногоХраненияОстатков)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеЗадания.Склад.ИспользоватьАдресноеХранениеСправочно
	|						И (НЕ ДанныеЗадания.Склад.ИспользоватьАдресноеХранение
	|							ИЛИ ДанныеЗадания.ДатаОтгрузки < ДанныеЗадания.Склад.ДатаНачалаАдресногоХраненияОстатков)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|	КОНЕЦ КАК ИспользуетсяСправочноеХранение,
	|	ВЫБОР
	|		КОГДА ДанныеЗадания.Склад.ИспользоватьСкладскиеПомещения
	|				И ДанныеЗадания.ДатаОтгрузки >= ДанныеЗадания.Склад.ДатаНачалаИспользованияСкладскихПомещений
	|			ТОГДА ДанныеЗадания.Помещение.ИспользованиеРабочихУчастков
	|		ИНАЧЕ ДанныеЗадания.Склад.ИспользованиеРабочихУчастков
	|	КОНЕЦ КАК ИспользованиеРабочихУчастков,
	|	ЛОЖЬ КАК ИспользуетсяОрдернаяСхема,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеЗадания.ЗаданиеНаПеревозку.Ссылка) КАК ЗаданиеНаПеревозкуПредставление,
	|	ДанныеЗадания.ЗаданиеНаПеревозку.Номер КАК ЗаданиеНаПеревозкуНомер,
	|	ДанныеЗадания.ЗаданиеНаПеревозку.Дата КАК ЗаданиеНаПеревозкуДата,
	|	ДанныеЗадания.ПорядокДоставки КАК ПорядокДоставки,
	|	ДанныеЗадания.ОтгрузкаПоЗаданиюНаПеревозку КАК ОтгрузкаПоЗаданиюНаПеревозку
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК ДанныеЗадания
	|ГДЕ
	|	ДанныеЗадания.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Склад КАК Склад,
	|	ЕСТЬNULL(ОсновныеЯчейки.Ячейка.РабочийУчасток, &РабочийУчастокПоУмолчанию) КАК РабочийУчасток,
	|	ПРЕДСТАВЛЕНИЕ(ОсновныеЯчейки.Ячейка.РабочийУчасток) КАК ПредставлениеРабочегоУчастка,
	|	ЕСТЬNULL(ОсновныеЯчейки.Ячейка.ПорядокОбхода, 0) КАК ПорядокОбхода,
	|	ЕСТЬNULL(ОсновныеЯчейки.Ячейка, &ЯчейкаПоУмолчанию) КАК ОсновнаяЯчейка,
	|	ЕСТЬNULL(ОсновныеЯчейки.Ячейка.Код, """") КАК ОсновнаяЯчейкаПредставление,
	|	ЕСТЬNULL(ОстальныеЯчейки.Ячейка.ПорядокОбхода, 0) КАК ПорядокОбходаДополнительнаяЯчейка,
	|	ЕСТЬNULL(ОстальныеЯчейки.Ячейка.Код, """") КАК ЯчейкаПредставление,
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Номенклатура.Код КАК Код,
	|	ТаблицаТоваров.Номенклатура.Артикул КАК Артикул,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Номенклатура.НаименованиеПолное КАК ПредставлениеНоменклатуры,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Характеристика.НаименованиеПолное КАК ПредставлениеХарактеристики,
	|	Товары.ВидНоменклатуры.НастройкаИспользованияСерий КАК НастройкаИспользованияСерий,
	|	ТаблицаТоваров.Серия КАК Серия,
	|	ТаблицаТоваров.Серия.Наименование КАК ПредставлениеСерии,
	|	ТаблицаТоваров.Упаковка КАК Упаковка,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаТоваров.Упаковка) КАК ПредставлениеЕдиницыИзмеренияУпаковки,
	|	ПРЕДСТАВЛЕНИЕ(Товары.ЕдиницаИзмерения) КАК ПредставлениеБазовойЕдиницыИзмерения,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	ТаблицаТоваров.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ТаблицаТоваров.МаркируемаяПродукция КАК МаркируемаяПродукция,
	|	ТаблицаТоваров.Назначение КАК Назначение,
	|	ТаблицаТоваров.Назначение.Заказ КАК НазначениеЗаказ
	|ИЗ
	|	ТаблицаТоваровСуммированная КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товары
	|		ПО ТаблицаТоваров.Номенклатура = Товары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК ОсновныеЯчейки
	|		ПО ТаблицаТоваров.Номенклатура = ОсновныеЯчейки.Номенклатура
	|			И (ОсновныеЯчейки.ОсновнаяЯчейка)
	|			И ТаблицаТоваров.Склад = ОсновныеЯчейки.Склад
	|			И (ВЫБОР
	|				КОГДА ТаблицаТоваров.Склад.ИспользоватьСкладскиеПомещения
	|						И ТаблицаТоваров.Ссылка.ДатаОтгрузки >= ТаблицаТоваров.Склад.ДатаНачалаИспользованияСкладскихПомещений
	|					ТОГДА ТаблицаТоваров.Помещение = ОсновныеЯчейки.Помещение
	|				ИНАЧЕ ОсновныеЯчейки.Помещение = ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК ОстальныеЯчейки
	|		ПО ТаблицаТоваров.Номенклатура = ОстальныеЯчейки.Номенклатура
	|			И (НЕ ОстальныеЯчейки.ОсновнаяЯчейка)
	|			И ТаблицаТоваров.Склад = ОстальныеЯчейки.Склад
	|			И (ВЫБОР
	|				КОГДА ТаблицаТоваров.Склад.ИспользоватьСкладскиеПомещения
	|						И ТаблицаТоваров.Ссылка.ДатаОтгрузки >= ТаблицаТоваров.Склад.ДатаНачалаИспользованияСкладскихПомещений
	|					ТОГДА ТаблицаТоваров.Помещение = ОстальныеЯчейки.Помещение
	|				ИНАЧЕ ОстальныеЯчейки.Помещение = ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)
	|			КОНЕЦ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Склад,
	|	РабочийУчасток,
	|	НомерСтроки,
	|	Номенклатура,
	|	Характеристика,
	|	Серия
	|ИТОГИ ПО
	|	Ссылка,
	|	Склад,
	|	РабочийУчасток
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК Ссылка,
	|	ТаблицаТоваров.Склад КАК Склад,
	|	ЕСТЬNULL(ОсновныеЯчейки.Ячейка.РабочийУчасток, &РабочийУчастокПоУмолчанию) КАК РабочийУчасток,
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Серия.Наименование КАК ПредставлениеСерии,
	|	ТаблицаТоваров.МаркируемаяПродукция КАК МаркируемаяПродукция
	|ИЗ
	|	ТоварыЗадания КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК ОсновныеЯчейки
	|		ПО ТаблицаТоваров.Номенклатура = ОсновныеЯчейки.Номенклатура
	|			И (ОсновныеЯчейки.ОсновнаяЯчейка)
	|			И ТаблицаТоваров.Склад = ОсновныеЯчейки.Склад
	|			И (ВЫБОР
	|				КОГДА ТаблицаТоваров.Склад.ИспользоватьСкладскиеПомещения
	|						И ТаблицаТоваров.Ссылка.ДатаОтгрузки >= ТаблицаТоваров.Склад.ДатаНачалаИспользованияСкладскихПомещений
	|					ТОГДА ТаблицаТоваров.Помещение = ОсновныеЯчейки.Помещение
	|				ИНАЧЕ ОсновныеЯчейки.Помещение = ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)
	|			КОНЕЦ)
	|ГДЕ
	|	ТаблицаТоваров.Номенклатура.ВидНоменклатуры.НастройкаИспользованияСерий = &НастройкаИспользованияСерий
	|	И ТаблицаТоваров.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Склад,
	|	РабочийУчасток,
	|	НомерСтроки,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыЗадания.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ТоварыЗадания.МаркируемаяПродукция) КАК ЕстьМаркируемаяПродукция
	|ИЗ
	|	ТоварыЗадания КАК ТоварыЗадания
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыЗадания.Ссылка";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&НастройкаИспользованияСерий",
								"ЗНАЧЕНИЕ(Перечисление.НастройкиИспользованияСерийНоменклатуры.ЭкземплярТовара)");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&РабочийУчастокПоУмолчанию",
								"ЗНАЧЕНИЕ(Справочник.РабочиеУчастки.ПустаяСсылка)");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&ЯчейкаПоУмолчанию",
								"ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)");
	
	Если ИспользуетсяМаркируемаяПродукция Тогда
		ОпределениеМаркируемаяПродукция = РасходныйОрдерНаТоварыЛокализация.ОпределениеПризнакаМаркируемаяПродукцияТекстаЗапроса("ТоварыДокумента.Номенклатура");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОпределениеПризнакаМаркируемаяПродукция", ОпределениеМаркируемаяПродукция);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОпределениеПризнакаМаркируемаяПродукция", "ЛОЖЬ");
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	МаксимальныйИндекс = Результат.ВГраница();
	
	ДанныеЗадания = Новый Структура;
	ДанныеЗадания.Вставить("РезультатПоОшибкам",		Неопределено);
	ДанныеЗадания.Вставить("РезультатПоРаспоряжениям",	Результат[МаксимальныйИндекс - 4]);
	ДанныеЗадания.Вставить("РезультатПоШапке",			Результат[МаксимальныйИндекс - 3]);
	ДанныеЗадания.Вставить("РезультатПоТабличнойЧасти",	Результат[МаксимальныйИндекс - 2]);
	ДанныеЗадания.Вставить("РезультатПоУпаковкам",		Неопределено);
	ДанныеЗадания.Вставить("РезультатПоСериям",			Результат[МаксимальныйИндекс - 1]);
	ДанныеЗадания.Вставить("РезультатПоМаркам",			Результат[МаксимальныйИндекс]);
	
	Возврат ДанныеЗадания;
	
КонецФункции

