#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&ИзменениеИКонтроль("ДобавитьКомандыПечати")
Процедура Кт_ДобавитьКомандыПечати(КомандыПечати)

	// Заказ поставщику
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьЗаказовНаТоварыУслуги";
	КомандаПечати.Идентификатор = "ЗаказПоставщику";
	КомандаПечати.Представление = НСтр("ru = 'Заказ поставщику'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.ДополнительныеПараметры.Вставить("Тип", "ЗаказПоставщику");

#Удаление
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНоменклатуруПартнеров") Тогда
#КонецУдаления
#Вставка
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНоменклатуруПартнеров") И 
		НЕ _РаботаСИнтерфейсомСервер.ПользовательВГруппеДосупа( Пользователи.ТекущийПользователь(), Справочники.ПрофилиГруппДоступа.МенеджерПоЗакупкам ) Тогда
#КонецВставки

		// Заказ поставщику по данным поставщика
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Обработка.ПечатьЗаказовНаТоварыУслуги";
		КомандаПечати.Идентификатор = "ЗаказПоставщику";
		КомандаПечати.Представление = НСтр("ru = 'Заказ поставщику по данным поставщика'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.ДополнительныеПараметры.Вставить("Тип", "ЗаказПоставщикуПоДаннымПоставщика");

	КонецЕсли;

КонецПроцедуры

#КонецЕсли