

&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура Кт_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	НеобходимаИнициализация = Истина;
	
	ПараметрыВыбораСтатейИАналитик = Документы.ЗаказПоставщику.ПараметрыВыбораСтатейИАналитик(ХозяйственнаяОперация);
	ДоходыИРасходыСервер.ОбработкаЗаполнения(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Основание") Тогда
			
			ТипОснования = ТипЗнч(ДанныеЗаполнения.Основание);
			
			Если ТипОснования = Тип("ДокументСсылка.ЗаказКлиента") Тогда
				
				ЗаполнитьДокументНаОснованииЗаказаКлиента(ДанныеЗаполнения);
				
			ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
				
				ЗаполнитьДокументНаОснованииЗаявкиНаВозврат(ДанныеЗаполнения);
				
			ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
				
				ЗаполнитьДокументНаОснованииЗаказаНаПеремещение(ДанныеЗаполнения);
				
			ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
				
				ЗаполнитьДокументНаОснованииЗаказаНаВнутреннееПотребление(ДанныеЗаполнения);

				
			ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
				
				ЗаполнитьДокументНаОснованииЗаказаНаСборку(ДанныеЗаполнения);
				
#Вставка
			ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаявкаНаЗакупку") Тогда
					//++ Сухарев Б.В. 12.10.2018 В зависимости от отбора заполняется или по документу основанию или по отобранным заявкам
					ЗаполнитьДокументНаОснованииЗаявкиНаЗакупку(ДанныеЗаполнения);
					//***********************************************************************
#КонецВставки
			КонецЕсли;
			
		Иначе
			
			ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);
			
		КонецЕсли;
		
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.Партнеры") Тогда
		
		ЗаполнитьДокументНаОснованииПартнера(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.СоглашенияСПоставщиками") Тогда
		
		ЗаполнитьДокументНаОснованииСоглашенияСПоставщиком(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		ЗаполнитьДокументНаОснованииДоговора(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.СделкиСКлиентами") Тогда
		
		ЗаполнитьДокументНаОснованииСделки(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ИзменениеАссортимента") Тогда
		
		ИнициализироватьДокумент(ДанныеЗаполнения);
		НеобходимаИнициализация = Ложь;
		ЗаполнитьДокументНаОснованииИзмененияАссортимента(ДанныеЗаполнения);
		
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияКассыПриФОИспользоватьНесколькоКассЛожь", Ложь);
	ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияСчетаПриФОИспользоватьНесколькоСчетовЛожь", Ложь);
	
	ЗаказПоставщикуЛокализация.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
	
	ЗначениеСклада = Склад;
	ЗаполнениеОбъектовПоСтатистике.ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	// При создании из ОбщаяФома.СозданиеНаОснованииУточнениеЗаказываемогоКоличества может осознанно быть пустым,
	// если в документ переносят данные по нескольким складам. Заполнение по статистике может заполнить это пустое значение,
	// нужно его очистить
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Основание") Тогда
		Склад = ЗначениеСклада;
	КонецЕсли;
	
	ОтветственныеЛицаСервер.УстановитьМенеджера(ЭтотОбъект);
	ЗаполнениеОбъектовПоСтатистике.ЗаполнитьПодчиненныеРеквизитыОбъекта(ЭтотОбъект, "Менеджер",, Истина);
	
	Если НеобходимаИнициализация Тогда
		ИнициализироватьДокумент(ДанныеЗаполнения);
	КонецЕсли;
	
	ВзаиморасчетыСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказКлиента") Или
		ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		
		Если ЗакупкаПодДеятельность <> НалогообложениеНДС Тогда
			
			СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ЭтотОбъект);
			
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(ЭтотОбъект, Истина));
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
			СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
			
			ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Товары, СтруктураДействий, Неопределено);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ТипДанныхЗаполнения = Тип("Структура") Тогда
		СкладГруппа = Справочники.Склады.ЭтоГруппаИСкладыИспользуютсяВТЧДокументовПродажи(Склад);
		СкладыСервер.ЗаполнитьСкладыВТабличнойЧасти(Склад, СкладГруппа, Товары, Ложь, "СписатьНаРасходы");
	КонецЕсли;
	
КонецПроцедуры

&Перед("ОбработкаПроведения")
Процедура Кт_ОбработкаПроведенияПеред(Отказ, РежимПроведения)
	
	//++ Сухарев Б.В. 03.12.2018
	ЗаполнитьОснование();
	//== Сухарев Б.В
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура Кт_ОбработкаПроведенияПосле(Отказ, РежимПроведения)
	
	//++ Сухарев Б.В. 23.11.2018
	_ОбработкаЗакупкиСервер.СформироватьЗаписиРегистра_ЗаказЗакупка(ЭтотОбъект, Новый УникальныйИдентификатор,,, Истина,);
	Если НЕ Отказ И ЕстьЗаявкиНазакупку() Тогда
		_ОбработкаЗакупкиСервер.ОбработкаЗаявкиНазакупкуПриПроведенииЗаказаПоставщику(ЭтотОбъект, Отказ);
	ИначеЕсли НЕ _ДокЗаявкаНаЗакупку = Документы.ЗаявкаНаЗакупку.ПустаяСсылка() Тогда
		ОбработатьЗаявкуНаЗакупкуСервер();
	КонецЕсли; 
	//== Сухарев Б.В
	
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура Кт_ОбработкаУдаленияПроведения(Отказ)
	
	//++ Сухарев Б.В. 23.01.2019
	Если НЕ Отказ И ЕстьЗаявкиНазакупку() Тогда
		ОбработатьЗаявкуНаЗакупкуСервер(Ложь);
		_ОбработкаЗакупкиСервер.СформироватьЗаписиРегистра_ЗаказЗакупка(ЭтотОбъект, Новый УникальныйИдентификатор, Истина);
		_ОбработкаЗакупкиСервер.ОбработкаЗаявкиНазакупкуПриПроведенииЗаказаПоставщику(ЭтотОбъект, Отказ, Истина);
	КонецЕсли; 
	//== Сухарев Б.В
	
КонецПроцедуры

//++ Сухарев Б.В. 03.12.2018
&НаСервере
Функция ЕстьЗаявкиНазакупку()
	
	ЕстьЗаявка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	ЗаказПоставщикуТовары.Ссылка КАК Ссылка,
					|	ЗаказПоставщикуТовары.ЗаказКлиента КАК ЗаказКлиента,
					|	ЗаказПоставщикуТовары._ЗаявкаНаЗакупку КАК _ЗаявкаНаЗакупку
					|ИЗ
					|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
					|ГДЕ
					|	НЕ ЗаказПоставщикуТовары._ЗаявкаНаЗакупку = &_ЗаявкаНаЗакупку
					|	И ЗаказПоставщикуТовары.Ссылка = &Ссылка";	
					
	Запрос.УстановитьПараметр("_ЗаявкаНаЗакупку", Документы.ЗаявкаНаЗакупку.ПустаяСсылка());
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		 ЕстьЗаявка = Истина;
		 Прервать;
	КонецЦикла;
	
	Возврат ЕстьЗаявка;
	
КонецФункции // ЕстьЗаявкиНазакупку()

&НаСервере
Процедура ЗаполнитьОснование()
	
	Если НЕ ЭтотОбъект.ДокументОснование = Документы.ЗаказКлиента.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
	
	ДокОснование = Документы.ЗаказКлиента.ПустаяСсылка();
	КозЗаказов    = 0;
	
	Для Каждого ТекСтрока Из ЭтотОбъект.Товары Цикл
		Если ( НЕ ДокОснование = ТекСтрока.ЗаказКлиента ) И ( НЕ ТекСтрока.ЗаказКлиента = Документы.ЗаказКлиента.ПустаяСсылка() ) Тогда
			ДокОснование = ТекСтрока.ЗаказКлиента;
			КозЗаказов = КозЗаказов + 1;
		КонецЕсли;
	КонецЦикла;		// ТекСтрока Из ЭтотОбъект.Товары
	
	Если КозЗаказов = 1 Тогда
		 ЭтотОбъект.ДокументОснование = ДокОснование;
	 КонецЕсли;
	 
КонецПроцедуры // ЗаполнитьОснование()

&НаСервере
Функция ПолучитьЗаявкиНаЗакупку() Экспорт
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ЗаказПоставщику._ДокЗаявкаНаЗакупку, ЗНАЧЕНИЕ(Документ.ЗаявкаНаЗакупку.ПустаяСсылка)) КАК ЗаявкаНаЗакупку
	               |ПОМЕСТИТЬ ВТ_Заявки
	               |ИЗ
	               |	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	               |ГДЕ
	               |	ЗаказПоставщику.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ЗаказПоставщикуТовары._ЗаявкаНаЗакупку, ЗНАЧЕНИЕ(Документ.ЗаявкаНаЗакупку.ПустаяСсылка))
	               |ИЗ
	               |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	               |ГДЕ
	               |	ЗаказПоставщикуТовары.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_Заявки.ЗаявкаНаЗакупку КАК ЗаявкаНаЗакупку,
				   |    ЛОЖЬ КАК БитаяСсылка
	               |ИЗ
	               |	ВТ_Заявки КАК ВТ_Заявки
	               |ГДЕ
	               |	ВТ_Заявки.ЗаявкаНаЗакупку <> ЗНАЧЕНИЕ(Документ.ЗаявкаНаЗакупку.ПустаяСсылка)";
	
	//Запрос.УстановитьПараметр("_ЗаявкаНаЗакупку", Документы.ЗаявкаНаЗакупку.ПустаяСсылка());
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Т = Запрос.Выполнить().Выгрузить();
	ЕстьБитые = Ложь;
	Для Каждого СтрокаТаб Из Т Цикл
		ЭтоБитая = Ложь;
		Попытка
			//***************************************************************
			//ИЗМЕНЕНО Стефутин В.П. 02.07.2023
			//Номер = СтрокаТаб.ЗаявкаНаЗакупку.Номер;
			//***************************************************************
		Исключение
			ЭтоБитая = Истина;
			ЕстьБитые = Истина;
		КонецПопытки;
		
		Если НЕ ЭтоБитая Тогда
			Результат.Добавить(СтрокаТаб.ЗаявкаНаЗакупку);
		КонецЕсли;	
		
	КонецЦикла;	
	
	Если ( ЕстьБитые ) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внимание!! Документ имеет ссылки на удаленные заявки на закупку");
	КонецЕсли;	
	
	Возврат Результат;
		
КонецФункции // ПолучитьЗаявкиНаЗакупку()

&Перед("ЗаполнитьДокументПоОтбору")
Процедура Расш1_ЗаполнитьДокументПоОтбору(Знач ДанныеЗаполнения)
	
	//++ Сухарев Б.В. 19.10.2018
	Если ДанныеЗаполнения.Свойство("ДокументОснование") И ДанныеЗаполнения.Свойство("РабочийСтолЗакупок") Тогда
		ЗаполнитьДокументНаОснованииЗаявокНаЗакупку(ДанныеЗаполнения);
		Возврат;
	КонецЕсли;
	//-- Сухарев Б.В
	
КонецПроцедуры
 
//== Сухарев Б.В

//++ Сухарев Б.В. 12.10.2018 Заполнение шапки на основании заявки на закупку
Процедура ЗаполнитьШапкуДокументаПоЗаявкеНаЗакупку(Знач ЗаявкаНаЗакупку, ПоДокументуОснование = Истина)
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ЗаявкаНаЗакупку.Ссылка                 КАК Ссылка,
	|	ЗаявкаНаЗакупку.Статус                 КАК СтатусДокумента,
	|	ЗаявкаНаЗакупку.Приоритет              КАК Приоритет,
	|	ЗаявкаНаЗакупку.Проведен               КАК Проведен,
	|	ЗаявкаНаЗакупку.Организация            КАК Организация,
	|	ЗаявкаНаЗакупку.Сделка                 КАК Сделка,
	|	ЗаявкаНаЗакупку.Склад                  КАК СкладДокумента,
	|	ЗаявкаНаЗакупку.Склад.ЭтоГруппа        КАК ЭтоГруппа,
	|	ЗаявкаНаЗакупку.ДокументОснование      КАК ДокументОснование,
	|	ЗаявкаНаЗакупку.НалогообложениеНДС     КАК НалогообложениеНДС,
	|	ЗаявкаНаЗакупку.ЗакупкаПодДеятельность КАК ЗакупкаПодДеятельность,
	|	ЗаявкаНаЗакупку.Подразделение          КАК Подразделение,
	|	ЗаявкаНаЗакупку.ХозяйственнаяОперация  КАК ХозяйственнаяОперация
	|ИЗ
	|	Документ.ЗаявкаНаЗакупку КАК ЗаявкаНаЗакупку
	|ГДЕ
	|	ЗаявкаНаЗакупку.Ссылка = &ЗаявкаНаЗакупку
	|");
	Запрос.УстановитьПараметр("ЗаявкаНаЗакупку", ЗаявкаНаЗакупку);
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	МассивДопустимыхСтатусов = Новый Массив;
	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Согласован);
	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Подтвержден);
//	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Закрыт);
	
	Если ПоДокументуОснование Тогда
		
		ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(
			  ЗаявкаНаЗакупку
			, Реквизиты.СтатусДокумента
			, НЕ Реквизиты.Проведен
			, (МассивДопустимыхСтатусов.Найти(ЗаявкаНаЗакупку.Статус) = Неопределено)
			
			, МассивДопустимыхСтатусов);
			
		ДокументОснование   = Реквизиты.ДокументОснование;
		
	КонецЕсли;		// ПоДокументуОснование 		
	
	Организация             = Реквизиты.Организация;
	Сделка                  = Реквизиты.Сделка;
	Приоритет               = Реквизиты.Приоритет;
	НалогообложениеНДС      = Реквизиты.НалогообложениеНДС;
	ЗакупкаПодДеятельность  = Реквизиты.ЗакупкаПодДеятельность;
	Склад                   = Реквизиты.СкладДокумента;
	Подразделение           = Реквизиты.Подразделение;
	ХозяйственнаяОперация   = Реквизиты.ХозяйственнаяОперация;
	Дата					= ТекущаяДата();
	
КонецПроцедуры	// ЗаполнитьШапкуДокументаНаОснованииЗаявкиНаЗакупку(Знач ЗаявкаНаЗакупку)()

//++ Сухарев Б.В. 14.10.2018 Заполнение ТЧ Товары на основании заявки на закупку
Процедура ЗаполнитьТЧТоварыПоЗаявкеНаЗакупку(Знач ЗаявкаНаЗакупку)
	
	ЗапросЗаказыВНазначениях = Новый Запрос("ВЫБРАТЬ
	                                        |	ЗаявкаНаЗакупкуТовары.Назначение КАК Назначение,
	                                        |	ВЫРАЗИТЬ(ВЫБОР
	                                        |			КОГДА ЗаявкаНаЗакупкуТовары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	                                        |				ТОГДА ЗаявкаНаЗакупкуТовары.Ссылка.ДокументОснование
	                                        |			КОГДА НЕ ЗаявкаНаЗакупкуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	                                        |				ТОГДА ЗаявкаНаЗакупкуТовары.Ссылка.ДокументОснование
	                                        |			ИНАЧЕ ЗаявкаНаЗакупкуТовары.Назначение.Заказ
	                                        |		КОНЕЦ КАК Документ.ЗаказКлиента) КАК ЗаказКлиента
	                                        |ИЗ
	                                        |	Документ.ЗаявкаНаЗакупку.Товары КАК ЗаявкаНаЗакупкуТовары
	                                        |ГДЕ
	                                        |	ЗаявкаНаЗакупкуТовары.Ссылка = &ЗаявкаНаЗакупку
	                                        |
	                                        |СГРУППИРОВАТЬ ПО
	                                        |	ЗаявкаНаЗакупкуТовары.Назначение,
	                                        |	ВЫРАЗИТЬ(ВЫБОР
	                                        |			КОГДА ЗаявкаНаЗакупкуТовары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	                                        |				ТОГДА ЗаявкаНаЗакупкуТовары.Ссылка.ДокументОснование
	                                        |			КОГДА НЕ ЗаявкаНаЗакупкуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	                                        |				ТОГДА ЗаявкаНаЗакупкуТовары.Ссылка.ДокументОснование
	                                        |			ИНАЧЕ ЗаявкаНаЗакупкуТовары.Назначение.Заказ
	                                        |		КОНЕЦ КАК Документ.ЗаказКлиента)");
	ЗапросЗаказыВНазначениях.УстановитьПараметр("ЗаявкаНаЗакупку", ЗаявкаНаЗакупку);
	
	ТаблицаСЗаказами = ЗапросЗаказыВНазначениях.Выполнить().Выгрузить();
	
	// Таблица товаров в заявке на закупку
	ТаблицаТоваровПоЗаявке = ЗаявкаНаЗакупку.Товары.Выгрузить();
	ТаблицаТовары          = ТаблицаТоваровПоЗаявке.СкопироватьКолонки();
	ТаблицаТовары.Колонки.Добавить("ЗаказКлиента");
	ТаблицаТовары.Колонки.Добавить("_ЗаявкаНаЗакупку");
	
	Для Каждого СтрокаДанных Из ТаблицаСЗаказами Цикл
		
		// Остатки товаров по заказу
		ПараметрыТаблицыТовары  = Новый Структура("ПолучатьТовары, ПолучатьУслуги, ПолучатьРаботы, Отбор", Истина, Истина, Истина, Неопределено);
		ТаблицаТоваровПоЗаказуКлиента = ОбеспечениеСервер.ТаблицаОстатковКЗаказу(СтрокаДанных.ЗаказКлиента, ПараметрыТаблицыТовары);
		Для Каждого СтрокаТоваровПоЗаявке Из ТаблицаТоваровПоЗаявке.НайтиСтроки(Новый Структура("Назначение", СтрокаДанных.Назначение)) Цикл
			
			ОтборПоТаблице = Новый Структура("Номенклатура, Характеристика");
			ЗаполнитьЗначенияСвойств(ОтборПоТаблице, СтрокаТоваровПоЗаявке);
			
			СтрокиТоваровПоЗаказуКлиента = ТаблицаТоваровПоЗаказуКлиента.НайтиСтроки(ОтборПоТаблице);
			Если СтрокиТоваровПоЗаказуКлиента.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДанныхПоОстатку	= СтрокиТоваровПоЗаказуКлиента[0];
			КоличествоКЗаказу		= Мин(СтрокаТоваровПоЗаявке.Количество, СтрокаДанныхПоОстатку.Количество);
			Если КоличествоКЗаказу	= 0 Тогда // Если ноль, заказывать не нужно
				Продолжить;
			КонецЕсли;
			
			СтрокаТаблицыТоваров	= ТаблицаТовары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыТоваров, СтрокаТоваровПоЗаявке);
			
			СтрокаТаблицыТоваров.ЗаказКлиента	   = СтрокаДанных.ЗаказКлиента;
			
			// Нужно пересчитать суммы, затем перепишем количество
			КоэффициентПересчета 				   = Окр(КоличествоКЗаказу/СтрокаТоваровПоЗаявке.Количество, 5);
			СтрокаТаблицыТоваров.Сумма             = Окр(СтрокаТоваровПоЗаявке.Сумма * КоэффициентПересчета, 2);
			СтрокаТаблицыТоваров.СуммаРучнойСкидки = Окр(СтрокаТоваровПоЗаявке.СуммаРучнойСкидки * КоэффициентПересчета, 2);
			СтрокаТаблицыТоваров.СуммаНДС          = Окр(СтрокаТоваровПоЗаявке.СуммаНДС * КоэффициентПересчета, 2);
			СтрокаТаблицыТоваров.СуммаСНДС         = Окр(СтрокаТоваровПоЗаявке.СуммаСНДС * КоэффициентПересчета, 2);
			
			СтрокаТаблицыТоваров.Количество        = КоличествоКЗаказу; // меньшее из планового, либо остаток по заказу, либо желаемое из заявки
			
		КонецЦикла;
		
	КонецЦикла;
	
	//Заполнение табличной части.
	Если ТаблицаТовары.Количество() > 0 Тогда
		Для Каждого ТекСтрока Из ТаблицаТовары Цикл
			ТекСтрока.КодСтроки     = ТекСтрока.НомерСтроки;
			ТекСтрока._ЗаявкаНаЗакупку = ЗаявкаНаЗакупку;
		КонецЦикла;		// ТекСтрока Из ТаблицаТовары
		Товары.Загрузить(ТаблицаТовары);
	КонецЕсли;
	
КонецПроцедуры	// ЗаполнитьТЧТоварыПоЗаявкеНаЗакупку()

//++ Сухарев Б.В. 19.10.2018 Заполнение ТЧ Товары на основании СпмскаНоменклатуры
Процедура ЗаполнитьТЧТоварыПоСпискуНоменклатуры(Знач ДанныеЗаполнения)
	
	ТаблицаТовары = Товары.Выгрузить();	
	
	СписокНоменклатуры = ДанныеЗаполнения.СписокНоменклатуры;
	Для Каждого ТекСтрока Из СписокНоменклатуры Цикл
		НоваяСтрокаТоваров						= ТаблицаТовары.Добавить();
		НоваяСтрокаТоваров.Номенклатура			= ТекСтрока.Номенклатура;
		НоваяСтрокаТоваров.КоличествоУпаковок	= ТекСтрока.Количество;
		НоваяСтрокаТоваров.Упаковка				= ТекСтрока.Упаковка;
		НоваяСтрокаТоваров.Количество			= ТекСтрока.Количество;
		НоваяСтрокаТоваров.Назначение			= ТекСтрока.Назначение;
		НоваяСтрокаТоваров.Склад				= ТекСтрока.Заявка.Склад;
		НоваяСтрокаТоваров.ЗаказКлиента			= ТекСтрока.Заявка.ДокументОснование;
		НоваяСтрокаТоваров._ЗаявкаНаЗакупку		= ТекСтрока.Заявка;
		НоваяСтрокаТоваров.СтавкаНДС			= ТекСтрока.Номенклатура.СтавкаНДС;
		НоваяСтрокаТоваров._УИДЗакупка			= ТекСтрока._УИДЗакупка;
		Если ТекСтрока.Свойство("Характеристика") Тогда
			НоваяСтрокаТоваров.Характеристика		= ТекСтрока.Характеристика;
		КонецЕсли;
		
	КонецЦикла;		// ТекСтрока 
	
	//Заполнение табличной части.
	Если ТаблицаТовары.Количество() > 0 Тогда
		Товары.Загрузить(ТаблицаТовары);
	КонецЕсли;
КонецПроцедуры	// ЗаполнитьТЧТоварыПоСпискуНоменклатуры()
 

Процедура ЗаполнитьДокументНаОснованииЗаявкиНаЗакупку(Знач ЗаявкаНаЗакупку)
	
	//++ Сухарев Б.В. 23.01.2019
	_ДокЗаявкаНаЗакупку		= ЗаявкаНаЗакупку;
	//== Сухарев Б.В
	
	//Заполнение шапки
	ЗаполнитьШапкуДокументаПоЗаявкеНаЗакупку(ЗаявкаНаЗакупку);
	
	//Заполнение ТЧ Товары
	ЗаполнитьТЧТоварыПоЗаявкеНаЗакупку(ЗаявкаНаЗакупку);
	
	
КонецПроцедуры

//++ Сухарев Б.В. 12.10.2018 заполнение на основании заявок на закупку
Процедура ЗаполнитьДокументНаОснованииЗаявокНаЗакупку(Знач ДанныеЗаполнения)
	
	Если ( НЕ ДанныеЗаполнения.Свойство("СписокНоменклатуры") ) ИЛИ ( ДанныеЗаполнения.СписокНоменклатуры.Количество() = 0 ) Тогда
		Возврат;
	КонецЕсли;
	
	СписокНоменклатуры = ДанныеЗаполнения.СписокНоменклатуры;
	ЗаявкаНаЗакупку    = ДанныеЗаполнения.СписокНоменклатуры[0].Заявка;
	ЭтотОбъект._ЗаявкаНаЗакупку = Истина;
	
	//Заполнение шапки
	ЗаполнитьШапкуДокументаПоЗаявкеНаЗакупку( ЗаявкаНаЗакупку, Ложь);
	
	//Заполнение ТЧ Товары
	ЗаполнитьТЧТоварыПоСпискуНоменклатуры(ДанныеЗаполнения);
	//ЗаполнитьТЧТоварыПоЗаявкеНаЗакупку(ЗаявкаНаЗакупку);
	
КонецПроцедуры	// ЗаполнитьДокументНаОснованииЗаявокНаЗакупку(ДанныеЗаполнения)()
//-- Сухарев Б.В

//++ Сухарев Б.В. 23.01.2019 

&НаСервере
Процедура ОбработатьЗаявкуНаЗакупкуСервер(Отметка = Истина)
	
	СписокЗаявокНаЗакупку = ПолучитьЗаявкиНаЗакупку();
	Для Каждого ТекЗаявка Из СписокЗаявокНаЗакупку Цикл
		ОбработатьТоварыЗакуки(ТекЗаявка, Отметка);
	КонецЦикла;		// ТекЗаявка Из Список 
	
	Если НЕ _ДокЗаявкаНаЗакупку = Документы.ЗаявкаНаЗакупку.ПустаяСсылка() Тогда
		ОбработатьТоварыЗакуки(_ДокЗаявкаНаЗакупку, Отметка);
	КонецЕсли;	
	
КонецПроцедуры	// ОбработатьЗаявкуНаЗакупкуСервер()

&НаСервере
Процедура ОбработатьТоварыЗакуки(ДокЗаявкаНаЗакупку, Отметка)
	ЗаявкаОбъект = ДокЗаявкаНаЗакупку.ПолучитьОбъект();
	Для Каждого ТекСтрока Из ЗаявкаОбъект.Товары Цикл
		Если НЕ Отметка Тогда
			Если ТекСтрока.ЗаказПоставщику = Ссылка Тогда
				ТекСтрока.ЗаказПоставщику = Документы.ЗаказПоставщику.ПустаяСсылка();
			ТекСтрока.Заказано = Отметка;
			КонецЕсли;
		Иначе
			ТекСтрока.Заказано = Отметка;
		КонецЕсли; 	
	КонецЦикла;		// ТекСтрока Из ДокЗаявка.Товары 
	_ДоработкиСлужебный.ЗаписатьДокументКлиента(ЗаявкаОбъект);
КонецПроцедуры	// ОбработатьТоварыЗакпки()

&После("ЗаполнитьДокументНаОснованииЗаказаКлиента")
Процедура КТ_ЗаполнитьДокументНаОснованииЗаказаКлиента(Знач ДанныеЗаполнения)
	
	ЗаказКлиента = ДанныеЗаполнения.Основание;
	//КАВ начало
	Для Каждого Стр Из Товары Цикл
		Стр.ЗаказКлиента = ЗаказКлиента;
	КонецЦикла;
	//КАВ конец
	
КонецПроцедуры

//== Сухарев Б.В
