
//++ Сухарев Б.В. 

#Область ОбработкаДокументаДоставки

&НаСервере
// Устанавливает страницу доставки в зависимости от способа доставки.
//
// Параметры:
//	ЭлементыФормы - ВсеЭлементыФормы - элементы формы, в которой устанавливается страница доставки;
//	СпособДоставки - ПеречислениеСсылка.СпособыДоставки - способ доставки, в зависимости от которого 
//		выбирается страница доставки;
//
Процедура УстановитьСтраницуДоставки(ЭлементыФормы, Объект ) Экспорт
	
	Если Объект.ДокументОснование = Документы.ЗаказКлиента.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
	
	ВеземДокументы											  = Объект.ВеземДокументы;
	СпособДоставки                                            = Объект.СпособДоставки;
	Если СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ДоКлиента") ИЛИ СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ПоручениеЭкспедиторуСоСклада") Тогда
		ЭлементыФормы.ПодГруппаДоставки.Видимость             = Истина;
	ИначеЕсли СпособДоставки                                  = ПредопределенноеЗначение("Перечисление.СпособыДоставки.Самовывоз") Тогда
		ЭлементыФормы.ПодГруппаДоставки.Видимость             = Ложь;
	КонецЕсли;
	
	Если Объект.ОсобыеУсловияПеревозки Тогда
		ЭлементыФормы.ОсобыеУсловияПеревозкиОписание.Доступность = Истина;
	Иначе
		ЭлементыФормы.ОсобыеУсловияПеревозкиОписание.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры	//УстановитьСтраницуДоставки()

&НаСервере
Процедура ЗаполнитьПодчиненныеСвойстваПартнера(Объект) Экспорт
	Если  ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Объект.Менеджер			= Объект.Контрагент.Партнер.ОсновнойМенеджер;
		Объект.Подразделение	= Объект.Контрагент.Партнер.ОсновнойМенеджер.Подразделение;
		
		ТипыКИ = Новый Массив;
		ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
		
		ИсточникиКИ = Новый Массив;
		ИсточникиКИ.Добавить();
	КонецЕсли; 
	
КонецПроцедуры	//ЗаполнитьПодчиненныеСвойстваКонтрагента(Элементы, Объект)()

&НаСервере
// Очищает списки выбора адресов доставки и реквизиты доставки.
//
// Параметры:
//	ЭлементыФормы - ВсеЭлементыФормы - элементы формы, в которых очищаются списки выбора адресов доставки;
//	ДокОбъект - ДокументОбъект - объект, в котором очищаются реквизиты доставки.
//
Процедура ЗаявкаОчиститьРеквизитыДоставки(Элементы, Объект) Экспорт
	Если Элементы.Найти("АдресДоставки") <> Неопределено Тогда
		Элементы.АдресДоставки.СписокВыбора.Очистить();
	КонецЕсли;
	Если Элементы.Найти("ДополнительнаяИнформация") <> Неопределено Тогда
		Объект.ДополнительнаяИнформацияПоДоставке = "";
	КонецЕсли;
	УстановитьСтраницуДоставки(Элементы, Объект);
	
КонецПроцедуры	//ЗаявкаОчиститьРеквизитыДоставки()

&НаСервере
Процедура _ПриУстановкеНовогоНомераЗаявкиНаДоставку(Источник, СтандартнаяОбработка, Префикс) Экспорт
	// Определим алгоритм формирования номера, согласно типу объекта
	Если ТипЗнч(Источник) = Тип("ДокументОбъект._ЗаявкаНаДоставку") Тогда
		ПрисвоитьНовыйНомерОбъектуЗаявкаНаДоставку(Источник, СтандартнаяОбработка, Префикс);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПрисвоитьНовыйНомерОбъектуЗаявкаНаДоставку(Источник, СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	ДатаИсточника = Источник.Дата;
	ДатаИсточника = ?(ЗначениеЗаполнено(ДатаИсточника), ДатаИсточника, ТекущаяДата());
	
	// Префикс документов "Заказ клиента"
	ПрефиксОрганизации = "00";
	Если ЗначениеЗаполнено(Источник.Организация) Тогда
		ПрефиксОрганизации = Источник.Организация.Префикс;
		ПрефиксНовый = ПрефиксОрганизации + Формат(ДатаИсточника, "ДФ=ddMMyy");
	Иначе
		ПрефиксНовый = ПрефиксОрганизации + Формат(ДатаИсточника, "ДФ=ddMMyy");
	КонецЕсли;
	
	НомерИсточника = Источник.Номер;
	
	Если НЕ ЗначениеЗаполнено(НомерИсточника) Тогда
		
		НомерДокументаПоТаблице = ПолучитьНомерДокументаПоТаблице(Новый Структура("ИмяТаблицы, ДатаПолученияДанных, Префикс", "_ЗаявкаНаДоставку", ДатаИсточника, ПрефиксНовый));
		
		Если НомерДокументаПоТаблице = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Источник.Номер = НомерДокументаПоТаблице;
		
	Иначе
		
		НомерИсточника   = Формат(0, "ЧЦ=" + СтрДлина(Префикс) +"""; ЧВН=; ЧГ=0") + Прав(НомерИсточника, СтрДлина(НомерИсточника) - СтрДлина(Префикс)); // Нули вместо префикса
		НовыйНомерСтрока = ПрефиксНовый + Прав(НомерИсточника, СтрДлина(НомерИсточника) - СтрДлина(ПрефиксНовый)); // с лева подставляем свой префикс
		
		Источник.Номер = НовыйНомерСтрока;
		
	КонецЕсли;
КонецПроцедуры	//ПрисвоитьНовыйНомерОбъектуЗаявкаНаДоставку()

&НаСервере
Функция ПолучитьНомерДокументаПоТаблице(ПараметрыЗапроса)
	Если НЕ ТипЗнч(ПараметрыЗапроса) = Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяТаблицы = Неопределено;
	ПараметрыЗапроса.Свойство("ИмяТаблицы", ИмяТаблицы);
	
	Если ИмяТаблицы = Неопределено ИЛИ СокрЛП(ИмяТаблицы) = "" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументОбъектМетаданных = Метаданные.Документы.Найти(СокрЛП(ИмяТаблицы));
	Если ДокументОбъектМетаданных = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДлинаНомера = ДокументОбъектМетаданных.ДлинаНомера;
	
	ДатаПолученияДанных = Неопределено;
	ПараметрыЗапроса.Свойство("ДатаПолученияДанных", ДатаПолученияДанных);
	Если НЕ ТипЗнч(ДатаПолученияДанных) = Тип("Дата") Тогда
		ДатаПолученияДанных = ТекущаяДата();
	КонецЕсли;
	
	Префикс = "00-";
	ПараметрыЗапроса.Свойство("Префикс", Префикс);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
					|	ТаблицаДокументов.Номер
					|ИЗ
					|	Документ."+ ИмяТаблицы + " КАК ТаблицаДокументов
					|ГДЕ
					|	ТаблицаДокументов.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаПолученияДанных, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаПолученияДанных, ДЕНЬ)
					|	И ТаблицаДокументов.Номер ПОДОБНО """ + Префикс + "%""
					|УПОРЯДОЧИТЬ ПО
					|	ТаблицаДокументов.Номер УБЫВ
					|";
	
	Запрос.УстановитьПараметр("ДатаПолученияДанных", ?(НЕ ЗначениеЗаполнено(ДатаПолученияДанных), ТекущаяДата(), ДатаПолученияДанных));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		СтрокаНулей = "";
		Для Итератор = 1 По ДлинаНомера Цикл
			СтрокаНулей = СтрокаНулей + "0";
		КонецЦикла;
		
		ПоследнийНомерПоТаблице = СтрокаНулей;
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ПоследнийНомерПоТаблице = Выборка.Номер;
		
	КонецЕсли;
	
	ДлинаПолученногоНомера = СтрДлина(ПоследнийНомерПоТаблице);
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(ДлинаПолученногоНомера, 0));
	
	СтрокаЧислоВНомере = "";
	Для Итератор = 0 По ДлинаПолученногоНомера - 1 Цикл
		
		СимволВНомере = Сред(ПоследнийНомерПоТаблице, ДлинаПолученногоНомера - Итератор, 1);
		СтрокаЧислоВНомере = ?(Найти("0123456789", СимволВНомере) = 0, "0", СимволВНомере) + СтрокаЧислоВНомере;
		
	КонецЦикла;
	
	ЧислоВНомере = ОписаниеТиповЧисло.ПривестиЗначение(СтрокаЧислоВНомере);
	Если НЕ ТипЗнч(ЧислоВНомере) = Тип("Число") Тогда
		ЧислоВНомере = 0;
	КонецЕсли;
	
	НовыйНомерСтрока = Формат(ЧислоВНомере + 1, "ЧЦ=" + ДлинаПолученногоНомера +"""; ЧВН=; ЧГ=0");
	
	НовыйНомерСтрока = Префикс + Прав(НовыйНомерСтрока, ДлинаПолученногоНомера - СтрДлина(Префикс));
	
	Возврат НовыйНомерСтрока;
КонецФункции	//ПолучитьНомерДокументаПоТаблице(ПараметрыЗапроса)

&НаСервере
Процедура ПроверитьВозможностьВводаЗаявкиНаДоставку(ЗаказКлиента) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	_ЗаявкаНаДоставку.Ссылка,
					|	_ЗаявкаНаДоставку.Номер,
					|	_ЗаявкаНаДоставку.Дата,
					|	_ЗаявкаНаДоставку.ДокументОснование,
					|	_ЗаявкаНаДоставку.Заказы.(
					|		Ссылка,
					|		ЗаказКлиента
					|	)
					|ИЗ
					|	Документ._ЗаявкаНаДоставку КАК _ЗаявкаНаДоставку
					|ГДЕ
					|	_ЗаявкаНаДоставку.ДокументОснование = &ЗаказКлиента
					|	И _ЗаявкаНаДоставку.Заказы.ЗаказКлиента = &ЗаказКлиента";
	
	
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	Результат = Запрос.Выполнить().Выгрузить();
	Если НЕ Результат.Количество() = 0 Тогда
		
		ТекстОшибки = НСтр("ru='По документу %Документ% - создана Заявка на отгрузку.'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ЗаказКлиента);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
КонецПроцедуры	//ПроверитьВозможностьВводаЗаявкиНаДоставку()

&НаСервере
Функция ОтборЗаказов(Объект, КлючУникальности)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	_ЗаявкаНаДоставкуЗаказы.НомерСтроки КАК НомерПП,
					|	_ЗаявкаНаДоставкуЗаказы.ЗаказКлиента КАК ЗаказКлиента,
					|	_ЗаявкаНаДоставку.Ссылка КАК ЗаявкаНаДоставку,
					|	&КлючУникальности КАК GUID
					|ИЗ
					|	Документ._ЗаявкаНаДоставку.Заказы КАК _ЗаявкаНаДоставкуЗаказы
					|		ЛЕВОЕ СОЕДИНЕНИЕ Документ._ЗаявкаНаДоставку КАК _ЗаявкаНаДоставку
					|		ПО _ЗаявкаНаДоставкуЗаказы.Ссылка = _ЗаявкаНаДоставку.Ссылка
					|ГДЕ
					|	_ЗаявкаНаДоставку.Ссылка = &Ссылка
					|
					|СГРУППИРОВАТЬ ПО
					|	_ЗаявкаНаДоставкуЗаказы.НомерСтроки,
					|	_ЗаявкаНаДоставкуЗаказы.ЗаказКлиента,
					|	_ЗаявкаНаДоставку.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("КлючУникальности", КлючУникальности);
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции // ОтборЗаказов()

&НаСервере
Функция ПолучитьТоваыЗаявкиНаОтгрузку(Объект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	_ЗаявкаНаДоставкуТовары.Ссылка,
	               |	_ЗаявкаНаДоставкуТовары.НомерСтроки,
	               |	_ЗаявкаНаДоставкуТовары.Номенклатура,
	               |	_ЗаявкаНаДоставкуТовары.Характеристика,
	               |	_ЗаявкаНаДоставкуТовары.Серия,
	               |	_ЗаявкаНаДоставкуТовары.ВариантОбеспечения,
	               |	_ЗаявкаНаДоставкуТовары.Количество,
	               |	_ЗаявкаНаДоставкуТовары.КоличествоУпаковок,
	               |	_ЗаявкаНаДоставкуТовары._УИДОтгрузка
	               |ИЗ
	               |	Документ._ЗаявкаНаДоставку.Товары КАК _ЗаявкаНаДоставкуТовары
	               |ГДЕ
	               |	_ЗаявкаНаДоставкуТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	Возврат Результат;
	
КонецФункции	//получитьТоваыЗаявкиНаОтгрузку()

&НаСервере
Процедура СформироватьЗаписиРегистра_ЗаказЗаявка(Объект, КлючУникальности , Удаление = Ложь, Выбран = Ложь, Обработан = Ложь )Экспорт
	
	Если НЕ Выбран Тогда
		НачатьТранзакцию();
		Если НЕ Удаление Тогда
			Результат							= ОтборЗаказов(Объект, КлючУникальности);
			Выборка								= Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				МенеджерЗаписи					= РегистрыСведений._ЗаказЗаявка.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
				МенеджерЗаписи.Обработан		= Обработан;
				МенеджерЗаписи.Записать(Истина);
			КонецЦикла;
		Иначе			//Удаление
			МенеджерЗаписи						= РегистрыСведений._ЗаказЗаявка.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ЗаявкаНаДоставку		= Объект.Ссылка;
			МенеджерЗаписи.GUID					= КлючУникальности;
			Для Каждого ТекЗаказ Из Объект.Заказы Цикл
				МенеджерЗаписи.ЗаказКлиента			= ТекЗаказ.ЗаказКлиента;
				МенеджерЗаписи.Прочитать();
				Если МенеджерЗаписи.Выбран() Тогда
					МенеджерЗаписи.Удалить();
				КонецЕсли; 
			КонецЦикла;		// ТекЗаказ Из Объект.Заказы
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.Удалить();
			КонецЕсли; 
		КонецЕсли;		//Не Удаление
		ЗафиксироватьТранзакцию();
	Иначе			//Выбран
		НачатьТранзакцию();
		МенеджерЗаписи							= РегистрыСведений._ЗаказЗаявка.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.GUID						= КлючУникальности;
		МенеджерЗаписи.ЗаявкаНаДоставку			= Объект.Ссылка;
		Для Каждого ТекЗаказ Из Объект.Заказы Цикл
			МенеджерЗаписи.ЗаказКлиента			= ТекЗаказ.ЗаказКлиента;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.Обработан		= Обработан;
				МенеджерЗаписи.Записать(Истина);
			Иначе
				МенеджерЗаписи					= РегистрыСведений._ЗаказЗаявка.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.GUID				= КлючУникальности;
				МенеджерЗаписи.ЗаявкаНаДоставку = Объект.Ссылка;
				МенеджерЗаписи.ЗаказКлиента		= ТекЗаказ.ЗаказКлиента;
				МенеджерЗаписи.Обработан		= Обработан;
				МенеджерЗаписи.Записать(Истина);
			КонецЕсли; 
		КонецЦикла;		// ТекЗаказ Из Объект.Заказы
		ЗафиксироватьТранзакцию();
	КонецЕсли;		// НЕ Выбран 		 
	
КонецПроцедуры	//СформироватьЗаписиРегистровЗаданий(Объект)

&НаСервере
Функция ОтборЗаказовРегистр(Объект, КлючУникальности)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	_ЗаказЗаявка.ЗаказКлиента,
					|	_ЗаказЗаявка.ЗаявкаНаДоставку,
					|	_ЗаказЗаявка.GUID,
					|	_ЗаказЗаявка.Обработан
					|ИЗ
					|	РегистрСведений._ЗаказЗаявка КАК _ЗаказЗаявка
					|ГДЕ
					|	_ЗаказЗаявка.ЗаявкаНаДоставку = &ЗаявкаНаДоставку
					|	И _ЗаказЗаявка.GUID = &КлючУникальности";
	
	Запрос.УстановитьПараметр("ЗаявкаНаДоставку", Объект.Ссылка);
	Запрос.УстановитьПараметр("КлючУникальности", КлючУникальности);
	Результат = Запрос.Выполнить();
	Возврат Результат;
	
КонецФункции // ОтборЗаказовРегистр()

&НаСервере
Функция ОбработатьДоставкуТовары(Объект, ОбъектЗаказ)
	
	ДатаОтгрузкиЗаявки	= Объект.ЖелаемаяДатаОтгрузки;
	ТоварыЗаявки		= Объект.Товары;
	ТоварыЗаказа		= ОбъектЗаказ.Товары;
	КолСтрокЗаявки		= Объект.Товары.Количество();
	НеОтгружатьЧастями	= Ложь;
	
	Для Каждого СтрокаДоставки Из ТоварыЗаявки Цикл
		СтруктураДляПоиска	= Новый Структура("Номенклатура, Характеристика, ВариантОбеспечения", СтрокаДоставки.Номенклатура, СтрокаДоставки.Характеристика, Перечисления.ВариантыОбеспечения.Отгрузить);
		СтрокиЗаказа		= ТоварыЗаказа.НайтиСтроки(СтруктураДляПоиска);         
		Если НЕ СтрокиЗаказа.Количество() = 0 Тогда
			Для Каждого СтрокаЗаказа Из СтрокиЗаказа Цикл
				СтрокаЗаказа.ДатаОтгрузки = ДатаОтгрузкиЗаявки;
			КонецЦикла;		// СтрокаЗаказа Из СтрокиЗаказа
			КолСтрокЗаявки	= КолСтрокЗаявки - 1;	
		КонецЕсли; 
	КонецЦикла;		// СтрокаДоставки Из ТоварыЗаявки      
	
	Если КолСтрокЗаявки <= 0 Тогда
		НеОтгружатьЧастями = Истина;
	КонецЕсли;
	
	Возврат НеОтгружатьЧастями;
	
КонецФункции // ОбработатьДоставкуТовары(Объект, ОбъектЗаказ)


&НаСервере
Процедура ЗаписатьДоставкуЗаказаКлиента(Объект, ОбъектЗаказ)
	
	//Если ( Объект.СпособДоставки = ОбъектЗаказ.СпособДоставки ) Тогда
	//	Возврат;
	//КонецЕсли;
	//
	Если Объект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда                                   
		ОбъектЗаказ.СпособДоставки						= Объект.СпособДоставки;
		ОбъектЗаказ.ЗонаДоставки						= Справочники.ЗоныДоставки.ПустаяСсылка();
		ОбъектЗаказ.ДатаОтгрузки						= Дата(1, 1, 1, 0, 0, 0);
		ОбъектЗаказ.ВремяДоставкиС						= Дата(1, 1, 1, 0, 0, 0);
		ОбъектЗаказ.ВремяДоставкиПо						= Дата(1, 1, 1, 0, 0, 0);
		//ОбъектЗаказ.ЖелаемаяДатаОтгрузки				= Объект.ЖелаемаяДатаОтгрузки;
		ОбъектЗаказ.АдресДоставки						= "";
		ОбъектЗаказ.ДополнительнаяИнформацияПоДоставке	= "";
		ОбъектЗаказ.ОсобыеУсловияПеревозки				= Ложь;
		ОбъектЗаказ.ОсобыеУсловияПеревозкиОписание		= "";
	Иначе 
		//РИВ
		Если ТипЗнч(ОбъектЗаказ) = Тип("ДокументОбъект.ЗаказКлиента") Тогда 
			ОбъектЗаказ.СпособДоставки						= Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки;  
		КонецЕсли; 
		//РИВ
		//ОбъектЗаказ.ЗонаДоставки						= Объект.ЗонаДоставки;
		//ОбъектЗаказ.АдресДоставки						= Объект.АдресДоставки;
		//ОбъектЗаказ.ВремяДоставкиС						= Объект.ВремяДоставкиС;
		//ОбъектЗаказ.ВремяДоставкиПо						= Объект.ВремяДоставкиПо;
		//ОбъектЗаказ.ЖелаемаяДатаОтгрузки				= Объект.ЖелаемаяДатаОтгрузки;
		//ОбъектЗаказ.НеОтгружатьЧастями					= ОбработатьДоставкуТовары(Объект, ОбъектЗаказ);
		//ОбъектЗаказ.ДатаОтгрузки						= Объект.ЖелаемаяДатаОтгрузки;
		//ОбъектЗаказ.ДополнительнаяИнформацияПоДоставке	= Объект.ДополнительнаяИнформацияПоДоставке;
		//Если Объект.ОсобыеУсловияПеревозки Тогда
		//	ОбъектЗаказ.ОсобыеУсловияПеревозки			= Объект.ОсобыеУсловияПеревозки;
		//	ОбъектЗаказ.ОсобыеУсловияПеревозкиОписание	= Объект.ОсобыеУсловияПеревозкиОписание;
		//КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	//ЗаписатьДостакуЗаказаКлоиента(Объект, ОбъектЗаказ)

#КонецОбласти


#Область ОбработкаЗаказаКлиентаИзДокументаЗаявкаНаДоставку
 
&НаСервере
Процедура ОбработкаЗаказов(Объект, КлючУникальности, Удаление = Ложь) Экспорт
	
	Если Объект.ВеземДокументы Тогда
		Возврат;
	КонецЕсли;
	
	ТоварыНаОтгрузку = ПолучитьТоваыЗаявкиНаОтгрузку(Объект).Выгрузить();
	Заказы = ОтборЗаказовРегистр(Объект, КлючУникальности).Выгрузить();
	Для Каждого ТекЗаказ Из Заказы Цикл
		
		ОбъектЗаказ = ТекЗаказ.ЗаказКлиента.ПолучитьОбъект();
		
		Если ( ОбъектЗаказ.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт ) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ Удаление  Тогда	
			Если ( ТекЗаказ.Обработан ) Тогда
				Продолжить;
			КонецЕсли;
		Иначе
			Если НЕ ( ТекЗаказ.Обработан ) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого ТекСтрока Из ТоварыНаОтгрузку Цикл
			
			УИДОтгрузка	        	   = ТекСтрока._УИДОтгрузка;
			Если НЕ Удаление Тогда
				Если НЕ ЗначениеЗаполнено(ТекСтрока._УИДОтгрузка) Тогда 
					Если ТипЗнч(ТекЗаказ.ЗаказКлиента) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
						СтруктураДляПоиска = Новый Структура("Номенклатура, Характеристика, _Отгрузка", ТекСтрока.Номенклатура, ТекСтрока.Характеристика, Ложь );
					Иначе
						СтруктураДляПоиска = Новый Структура("Номенклатура, Характеристика, Серия, ВариантОбеспечения, _Отгрузка", ТекСтрока.Номенклатура, ТекСтрока.Характеристика, ТекСтрока.Серия, Перечисления.ВариантыОбеспечения.КОбеспечению, Ложь );
					КонецЕсли;
				Иначе
					СтруктураДляПоиска = Новый Структура("_УИДОтгрузка, _Отгрузка", ТекСтрока._УИДОтгрузка, Ложь);
				КонецЕсли;
			Иначе
				Если НЕ ЗначениеЗаполнено(ТекСтрока._УИДОтгрузка) Тогда  
					Если ТипЗнч(ТекЗаказ.ЗаказКлиента) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
						СтруктураДляПоиска = Новый Структура("Номенклатура, Характеристика, _Отгрузка", ТекСтрока.Номенклатура, ТекСтрока.Характеристика, Истина );
					Иначе
						СтруктураДляПоиска = Новый Структура("Номенклатура, Характеристика, Серия, ВариантОбеспечения, _Отгрузка", ТекСтрока.Номенклатура, ТекСтрока.Характеристика, ТекСтрока.Серия, Перечисления.ВариантыОбеспечения.Отгрузить, Истина );
					КонецЕсли;
				Иначе
					СтруктураДляПоиска = Новый Структура("_УИДОтгрузка, _Отгрузка", ТекСтрока._УИДОтгрузка, Истина);
				КонецЕсли;
			КонецЕсли;
			КолНаОтгрузку			   = ТекСтрока.КоличествоУпаковок;	
			
			Если КолНаОтгрузку = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ТоварыЗаказа			   = ОбъектЗаказ.Товары;
			СтрНоменклатуры			   = ТоварыЗаказа.НайтиСтроки(СтруктураДляПоиска);
			
			Если ТипЗнч(ТекЗаказ.ЗаказКлиента) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				
				Для Каждого Строка Из СтрНоменклатуры Цикл
				
					Если НЕ Удаление  Тогда	
						Если ( Строка.НомерСтроки = ТекСтрока.НомерСтроки) Тогда//И ( (Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить) ИЛИ (Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно) ) Тогда
							
							КолНаОтгрузку = КолНаОтгрузку - ТекСтрока.КоличествоУпаковок;
							
						КонецЕсли;
						
						Если КолНаОтгрузку = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						//Если ( Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению ) ИЛИ ( Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Обособленно ) Тогда
							
							Если Строка.КоличествоУпаковок <= КолНаОтгрузку Тогда
								//Если Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению Тогда
								//	Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно;
								//ИначеЕсли ( Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Обособленно ) Тогда
								//	Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно;
								//КонецЕсли;
								//Строка.ДатаОтгрузки = Объект.ЖелаемаяДатаОтгрузки;
								КолНаОтгрузку = КолНаОтгрузку - Строка.КоличествоУпаковок;
								Если КолНаОтгрузку < 0 Тогда
									КолНаОтгрузку = 0;
								КонецЕсли;
							Иначе			// Строка.Количество > ТекСтрока.Количество
								ПараметрыОбработки = _ДоработкиСлужебный.ПараметрыРазбиенияСтроки();
								РазбитьСтрокуТЧ(ТоварыЗаказа, Строка, КолНаОтгрузку, ПараметрыОбработки, Объект.ЖелаемаяДатаОтгрузки);
								КолНаОтгрузку = 0;
							КонецЕсли;		// Строка.Количество > ТекСтрока.Количество 
							
							ОбработанЗаказ = Истина;
							ТоварыЗаказа[Строка.НомерСтроки-1]._Отгрузка = Истина;
							
						//КонецЕсли;		// (Строка.ВариантОбеспечения) 		
					Иначе		//НЕ Удаление
						//Если ( Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить ) Тогда
						//	Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Обособленно;
						//ИначеЕсли( Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно ) Тогда
						//	Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Обособленно;
						//КонецЕсли;		// ( трока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить; ) 		 
						ОбработанЗаказ = Ложь;
						Строка._Отгрузка = Ложь;
					КонецЕсли;		// НЕ Удаление 		 
				КонецЦикла;		//Строка  
				
			Иначе 
				Для Каждого Строка Из СтрНоменклатуры Цикл
					Если НЕ Удаление  Тогда
						Если (Строка.НомерСтроки = ТекСтрока.НомерСтроки) 
							И (Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить) Тогда
							КолНаОтгрузку = КолНаОтгрузку - ТекСтрока.КоличествоУпаковок;
							
						КонецЕсли;
						
						Если КолНаОтгрузку = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						Если Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению Тогда
							Если Строка.КоличествоУпаковок <= КолНаОтгрузку Тогда
								Если Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению Тогда
									Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
									Строка.Обособленно = Истина;
								КонецЕсли;
								Строка.ДатаОтгрузки = Объект.ЖелаемаяДатаОтгрузки;
								КолНаОтгрузку = КолНаОтгрузку - Строка.КоличествоУпаковок;
								Если КолНаОтгрузку < 0 Тогда
									КолНаОтгрузку = 0;
								КонецЕсли;
							Иначе			// Строка.Количество > ТекСтрока.Количество
								ПараметрыОбработки = _ДоработкиСлужебный.ПараметрыРазбиенияСтроки();
								РазбитьСтрокуТЧ(ТоварыЗаказа, Строка, КолНаОтгрузку, ПараметрыОбработки, Объект.ЖелаемаяДатаОтгрузки);
								//+10.04.2025
								Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
								Строка.Обособленно = Истина;
								Строка.ДатаОтгрузки = Объект.ЖелаемаяДатаОтгрузки;
								//-10.04.2025
								КолНаОтгрузку = 0;
							КонецЕсли;		// Строка.Количество > ТекСтрока.Количество
							ОбработанЗаказ = Истина;
							ТоварыЗаказа[Строка.НомерСтроки-1]._Отгрузка = Истина;
						КонецЕсли;		// (Строка.ВариантОбеспечения) 		
					Иначе		//НЕ Удаление
						Если Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
							Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
							Строка.Обособленно = Истина;
						КонецЕсли;		// ( трока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить; ) 		 
						ОбработанЗаказ = Ложь;
						Строка._Отгрузка = Ложь;
					КонецЕсли;		// НЕ Удаление
				КонецЦикла;		//Строка  
			КонецЕсли;
			ТекСтрока.КоличествоУпаковок = КолНаОтгрузку;
			ТекСтрока.Количество		 = КолНаОтгрузку;
		КонецЦикла;		// ТекСтрока
		
		Если ( НЕ Удаление ) И ( ОбработанЗаказ = НЕОПРЕДЕЛЕНО ) Тогда
			ОбработанЗаказ = Истина;
		КонецЕсли;
		//		Если НЕ Удаление Тогда
		СформироватьЗаписиРегистра_ЗаказЗаявка(Объект, КлючУникальности, Удаление, Истина, ОбработанЗаказ);
		//		КонецЕсли; 
		
		ЗаписатьДоставкуЗаказаКлиента(Объект, ОбъектЗаказ); 
		
		Если НЕ ТипЗнч(ТекЗаказ.ЗаказКлиента) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
			СтруктураДействий = Новый Структура;
			_ДоработкиСлужебный.ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ОбъектЗаказ);
			Для Каждого ТекСтрока Из  ОбъектЗаказ.Товары Цикл
				_ДоработкиСлужебный.ПересчитатьСуммуВСтрокеТЧ(ТекСтрока,	СтруктураДействий);
				_ДоработкиСлужебный.ПересчитатьСуммуНДСВСтрокеТЧ(ТекСтрока,	СтруктураДействий);
				_ДоработкиСлужебный.ПересчитатьСуммуСНДСВСтрокеТЧ(ТекСтрока,СтруктураДействий);
			КонецЦикла;		// ТекСтрока Из  ОбъектЗаказ.Товары  
		КонецЕсли;
		
		_ДоработкиСлужебный.ЗаписатьДокументКлиента(ОбъектЗаказ, Истина);
		
	КонецЦикла;		// ТекЗаказ		
	
КонецПроцедуры	//ОбработкаЗаказов()

&НаСервере
Процедура РазбитьСтрокуТЧ(ТЧ, ТекущаяСтрока, КолНаОтгрузку, ПараметрыОбработки, ДатаОтгрузки)
	
	//++ 20.03.2025
	ТЗ = ТЧ.ВыгрузитьКолонки();
	Есть_УИДОтгрузка = (ТЗ.Колонки.Найти("_УИДОтгрузка") <> Неопределено);
	//--
	
	ИндексТекущейСтроки 	 = ТЧ.Индекс(ТекущаяСтрока);
	НоваяСтрока 			 = ТЧ.Добавить();
	//	НоваяСтрока 			 = ТЧ.Вставить(ИндексТекущейСтроки + 1);
	Остаток					 = ТекущаяСтрока[ПараметрыОбработки.ИмяПоляКоличество] - КолНаОтгрузку;
	//++ 20.03.2025
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	//--
	
	ТекущаяСтрока[ПараметрыОбработки.ИмяПоляКоличество]		= КолНаОтгрузку;
	НоваяСтрока[ПараметрыОбработки.ИмяПоляКоличество]		= Остаток;
	//++ 20.03.2025
	Если Есть_УИДОтгрузка Тогда
		НоваяСтрока._УИДОтгрузка								= Новый УникальныйИдентификатор();
	КонецЕсли;
	//--
	Если ТекущаяСтрока.Упаковка.Числитель = 0 Тогда
		Числитель = 1;
	Иначе
		Числитель = ТекущаяСтрока.Упаковка.Числитель;
	КонецЕсли;
	
	НоваяСтрока[ПараметрыОбработки.ИмяКоличествоУпаковок]	= Остаток / Числитель;
	ТекущаяСтрока[ПараметрыОбработки.ИмяКоличествоУпаковок]	= КолНаОтгрузку / Числитель;
	//ТекущаяСтрока.ВариантОбеспечения						= Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно;
	//ТекущаяСтрока.ДатаОтгрузки								= ДатаОтгрузки;
	
КонецПроцедуры	// РазбитьСтрокуТЧ()

&НаСервере
Процедура ОбновитьСпособДоставкиЗаказаКлинта(Ордер, Удаление = Ложь) Экспорт
	
	Если НЕ ТипЗнч(Ордер) = Тип("ДокументОбъект.РасходныйОрдерНаТовары") Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьСпособДоставки = Ложь;
	Если ( Ордер.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке ) ИЛИ
		 ( Ордер.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен  ) ИЛИ
		 ( Ордер.Статус = Перечисления.СтатусыРасходныхОрдеров.Проверен  ) Тогда
		ИзменитьСпособДоставки = Истина;
	КонецЕсли;		// Ордер.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен
	
	Если ИзменитьСпособДоставки Тогда
		СписокЗаказовКлиентов = Новый ТаблицаЗначений;
		СписокЗаказовКлиентов.Колонки.Добавить("Заказ"); 
		СписокЗаказовКлиентов.Колонки.Добавить("ИмяЗаказ"); 
		
		
		Для Каждого ТекСтрока Из Ордер.ОтгружаемыеТовары Цикл
			Если ( ТипЗнч(ТекСтрока.Назначение.Заказ) = Тип("ДокументСсылка.ЗаказКлиента") ) Тогда
				Если ( ТекСтрока.Назначение.Заказ._ТипДоставки <> Ордер._СпособДоставки ) Тогда
					ЗаказОбъект    = ТекСтрока.Назначение.Заказ.ПолучитьОбъект();
					НайденныйЗаказ = СписокЗаказовКлиентов.Найти(СокрЛП(Строка(ЗаказОбъект)), "ИмяЗаказ");
					Если НайденныйЗаказ = Неопределено Тогда
						НоваяСтрока          = СписокЗаказовКлиентов.Добавить();
						НоваяСтрока.Заказ    = ЗаказОбъект;
						НоваяСтрока.ИмяЗаказ = СокрЛП(Строка(ЗаказОбъект));
					КонецЕсли;		// ЭлементСписка = Неопределено 		
				КонецЕсли;		// ( ТекСтрока.Назначение.Заказ._СпособДоставки <> Ордер._СпособДоставки ) 		
			КонецЕсли;		// ТипЗнч(ТекСтрока.Назначение.Заказ) = Тип("ДокументСсылка.ЗаказКлиента")  		
		КонецЦикла;		// ТекСтрока
		
		Для Каждого ТекЗаказ Из СписокЗаказовКлиентов Цикл
			Если НЕ Удаление Тогда
				ТекЗаказ.Заказ._ТипДоставки = Ордер._СпособДоставки;
			Иначе			// НЕ Удаление
				ТекЗаказ.Заказ._ТипДоставки = Справочники.ТипыТранспортныхСредств.ПустаяСсылка();
			КонецЕсли;		// НЕ Удаление
			_ДоработкиСлужебный.ЗаписатьДокументКлиента(ТекЗаказ.Заказ);
		КонецЦикла;		// ТекЗаказ
		
	КонецЕсли;		//ИзменитьСпособДоставки
	
КонецПроцедуры	// ОбновитьСпособДоставкиЗаказаКлинта()

#КонецОбласти


#Область ЗаполнениеРеализацииИзСтолаОтгрузки

&НаСервере
// Определяет реквизиты счета-фактуры на основании выбранных документов-оснований
//
// Возвращаемое значение:
//	Структура - реквизиты счета-фактуры.
//
Функция ПолучитьПараметрыСчетаФактурыПоОснованиям(НоваяСФ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Структура("Организация, Контрагент, КППКонтрагента, Валюта, СчетФактураОснование, РеквизитыОснований,
		|Ответственный, Подразделение, ИдентификаторГосКонтракта");
	Результат.Вставить("Корректировочный", Ложь);
	Результат.Вставить("Исправление", Ложь);
	
	РеквизитыОснований = Новый ТаблицаЗначений;
	Колонки = РеквизитыОснований.Колонки;
	Колонки.Добавить("ДокументОснование");
	Колонки.Добавить("ИсходныйДокумент");
	Колонки.Добавить("НомерИсходногоДокумента",            ОбщегоНазначения.ОписаниеТипаСтрока(12));
	Колонки.Добавить("ДатаИсходногоДокумента",             ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	Колонки.Добавить("НомерИсправленияИсходногоДокумента", ОбщегоНазначения.ОписаниеТипаСтрока(3));
	Колонки.Добавить("ДатаИсправленияИсходногоДокумента",  ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	
	Результат.РеквизитыОснований = РеквизитыОснований;
	
	МассивДокументов = НоваяСФ.ДокументыОснования.ВыгрузитьКолонку("ДокументОснование");
	
	ТипыОснований = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивДокументов);
	
	Запрос = Новый Запрос;
	ТекстЗапросаОснований = "";
	ТекстЗапросаИсходныхДанных = "";
	
	Для Каждого ТипОснования Из ТипыОснований Цикл
		
		ОбъектыТипа         = ТипОснования.Значение;
		МетаданныеДокумента = ОбъектыТипа[0].Метаданные();
		ИмяОбъекта          = МетаданныеДокумента.Имя;
		
		Запрос.Параметры.Вставить("ДокументОснование_" + ИмяОбъекта, ОбъектыТипа);
		
		Если Не ПустаяСтрока(ТекстЗапросаОснований) Тогда
			ТекстЗапросаОснований = ТекстЗапросаОснований + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|";
		КонецЕсли;
			
		
		Если ИмяОбъекта = "ВозвратТоваровМеждуОрганизациями"
		 Или ИмяОбъекта = "ПередачаТоваровМеждуОрганизациями" Тогда
		 
			ТекстЗапросаОснований = ТекстЗапросаОснований + 
			"ВЫБРАТЬ
			|	Таблица.Организация КАК Организация,
			|	ВЫБОР КОГДА Таблица.РасчетыЧерезОтдельногоКонтрагента ТОГДА
			|		Таблица.Контрагент
			|	ИНАЧЕ
			|		Таблица.ОрганизацияПолучатель
			|	КОНЕЦ                 КАК Контрагент,
			|	""""                  КАК КППКонтрагента,
			|	Таблица.Подразделение КАК Подразделение,
			|	%ИдентификаторГосКонтракта% КАК ИдентификаторГосКонтракта,
			|	Таблица.Валюта        КАК Валюта
			|ИЗ
			|	Документ." + ИмяОбъекта + " КАК Таблица
			|ГДЕ
			|	Таблица.Ссылка В (&ДокументОснование_" + ИмяОбъекта + ")";

		ИначеЕсли ИмяОбъекта = "ОтчетПоКомиссииМеждуОрганизациями" Тогда
			
			ТекстЗапросаОснований = ТекстЗапросаОснований + 
			"ВЫБРАТЬ
			|	Таблица.Комиссионер КАК Организация,
			|	ВЫБОР КОГДА Таблица.РасчетыЧерезОтдельногоКонтрагента ТОГДА
			|		Таблица.Контрагент
			|	ИНАЧЕ
			|		Таблица.Организация
			|	КОНЕЦ                 КАК Контрагент,
			|	""""                  КАК КППКонтрагента,
			|	Таблица.Подразделение КАК Подразделение,
			|	%ИдентификаторГосКонтракта% КАК ИдентификаторГосКонтракта,
			|	Таблица.Валюта        КАК Валюта
			|ИЗ
			|	Документ." + ИмяОбъекта + " КАК Таблица
			|ГДЕ
			|	Таблица.Ссылка В (&ДокументОснование_" + ИмяОбъекта + ")";
			
		ИначеЕсли Не ОбщегоНазначения.ЕстьРеквизитОбъекта("Грузополучатель", МетаданныеДокумента) Тогда
			
			ТекстЗапросаОснований = ТекстЗапросаОснований + 
			"ВЫБРАТЬ
			|	Таблица.Организация   КАК Организация,
			|	Таблица.Контрагент    КАК Контрагент,
			|	""""                  КАК КППКонтрагента,
			|	Таблица.Подразделение КАК Подразделение,
			|	%ИдентификаторГосКонтракта% КАК ИдентификаторГосКонтракта,
			|	Таблица.Валюта        КАК Валюта
			|ИЗ
			|	Документ." + ИмяОбъекта + " КАК Таблица
			|ГДЕ
			|	Таблица.Ссылка В (&ДокументОснование_" + ИмяОбъекта + ")";
			
		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("Договор", МетаданныеДокумента) Тогда
			
			ТекстЗапросаОснований = ТекстЗапросаОснований + 
			"ВЫБРАТЬ
			|	Таблица.Организация КАК Организация,
			|	Таблица.Контрагент  КАК Контрагент,
			|ВЫБОР
			|	КОГДА Таблица.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
			|			И Таблица.Грузополучатель <> Таблица.Контрагент
			|			И Таблица.Грузополучатель.ОбособленноеПодразделение
			|			И Таблица.Грузополучатель.ГоловнойКонтрагент = Таблица.Контрагент
			|		ТОГДА Таблица.Грузополучатель.КПП
			|	ИНАЧЕ """"
			|КОНЕЦ                    КАК КППКонтрагента,
			|	Таблица.Подразделение КАК Подразделение,
			|	%ИдентификаторГосКонтракта% КАК ИдентификаторГосКонтракта,
			|	Таблица.Валюта        КАК Валюта
			|ИЗ
			|	Документ." + ИмяОбъекта + " КАК Таблица
			|ГДЕ
			|	Таблица.Ссылка В (&ДокументОснование_" + ИмяОбъекта + ")";
			
		Иначе
			
			ТекстЗапросаОснований = ТекстЗапросаОснований + 
			"ВЫБРАТЬ
			|	Таблица.Организация КАК Организация,
			|	Таблица.Контрагент  КАК Контрагент,
			|ВЫБОР
			|	КОГДА Таблица.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
			|			И Таблица.Грузополучатель <> Таблица.Контрагент
			|			И Таблица.Грузополучатель.ОбособленноеПодразделение
			|			И Таблица.Грузополучатель.ГоловнойКонтрагент = Таблица.Контрагент
			|		ТОГДА Таблица.Грузополучатель.КПП
			|	ИНАЧЕ """"
			|КОНЕЦ                    КАК КППКонтрагента,
			|	Таблица.Подразделение КАК Подразделение,
			|	НЕОПРЕДЕЛЕНО          КАК ИдентификаторГосКонтракта,
			|	Таблица.Валюта        КАК Валюта
			|ИЗ
			|	Документ." + ИмяОбъекта + " КАК Таблица
			|ГДЕ
			|	Таблица.Ссылка В (&ДокументОснование_" + ИмяОбъекта + ")";
			
		КонецЕсли;
		
		Если ИмяОбъекта = "КорректировкаРеализации" Тогда
			
			ТекстЗапросаИсходныхДанных = 
			"ВЫБРАТЬ
			|	ТекущийДокумент.Ссылка                КАК Ссылка,
			|	ТекущийДокумент.ДокументОснование     КАК ДокументОснование,
			|	ТекущийДокумент.ВидКорректировки      КАК ХозяйственнаяОперация
			|ПОМЕСТИТЬ ВТ_ДокументыОснования
			|ИЗ
			|	Документ.КорректировкаРеализации КАК ТекущийДокумент
			|ГДЕ
			|	ТекущийДокумент.Ссылка В (&ДокументОснование_КорректировкаРеализации)
			|	И ТекущийДокумент.ВидКорректировки В (
			|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаПоСогласованиюСторон),
			|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИсправлениеОшибок))
			|;
			|
			|/////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТекущийДокумент.Ссылка                КАК Ссылка,
			|	ИсходныйСчетФактура.Ссылка            КАК СчетФактура,
			|	ТекущийДокумент.ХозяйственнаяОперация КАК ХозяйственнаяОперация
			|ПОМЕСТИТЬ ВТ_ИсходныеСчетаФактуры
			|ИЗ
			|	ВТ_ДокументыОснования КАК ТекущийДокумент
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК ИсходныйСФОснования
			|		ПО ТекущийДокумент.ДокументОснование = ИсходныйСФОснования.ДокументОснование
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК ИсходныйСчетФактура
			|		ПО ИсходныйСФОснования.Ссылка = ИсходныйСчетФактура.Ссылка
			|			И ИсходныйСчетФактура.Проведен
			|			И НЕ ИсходныйСчетФактура.Исправление
			|;
			|
			|/////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ИсходныеСчетаФактуры.Ссылка                КАК Ссылка,
			|	Основания.ДокументОснование                КАК ДокументОснование,
			|	ИсходныеСчетаФактуры.СчетФактура           КАК СчетФактура,
			|	ИсходныеСчетаФактуры.ХозяйственнаяОперация КАК ХозяйственнаяОперация
			|ПОМЕСТИТЬ ВТ_ОснованияИсходных
			|ИЗ
			|	ВТ_ИсходныеСчетаФактуры КАК ИсходныеСчетаФактуры
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК Основания
			|		ПО ИсходныеСчетаФактуры.СчетФактура = Основания.Ссылка
			|;
			|/////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОснованияИсходных.Ссылка                КАК Ссылка,
			|	КорректировкаРеализации.Ссылка          КАК ДокументОснование,
			|	ОснованияИсходных.СчетФактура           КАК СчетФактура,
			|	ОснованияИсходных.ХозяйственнаяОперация КАК ХозяйственнаяОперация
			|ПОМЕСТИТЬ ВТ_ОснованияИсходныхИКорректировки
			|ИЗ
			|	ВТ_ОснованияИсходных КАК ОснованияИсходных
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализации
			|		ПО ОснованияИсходных.ДокументОснование = КорректировкаРеализации.ДокументОснование
			|		И (КорректировкаРеализации.Проведен)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ОснованияИсходных.Ссылка,
			|	ОснованияИсходных.ДокументОснование,
			|	ОснованияИсходных.СчетФактура,
			|	ОснованияИсходных.ХозяйственнаяОперация
			|ИЗ
			|	ВТ_ОснованияИсходных КАК ОснованияИсходных
			|;
			|
			|/////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОснованияИсходных.Ссылка      КАК ДокументОснование,
			|	ОснованияИсходных.СчетФактура КАК ИсходныйСчетФактура,
			|	ИсходныеДокументы.Ссылка      КАК ИсходныйДокумент,
			|	ИсходныеДокументы.Номер       КАК НомерИсходногоДокумента,
			|	
			|	ВЫБОР КОГДА ИсходныеДокументы.Исправление ТОГДА
			|		ЕСТЬNULL(ИсходныеДокументы.СчетФактураОснование.Дата, Неопределено)
			|	ИНАЧЕ
			|		ИсходныеДокументы.Дата
			|	КОНЕЦ КАК ДатаИсходногоДокумента,
			|	
			|	ВЫБОР КОГДА ИсходныеДокументы.Исправление ТОГДА
			|		ИсходныеДокументы.НомерИсправления
			|	ИНАЧЕ
			|		Неопределено
			|	КОНЕЦ КАК НомерИсправленияИсходногоДокумента,
			|	
			|	ВЫБОР КОГДА ИсходныеДокументы.Исправление ТОГДА
			|		ИсходныеДокументы.Дата
			|	ИНАЧЕ
			|		Неопределено
			|	КОНЕЦ КАК ДатаИсправленияИсходногоДокумента,
			|	
			|	ВЫБОР КОГДА ОснованияИсходных.ХозяйственнаяОперация =
			|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаПоСогласованиюСторон)
			|			ИЛИ ИсходныеДокументы.Корректировочный ТОГДА
			|		ИСТИНА
			|	ИНАЧЕ
			|		ЛОЖЬ
			|	КОНЕЦ КАК Корректировочный,
			|
			|	ВЫБОР КОГДА ОснованияИсходных.ХозяйственнаяОперация =
			|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИсправлениеОшибок) ТОГДА
			|		ИСТИНА
			|	ИНАЧЕ
			|		ЛОЖЬ
			|	КОНЕЦ КАК Исправление
			|
			|ИЗ
			|	ВТ_ОснованияИсходныхИКорректировки КАК ОснованияИсходных
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураОснования
			|		ПО ОснованияИсходных.ДокументОснование = СчетФактураОснования.ДокументОснование
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК ИсходныеДокументы
			|		ПО СчетФактураОснования.Ссылка = ИсходныеДокументы.Ссылка
			|			И (НЕ ИсходныеДокументы.Ссылка = &СчетФактура)
			|			И (НЕ ИсходныеДокументы.ПометкаУдаления)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ИсходныеДокументы.Корректировочный УБЫВ,
			|	ВЫБОР КОГДА ИсходныеДокументы.Корректировочный И ИсходныеДокументы.Исправление ТОГДА
			|		ЕСТЬNULL(ИсходныеДокументы.СчетФактураОснование.Дата, Неопределено)
			|	КОГДА ИсходныеДокументы.Корректировочный ТОГДА
			|		ИсходныеДокументы.Дата
			|	ИНАЧЕ
			|		0
			|	КОНЕЦ УБЫВ,
			|	НомерИсправления УБЫВ
			|
			|ИТОГИ
			|	МАКСИМУМ(Корректировочный),
			|	МАКСИМУМ(Исправление)
			|ПО
			|	ОБЩИЕ,
			|	ИсходныйСчетФактура";
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВыборкаОснований = Неопределено;
	ВыборкаИсходныхДанных = Неопределено;
	
	
	ТекстЗапросаОснований = СтрЗаменить(ТекстЗапросаОснований, "%ИдентификаторГосКонтракта%", "Таблица.Договор.ИдентификаторГосКонтракта");
	
	Если ПустаяСтрока(ТекстЗапросаИсходныхДанных) Тогда
	
		Запрос.Текст = ТекстЗапросаОснований;
		ВыборкаОснований = Запрос.Выполнить().Выбрать();
	
	Иначе
		
		Запрос.Текст = ТекстЗапросаОснований + "
		|;
		|
		|" + ТекстЗапросаИсходныхДанных;
		
		Запрос.УстановитьПараметр("СчетФактура", НоваяСФ.Ссылка);
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		ВыборкаОснований = РезультатЗапроса[0].Выбрать();
		КоличествоЗапросов = РезультатЗапроса.Количество();
		ВыборкаИсходныхДанных = РезультатЗапроса[КоличествоЗапросов-1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	КонецЕсли;
	
	ПерваяСтрока      = Истина;
	РазныеОрганизации = Ложь;
	РазныеКонтрагенты = Ложь;
	РазныеВалюты      = Ложь;
	РазныеПодразделения = Ложь;
	РазныеИдентификаторыГосКонтракта = Ложь;
	
	Пока ВыборкаОснований.Следующий() Цикл
		
		Если ПерваяСтрока Тогда
			ПерваяСтрока = Ложь;
			ЗаполнитьЗначенияСвойств(Результат, ВыборкаОснований);
		Иначе
			РазныеОрганизации = РазныеОрганизации Или Результат.Организация <> ВыборкаОснований.Организация;
			РазныеКонтрагенты = РазныеКонтрагенты Или Результат.Контрагент <> ВыборкаОснований.Контрагент;
			РазныеВалюты      = РазныеВалюты Или Результат.Валюта <> ВыборкаОснований.Валюта;
			РазныеПодразделения = РазныеПодразделения Или Результат.Подразделение <> ВыборкаОснований.Подразделение;
			РазныеИдентификаторыГосКонтракта = РазныеИдентификаторыГосКонтракта
				ИЛИ Результат.ИдентификаторГосКонтракта <> ВыборкаОснований.ИдентификаторГосКонтракта;
		КонецЕсли;
		
	КонецЦикла;
	
	Если РазныеОрганизации ИЛИ РазныеКонтрагенты ИЛИ РазныеВалюты Тогда
			
		ТекстСообщения = НСтр("ru='Реквизиты документов, на основании которых зарегистрирован счет-фактура, не совпадают:'")
			+ ?(РазныеОрганизации, Символы.ПС + НСтр("ru=' - не совпадает организация'"), "")
			+ ?(РазныеКонтрагенты, Символы.ПС + НСтр("ru=' - не совпадает контрагент'"), "")
			+ ?(РазныеВалюты, Символы.ПС + НСтр("ru=' - не совпадает валюта документа'"), "") + Символы.ПС 
			+ НСтр("ru='Необходимо изменить параметры документов-оснований или зарегистрировать по документам с расхождениями отдельные счета-фактуры.'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Если РазныеОрганизации Тогда
			Результат.Организация = Неопределено;
		КонецЕсли;
		Если РазныеКонтрагенты Тогда
			Результат.Контрагент = Неопределено;
		КонецЕсли;
		Если РазныеВалюты Тогда
			Результат.Валюта = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.Ответственный = Пользователи.ТекущийПользователь();
	
	Если РазныеПодразделения Тогда
		Результат.Подразделение = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Результат.Ответственный, Результат.Подразделение);
	КонецЕсли;
	Если РазныеИдентификаторыГосКонтракта Тогда
		Результат.ИдентификаторГосКонтракта = "";
	КонецЕсли;
	
	Если ВыборкаИсходныхДанных <> Неопределено Тогда
		
		Если ВыборкаИсходныхДанных.Следующий() Тогда
			Результат.Исправление      = ВыборкаИсходныхДанных.Исправление;
			Результат.Корректировочный = ВыборкаИсходныхДанных.Корректировочный;
		КонецЕсли;
		
		ВыборкаПоИсходнымСчетамФактуры = ВыборкаИсходныхДанных.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		РеквизитыСчетаФактурыОснования = Неопределено;
		
		Если Результат.Исправление Тогда
			
			ПерваяСтрока               = Истина;
			РазныеСчетФактураОснование = Ложь;
			
			Пока ВыборкаПоИсходнымСчетамФактуры.Следующий() Цикл
				
				ВыборкаПоДокументам = ВыборкаПоИсходнымСчетамФактуры.Выбрать();
				Если ВыборкаПоДокументам.Следующий() Тогда
					
					Если ПерваяСтрока Тогда
						ПерваяСтрока = Ложь;
						Результат.СчетФактураОснование = ВыборкаПоДокументам.ИсходныйДокумент;
					Иначе
						РазныеСчетФактураОснование = РазныеСчетФактураОснование
							Или Результат.СчетФактураОснование <> ВыборкаПоДокументам.ИсходныйДокумент;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если РазныеСчетФактураОснование Тогда
				Результат.Исправление = Ложь;
				Результат.Корректировочный = Истина;
			Иначе
				РеквизитыСчетаФактурыОснования = Документы.СчетФактураВыданный.ДанныеСчетаФактуры(Результат.СчетФактураОснование);
				Если Результат.Корректировочный И Не РеквизитыСчетаФактурыОснования.Корректировочный Тогда
					Результат.Исправление = Ложь;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Результат.Корректировочный Тогда
			
			Если Результат.Исправление Тогда
				
				МассивКорректировок = Запрос.Параметры.ДокументОснование_КорректировкаРеализации;
				ИсходныеДанныеСчетаФактуры = РеквизитыСчетаФактурыОснования.ДокументыОснования;
				
				Для Каждого ОснованиеКорректировка Из МассивКорректировок Цикл
					Для Каждого СтрокаТаблицы Из ИсходныеДанныеСчетаФактуры Цикл
						СтрокаСРеквизитами = РеквизитыОснований.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаСРеквизитами, СтрокаТаблицы);
						СтрокаСРеквизитами.ДокументОснование = ОснованиеКорректировка;
					КонецЦикла;
				КонецЦикла;
				
			Иначе
				
				ВыборкаПоИсходнымСчетамФактуры.Сбросить();
				
				Пока ВыборкаПоИсходнымСчетамФактуры.Следующий() Цикл
					
					ВыборкаПоДокументам = ВыборкаПоИсходнымСчетамФактуры.Выбрать();
					Пока ВыборкаПоДокументам.Следующий() Цикл
						
						Если РеквизитыОснований.Найти(ВыборкаПоДокументам.ДокументОснование) = Неопределено Тогда
							СтрокаСРеквизитами = РеквизитыОснований.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаСРеквизитами, ВыборкаПоДокументам);
						КонецЕсли;
						
					КонецЦикла;
				
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСФ(НоваяСФ, ДанныеЗаполнения)
	
	НоваяСФ.Организация					= ДанныеЗаполнения.Организация;
	НоваяСФ.Контрагент					= ДанныеЗаполнения.Контрагент;
	НоваяСФ.КППКонтрагента				= ДанныеЗаполнения.КППКонтрагента;
	НоваяСФ.КодВидаОперации				= ДанныеЗаполнения.КодВидаОперации;
	НоваяСФ.Валюта						= ДанныеЗаполнения.ПараметрыСчетаФактуры.Валюта;
	НоваяСФ.ДатаВыставления 			= ТекущаяДата(); 
	НоваяСФ.ДокументОснование			= ДанныеЗаполнения.ДокументОснование;
//	НоваяСФ.ДокументыОснования			= ДанныеЗаполнения.РеквизитыОснования;
	НоваяСФ.Исправление					= Ложь;
	НоваяСФ.Корректировочный			= Ложь; 
	НоваяСФ.ВыставленВЭлектронномВиде	= Ложь; 
	НоваяСФ.НомерИсправления			= "";
	НоваяСФ.Ответственный				= ДанныеЗаполнения.ПараметрыСчетаФактуры.Ответственный;
	НоваяСФ.Подразделение				= ДанныеЗаполнения.ПараметрыСчетаФактуры.Подразделение;
	НоваяСФ.СчетФактураОснование		= НоваяСФ.СчетФактураОснование;
	НоваяСФ.КодВидаОперацииНаУменьшение	= ДанныеЗаполнения.КодВидаОперацииНаУменьшение;
	НоваяСФ.ИдентификаторГосКонтракта	= ДанныеЗаполнения.ПараметрыСчетаФактуры.ИдентификаторГосКонтракта;	// ?( ДанныеЗаполнения.ПараметрыСчетаФактуры.ИдентификаторГосКонтракта = NULL, Ложь, Истина );
	
	НоваяСФ.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры	// ЗаполнитьСФ(НоваяСФ,ДанныеЗаполнения);()


&НаСервере
Процедура ВвестиСчетФактуру(ДанныеЗаполнения)
		
	Перем СтрокаОснования;
	
	НоваяСФ			= Документы.СчетФактураВыданный.СоздатьДокумент(); 
	НоваяСФ.Дата	= ТекущаяДата();
	
	СтрокаОснования = НоваяСФ.ДокументыОснования.Добавить();
	СтрокаОснования.ДокументОснование = ДанныеЗаполнения.ДокументОснование;
	
	ПараметрыСчетаФактуры = ПолучитьПараметрыСчетаФактурыПоОснованиям(НоваяСФ);
	
	ДанныеЗаполнения.Свойство("Корректировочный", Неопределено);
	ДанныеЗаполнения.Вставить("ПараметрыСчетаФактуры", ПараметрыСчетаФактуры);
	
	Если Не ПараметрыСчетаФактуры.Организация = Неопределено Тогда
		ДанныеЗаполнения.Вставить("Организация", ПараметрыСчетаФактуры.Организация);
	КонецЕсли;
	
	Если Не ПараметрыСчетаФактуры.Контрагент = Неопределено Тогда
		ДанныеЗаполнения.Вставить("Контрагент",     ПараметрыСчетаФактуры.Контрагент);
		ДанныеЗаполнения.Вставить("КППКонтрагента", ПараметрыСчетаФактуры.КППКонтрагента);
	КонецЕсли;
	
	Если НЕ ПараметрыСчетаФактуры.Корректировочный = Неопределено Тогда
		Корректировочный = ПараметрыСчетаФактуры.Корректировочный;
		ДанныеЗаполнения.Вставить("Корректировочный", Корректировочный);
		ДанныеЗаполнения.Вставить("Исправление", ПараметрыСчетаФактуры.Исправление);
	КонецЕсли;
	
	Если НЕ ПараметрыСчетаФактуры.СчетФактураОснование = Неопределено И ДанныеЗаполнения.Исправление Тогда
		ДанныеЗаполнения.Вставить("СчетФактураОснование", ПараметрыСчетаФактуры.СчетФактураОснование);
	КонецЕсли;
	
	Если НЕ ДанныеЗаполнения.Свойство("КодВидаОперации") Тогда
		КодВидаОперации = "01";
		ДанныеЗаполнения.Вставить("КодВидаОперации", КодВидаОперации);
	КонецЕсли;
	
	Если ДанныеЗаполнения.КодВидаОперации = "34" Тогда
		ДанныеЗаполнения.Вставить("КодВидаОперацииНаУменьшение", "34");
	Иначе
		ДанныеЗаполнения.Вставить("КодВидаОперацииНаУменьшение", "18");
	КонецЕсли;
	
	ИдентификаторГосКонтракта = ПараметрыСчетаФактуры.ИдентификаторГосКонтракта;
	
	Если Не ПараметрыСчетаФактуры.РеквизитыОснований.Количество() = 0 Тогда
		ДанныеЗаполнения.Вставить("РеквизитыОснования", ПараметрыСчетаФактуры.РеквизитыОснований);
	Иначе
		ДанныеЗаполнения.Вставить("РеквизитыОснования", СтрокаОснования);
	КонецЕсли;
	
	ЗаполнитьСФ(НоваяСФ,ДанныеЗаполнения); 
	
КонецПроцедуры

// Заполняет дату платежа по документу основанию и условиям продажи
//
&НаСервере  
Процедура ЗаполнитьДатуПлатежаПоОснованию(Знач НоваяРеализация, ЗаказКлиента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
			|ВЫБРАТЬ
			|	МАКСИМУМ(ЗаказКлиентаЭтапыГрафикаОплаты.ДатаПлатежа) КАК ДатаПлатежа
			|ИЗ
			|	Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЗаказКлиентаЭтапыГрафикаОплаты
			|ГДЕ
			|	ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка = &ЗаказКлиента
			|	И ЗаказКлиентаЭтапыГрафикаОплаты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.КредитПослеОтгрузки)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	МАКСИМУМ(ЗаявкаНаВозвратЭтапыГрафикаОплаты.ДатаПлатежа)
			|ИЗ
			|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЭтапыГрафикаОплаты КАК ЗаявкаНаВозвратЭтапыГрафикаОплаты
			|ГДЕ
			|	ЗаявкаНаВозвратЭтапыГрафикаОплаты.Ссылка = &ЗаказКлиента
			|	И ЗаявкаНаВозвратЭтапыГрафикаОплаты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.КредитПослеОтгрузки)
			|";
			
		Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ДатаПлатежа = Выборка.ДатаПлатежа;
		КонецЕсли;
		
	
//**  	ЭтапыОплатыСервер.ЗаполнитьДатуПлатежаПоУмолчанию(НоваяРеализация);
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьДокументНаОснованииЗаказаКлиента(Знач ДокументОснование,
	                                                Знач СкладОтгрузки,
	                                                ВариантОформления,
	                                                РеквизитыЗаказа = Неопределено,
	                                                ПараметрыОформления = Неопределено,
													Знач НоваяРеализация)
	ТипОснования = ТипЗнч(ДокументОснование);
	ЗаполнятьПоОстаткам = Ложь;
	
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК ЗаказКлиента,
	|	ЗаказКлиента.Партнер КАК Партнер,
	|	ЗаказКлиента.Контрагент КАК Контрагент,
	|	ЗаказКлиента.КонтактноеЛицо КАК КонтактноеЛицо,
	|	ЗаказКлиента.Договор КАК Договор,
	|	ЗаказКлиента.Организация КАК Организация,
	|	ЗаказКлиента.ФормаОплаты КАК ФормаОплаты,
	|	ЗаказКлиента.Соглашение КАК Соглашение,
	|	ЗаказКлиента.КартаЛояльности КАК КартаЛояльности,
	|	ЗаказКлиента.Сделка КАК Сделка,
	|	ЗаказКлиента.Валюта КАК Валюта,
	|	ЗаказКлиента.Валюта КАК ВалютаВзаиморасчетов,
	|	ЗаказКлиента.ГрафикОплаты КАК ГрафикОплаты,
	|	ЗаказКлиента.Подразделение КАК Подразделение,
	|	ЗаказКлиента.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ВЫБОР
	|		КОГДА ЗаказКлиента.Склад.ЭтоГруппа
	|				И ЗаказКлиента.Склад.ВыборГруппы = ЗНАЧЕНИЕ(Перечисление.ВыборГруппыСкладов.РазрешитьВЗаказах)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|		ИНАЧЕ ЗаказКлиента.Склад
	|	КОНЕЦ КАК Склад,
	|	ВЫБОР
	|		КОГДА ЗаказКлиента.Склад.ЭтоГруппа
	|				И ЗаказКлиента.Склад.ВыборГруппы = ЗНАЧЕНИЕ(Перечисление.ВыборГруппыСкладов.РазрешитьВЗаказах)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗапрещеноВыбиратьГруппуСкладов,
	|	ЗаказКлиента.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ЗаказКлиента.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ЗаказКлиента.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ЗаказКлиента.НеОтгружатьЧастями КАК НеОтгружатьЧастями,
	|	ЗаказКлиента.АдресДоставки КАК АдресДоставки,
	|	ЗаказКлиента.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке КАК ОрдернаяСхемаПриОтгрузке,
	|	ЗаказКлиента.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ЗаказКлиента.Статус КАК СтатусДокумента,
	|	НЕ ЗаказКлиента.Проведен КАК ЕстьОшибкиПроведен,
	|	ИСТИНА КАК ЕстьОшибкиСтатус,
	|	ЗаказКлиента.БанковскийСчет КАК БанковскийСчетОрганизации,
	|	ЗаказКлиента.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	ЗаказКлиента.Грузоотправитель КАК Грузоотправитель,
	|	ЗаказКлиента.Грузополучатель КАК Грузополучатель,
	|	ЗаказКлиента.БанковскийСчетГрузоотправителя КАК БанковскийСчетГрузоотправителя,
	|	ЗаказКлиента.БанковскийСчетГрузополучателя КАК БанковскийСчетГрузополучателя,
	|	ЗаказКлиента.ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
	|	ЗаказКлиента.СрокВозвратаМногооборотнойТары КАК СрокВозвратаМногооборотнойТары,
	|	ЗаказКлиента.ТребуетсяЗалогЗаТару КАК ТребуетсяЗалогЗаТару,
	|	ВЫБОР
	|		КОГДА &ИспользоватьСоглашенияСКлиентами
	|			ТОГДА ЗаказКлиента.Соглашение.КалендарьВозвратаТары
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПроизводственныеКалендари.ПустаяСсылка)
	|	КОНЕЦ КАК КалендарьВозвратаТары,
	|	ВЫБОР
	|		КОГДА &ИспользоватьСоглашенияСКлиентами
	|			ТОГДА ЗаказКлиента.Соглашение.РассчитыватьДатуВозвратаТарыПоКалендарю
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РассчитыватьДатуВозвратаТарыПоКалендарю,
	|	ЗаказКлиента.СкидкиНаценки.(
	|		КлючСвязи КАК КлючСвязи,
	|		СкидкаНаценка КАК СкидкаНаценка,
	|		Сумма КАК Сумма
	|	) КАК СкидкиНаценки,
	|	ЗаказКлиента.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками
	|				И ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|			ТОГДА ЗаказКлиента.СпособДоставки
	|	КОНЕЦ КАК СпособДоставки,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками
	|				И ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|			ТОГДА ЗаказКлиента.ПеревозчикПартнер
	|	КОНЕЦ КАК ПеревозчикПартнер,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками
	|				И ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|			ТОГДА ЗаказКлиента.ДополнительнаяИнформацияПоДоставке
	|	КОНЕЦ КАК ДополнительнаяИнформацияПоДоставке,
	|	ЗаказКлиента.ПорядокРасчетов КАК ПорядокРасчетов,
	|	ЗаказКлиента.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаспоряженияНаОтгрузку.Склад КАК Склад
	|ИЗ
	|	РегистрНакопления.РаспоряженияНаОтгрузку.Обороты(, , , Распоряжение = &ЗаказКлиента) КАК РаспоряженияНаОтгрузку";
	
		Запрос.УстановитьПараметр("ЗаказКлиента", ДокументОснование);
		Запрос.УстановитьПараметр("ИспользоватьСоглашенияСКлиентами", ИспользоватьСоглашенияСКлиентами);
		Запрос.УстановитьПараметр("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками",
			ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками"));
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		РеквизитыЗаказа = РезультатЗапроса[0].Выбрать();
		РеквизитыЗаказа.Следующий();

		Документы.ЗаказКлиента.ПроверитьВозможностьВводаНаОсновании(
			РеквизитыЗаказа.ЗаказКлиента,
			РеквизитыЗаказа.СтатусДокумента,
			РеквизитыЗаказа.ЕстьОшибкиПроведен);
		
		// Заполнение шапки
		ЗаполнитьЗначенияСвойств(НоваяРеализация, РеквизитыЗаказа);
		Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента") Тогда
			Если НЕ ЗначениеЗаполнено(НоваяРеализация.Дата) Тогда
				НоваяРеализация.Дата = ТекущаяДатаСеанса();
			КонецЕсли;
		КонецЕсли;
		ДатаВозвратаМногооборотнойТары = МногооборотнаяТараСервер.РассчитатьДатуВозвратаМногооборотнойТары(
			НоваяРеализация,
			РеквизитыЗаказа.СрокВозвратаМногооборотнойТары,
			РеквизитыЗаказа.РассчитыватьДатуВозвратаТарыПоКалендарю,
			РеквизитыЗаказа.КалендарьВозвратаТары);
		
		Если РеквизитыЗаказа.ЗапрещеноВыбиратьГруппуСкладов Тогда
			МассивСкладов = РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("Склад");
		КонецЕсли;
		
	
	РеализацияПоЗаказам = Истина;
	
	Если НоваяРеализация.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным Тогда
		Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(НоваяРеализация.Соглашение) Тогда
			УсловияПродаж = ПродажиСервер.ПолучитьУсловияПродаж(НоваяРеализация.Соглашение);
			ФормаОплаты   = УсловияПродаж.ФормаОплаты;
			
			СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияКассыОрганизацииПоУмолчанию();
			СтруктураПараметров.Организация    			= НоваяРеализация.Организация;
			СтруктураПараметров.НаправлениеДеятельности	= НоваяРеализация.НаправлениеДеятельности;
			СтруктураПараметров.ФормаОплаты				= НоваяРеализация.ФормаОплаты;

			Касса = ЗначениеНастроекПовтИсп.ПолучитьКассуОрганизацииПоУмолчанию(СтруктураПараметров);
			//++ Обновление 
			//ЭтапыОплатыСервер.ЗаполнитьДатуПлатежаПоУмолчанию(НоваяРеализация, УсловияПродаж.ГрафикОплаты);
			//--
		КонецЕсли;
	Иначе
//** 		ЗаполнитьДатуПлатежаПоОснованию(НоваяРеализация, ДокументОснование);
	КонецЕсли;
	
	// Заполнение т.ч. товары.
		ЗаполнятьПоОстаткам = Истина;
		СкладОтгрузки = НоваяРеализация.Склад;
	
	Если ЗаполнятьПоОстаткам Тогда
		
		Если ТипОснования = Тип("Массив") Тогда
			МассивЗаказов = ДокументОснование;
		Иначе
			МассивЗаказов = Новый Массив();
			МассивЗаказов.Добавить(НоваяРеализация.ЗаказКлиента);
		КонецЕсли;
		
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("ВариантОформления", ВариантОформления);
		ПараметрыЗаполнения.Вставить("ПараметрыОформления", ПараметрыОформления);
		
		Документы.РеализацияТоваровУслуг.ЗаполнитьПоОстаткамЗаказов(
			НоваяРеализация,
			НоваяРеализация.Товары,
			НоваяРеализация.СкидкиНаценки,
			?(СкладОтгрузки=Неопределено, Справочники.Склады.ПустаяСсылка(), СкладОтгрузки),
			МассивЗаказов,
			ПараметрыЗаполнения);
		НоваяРеализация.ВариантОформленияПродажи = ?(ЗначениеЗаполнено(ВариантОформления), 
			ВариантОформления,
			Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг);
		ЗаказыСервер.ЗаполнитьЗаказВШапкеПоЗаказамВТабличнойЧасти(НоваяРеализация.ЗаказКлиента, НоваяРеализация.Товары, "ЗаказКлиента");
		
		ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(НоваяРеализация, Документы.РеализацияТоваровУслуг);
		НоменклатураСервер.ЗаполнитьСерииПоFEFO(НоваяРеализация,ПараметрыУказанияСерий, Ложь);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НоваяРеализация.Статус) Тогда
		НоваяРеализация.Статус = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;
	КонецЕсли;
	
	СтруктураОснование = Документы.РеализацияТоваровУслуг.СтруктураОснованияДляПечати(НоваяРеализация);
	ЗаполнитьЗначенияСвойств(НоваяРеализация, СтруктураОснование);
	
	СтруктураДействий = Новый Структура;
	_ДоработкиСлужебный.ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, НоваяРеализация);
	Для Каждого ТекСтрока Из НоваяРеализация.Товары Цикл
		_ДоработкиСлужебный.ПересчитатьСуммуВСтрокеТЧ(ТекСтрока,	СтруктураДействий);
		_ДоработкиСлужебный.ПересчитатьСуммуНДСВСтрокеТЧ(ТекСтрока,	СтруктураДействий);
		_ДоработкиСлужебный.ПересчитатьСуммуСНДСВСтрокеТЧ(ТекСтрока,СтруктураДействий);
	КонецЦикла;		// ТекСтрока Из НоваяРеализация.Товары 
КонецПроцедуры

&НаСервере 
Функция СодатьРеализацию( Организация = Неопределено )
	
	НоваяРеализация			= Документы.РеализацияТоваровУслуг.СоздатьДокумент(); 
	НоваяРеализация.Дата	= ТекущаяДата(); 
	Если ( Организация <> Неопределено ) Тогда
		НоваяРеализация.Организация = Организация;
	КонецЕсли;	
	НоваяРеализация.Записать(РежимЗаписиДокумента.Запись);
	Возврат НоваяРеализация;
	
КонецФункции // СодатьРеализацию(ТекЗаказ)()
 
&НаСервере
Функция ПроверитьНеобходимостьДокументов(ДокументОснование)
	
	ПроверкаЗаказов   = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	_ЗаявкаНаДоставкуЗаказы.ЗаказКлиента
	               |ИЗ
	               |	Документ._ЗаявкаНаДоставку.Заказы КАК _ЗаявкаНаДоставкуЗаказы
	               |ГДЕ
	               |	_ЗаявкаНаДоставкуЗаказы.ЗаказКлиента = &ЗаказКлиента
	               |	И _ЗаявкаНаДоставкуЗаказы.НужныДокументы = ИСТИНА
	               |	И _ЗаявкаНаДоставкуЗаказы.Ссылка.Проведен = ИСТИНА
	               |	И _ЗаявкаНаДоставкуЗаказы.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	
	Запрос.УстановитьПараметр("ЗаказКлиента", ДокументОснование);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если НЕ Результат.Количество() = 0 Тогда
		ПроверкаЗаказов =  Истина;
	КонецЕсли;
	
	Возврат ПроверкаЗаказов;
	
КонецФункции // ПроверитьДокументыРеализиции()

&НаСервере
Процедура СоздатьРеализациюПоРасходномуОрдеру(Объект) Экспорт
	
	ТоварыПоРаспоряжениям		= Объект.ТоварыПоРаспоряжениям;
	ОтгружаемыеТовары			= Объект.ОтгружаемыеТовары;
	ДокументОснование			= Документы.ЗаказКлиента.ПустаяСсылка();
	
	Если Объект.ОтгрузкаПоЗаданиюНаПеревозку Тогда
		СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента;
	Иначе
		СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	КонецЕсли; 
	
	
	Для Каждого ТекСтрока Из ТоварыПоРаспоряжениям Цикл
		
		Если НЕ ДокументОснование = ТекСтрока.Распоряжение Тогда
			
			СтруктураПоиска		= Новый Структура("Номенклатура, Характеристика, Назначение, Серия, Действие");
			СтруктураПоиска.Вставить("Номенклатура", ТекСтрока.Номенклатура);
			СтруктураПоиска.Вставить("Характеристика", ТекСтрока.Характеристика);
			СтруктураПоиска.Вставить("Назначение", ТекСтрока.Назначение);
			СтруктураПоиска.Вставить("Серия", ТекСтрока.Серия);
			СтруктураПоиска.Вставить("Действие", Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить);
			
			НайденныеСтроки		= ОтгружаемыеТовары.НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументОснование	= ТекСтрока.Распоряжение;
			
			
			Если Не ПроверитьНеобходимостьДокументов(ДокументОснование) Тогда
				ТекстСообщения = НСтр("ru='По документу " + Строка(ДокументОснование) + " - Не  нужны документы'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Возврат
			КонецЕсли;
			
			НоваяРеализация 	= СодатьРеализацию( ДокументОснование.Организация );
			
			СкладОтгрузки		= Неопределено;
			РеквизитыШапки		= Неопределено;
			ПараметрыОформления	= Неопределено;
			ВариантОформления 	= Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
			
			ЗаполнитьДокументНаОснованииЗаказаКлиента(ДокументОснование, СкладОтгрузки, ВариантОформления, РеквизитыШапки, ПараметрыОформления, НоваяРеализация);
			НоваяРеализация.РеализацияПоЗаказам = Истина;
			НоваяРеализация.Менеджер			= ДокументОснование.Менеджер;
			НоваяРеализация.СпособДоставки		= СпособДоставки;
			Если НоваяРеализация.Товары.Количество() = 0 Тогда
				ТекстСообщения = НСтр("ru='По документу " + Строка(ДокументОснование) + " - существует документ реализации и счет-фактура'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				НоваяРеализация.Записать(РежимЗаписиДокумента.Запись);
				НоваяРеализация.Удалить();
				Возврат
			КонецЕсли;
			
			НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение);
			
			ДанныеСчетаФактуры = Новый Структура;
			ДанныеСчетаФактуры.Вставить("ДокументОснование", НоваяРеализация.Ссылка);
			ДанныеСчетаФактуры.Вставить("Организация",       НоваяРеализация.Организация);

			ВвестиСчетФактуру(ДанныеСчетаФактуры);	
		КонецЕсли;		//НЕ ДокументОснование = ТекСтрока.Распоряжение 
		
		ТекстСообщения = НСтр("ru='По документу " + Строка(ТекСтрока.Распоряжение) + " - создан документ реализации и счет-фактура'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЦикла;		// ТекСтрока Из ТоварыПоРаспоряжениям 
	
КонецПроцедуры	// СоздатьРеализациюПоЗаказуКлиента()

&НаСервере
Процедура СоздатьРеализациюПоЗаданиюНаПеревозку(Объект) Экспорт
	
	СпособДоставки  = Перечисления.СпособыДоставки.ДоКлиента;
	
	Распоряжения	= Объект.Распоряжения; 
	ТоварыКДоставке = _ДоработкиСлужебный.ЗаполнитьТоварыКДоставке(Объект);
	ТоварыКДоставке.Сортировать("Распоряжение Возр, Назначение Возр, Номенклатура Возр");  
	ТзЗаказы		= ТоварыКДоставке.Скопировать();
	ТзЗаказы.Свернуть(" Распоряжение, Назначение");
	
	Для Каждого ТекСтрока Из ТзЗаказы Цикл
		ДокументОснование  = ТекСтрока.Распоряжение;
		//ДОВ
		Если ТипЗнч(ДокументОснование) =  Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Продолжить;
		КонецЕсли;  
		
		Если Не ПроверитьНеобходимостьДокументов(ДокументОснование) Тогда
			ТекстСообщения = НСтр("ru='По документу " + Строка(ДокументОснование) + " - Не  нужны документы'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска		= Новый Структура("Распоряжение, Назначение");
		СтруктураПоиска.Вставить("Распоряжение", ТекСтрока.Распоряжение);
		СтруктураПоиска.Вставить("Назначение",   ТекСтрока.Назначение);
		
		НайденныеСтроки		= ТоварыКДоставке.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяРеализация 	= СодатьРеализацию( ДокументОснование.Организация );
		
		СкладОтгрузки		= Неопределено;
		РеквизитыШапки		= Неопределено;
		ПараметрыОформления	= Неопределено;
		ВариантОформления 	= Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
		ЗаполнитьДокументНаОснованииЗаказаКлиента(ДокументОснование, СкладОтгрузки, ВариантОформления, РеквизитыШапки, ПараметрыОформления, НоваяРеализация);
		
		НоваяРеализация.РеализацияПоЗаказам = Истина;
		НоваяРеализация.Менеджер			= ДокументОснование.Менеджер;
		НоваяРеализация.СпособДоставки		= СпособДоставки;
		Если НоваяРеализация.Товары.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru='По документу " + Строка(ДокументОснование) + " - существует документ реализации и счет-фактура'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			НоваяРеализация.Записать(РежимЗаписиДокумента.Запись);
			НоваяРеализация.Удалить();
			Возврат
		КонецЕсли;
		
		НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение);
		
		ДанныеСчетаФактуры = Новый Структура;
		ДанныеСчетаФактуры.Вставить("ДокументОснование", НоваяРеализация.Ссылка);
		ДанныеСчетаФактуры.Вставить("Организация",       НоваяРеализация.Организация);
		ВвестиСчетФактуру(ДанныеСчетаФактуры);	
		
		ТекстСообщения = НСтр("ru='По документу " + Строка(ТекСтрока.Распоряжение) + " - создан документ реализации и счет-фактура'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЦикла;		// ТекСтрока Из ТзЗаказы  
	
КонецПроцедуры	// СоздатьРеализациюПоЗаказуКлиента()


#КонецОбласти


#Область ПечатьУПД

&НаСервере
Процедура ДополнитьТекстЗапросаПоРеквизитамОбъекта(ТекстЗапроса, МассивРеквизитов)
	
	ТекстПредставление = "Представление КАК Представление";
	
	Для Инд = 1 По 3 Цикл
		
		ТекстПредставление = ТекстПредставление + ",
			|	" + ?(МассивРеквизитов.Количество() >= Инд,МассивРеквизитов[инд - 1],"NULL") + " Как ДополнительныйРеквизит" + Инд;
		
	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#Представление", ТекстПредставление);
	
КонецПроцедуры	//ДополнитьТекстЗапросаПоРеквизитамОбъекта

&НаСервере
Функция ИмяРеквизитаДокумента(ИмяОбъекта, Реквизит) 
	
	ИмяРеквизитаДокумента = СтруктураПодчиненностиПереопределяемый.ИмяРеквизитаДокумента(ИмяОбъекта, Реквизит); 
	
	Если Реквизит = "СуммаДокумента" Тогда
		Возврат ?(ИмяРеквизитаДокумента = Неопределено,"СуммаДокумента",ИмяРеквизитаДокумента);
	ИначеЕсли Реквизит = "Валюта" Тогда
		Возврат ?(ИмяРеквизитаДокумента = Неопределено,"Валюта",ИмяРеквизитаДокумента);
	КонецЕсли;
	
КонецФункции	//ИмяРеквизитаДокумента

&НаСервере
Процедура ДополнитьКэшМетаданных(МетаданныеОбъекта, ИмяОбъекта,КэшРеквизитовОбъекта)

	РеквизитыДокумента = КэшРеквизитовОбъекта[ИмяОбъекта];
	Если РеквизитыДокумента = Неопределено Тогда
		
		РеквизитыДокумента = Новый Соответствие;
		ЯвляетсяДокументом = ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта);
		
		ИмяРеквизитаСуммаДокумента = ИмяРеквизитаДокумента(МетаданныеОбъекта.Имя, "СуммаДокумента");
		Если ЯвляетсяДокументом И МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизитаСуммаДокумента) <> Неопределено Тогда
			РеквизитыДокумента.Вставить("СуммаДокумента", ИмяРеквизитаСуммаДокумента);
		Иначе
			РеквизитыДокумента.Вставить("СуммаДокумента", "NULL");
		КонецЕсли;
		
		ИмяРеквизитаВалюта = ИмяРеквизитаДокумента(МетаданныеОбъекта.Имя, "Валюта");
		Если ЯвляетсяДокументом И МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизитаВалюта) <> Неопределено Тогда
			РеквизитыДокумента.Вставить("Валюта", ИмяРеквизитаВалюта);
		Иначе
			РеквизитыДокумента.Вставить("Валюта", "NULL");
		КонецЕсли;
		
		Если ЯвляетсяДокументом Тогда
			РеквизитыДокумента.Вставить("Проведен", "Проведен");
		Иначе
			РеквизитыДокумента.Вставить("Проведен", "Ложь");
		КонецЕсли;
		
		Если ЯвляетсяДокументом Тогда
			РеквизитыДокумента.Вставить("Дата", "Дата");
		Иначе
			РеквизитыДокумента.Вставить("Дата", "NULL");
		КонецЕсли;

		КэшРеквизитовОбъекта.Вставить(ИмяОбъекта, РеквизитыДокумента);

	КонецЕсли;
	
КонецПроцедуры	//ДополнитьКэшМетаданных

&НаСервере
Функция ОбъектыПоКритериюОтбора(ЗначениеКритерияОтбора)
	
	Если Метаданные.КритерииОтбора.СвязанныеДокументы.Тип.СодержитТип(ТипЗнч(ЗначениеКритерияОтбора))  Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СвязанныеДокументы.Ссылка
		|ИЗ
		|	КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СвязанныеДокументы";
		
		Запрос.УстановитьПараметр("ЗначениеКритерияОтбора",ЗначениеКритерияОтбора);
		Возврат Запрос.Выполнить().Выгрузить();
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции	//ОбъектыПоКритериюОтбора

&НаСервере
Функция ВывестиСтруктуруПодчиненности(ТекущийОбъект, ТаблицаДокументов) Экспорт
	
	Таблица				= ОбъектыПоКритериюОтбора(ТекущийОбъект);
	Если Таблица = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КэшПоТипамОбъектов   = Новый Соответствие;
	КэшРеквизитовОбъекта = Новый Соответствие;

	Для Каждого СтрокаТаблицы Из Таблица Цикл

		МетаданныеОбъекта = СтрокаТаблицы.Ссылка.Метаданные();
		Если Не ПравоДоступа("Чтение", МетаданныеОбъекта) Тогда
			Продолжить;
		КонецЕсли;

		ПолноеИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
		ДополнитьКэшМетаданных(МетаданныеОбъекта, ПолноеИмяОбъекта, КэшРеквизитовОбъекта);

		МассивСсылок = КэшПоТипамОбъектов[ПолноеИмяОбъекта];
		Если МассивСсылок = Неопределено Тогда

			МассивСсылок = Новый Массив;
			КэшПоТипамОбъектов.Вставить(ПолноеИмяОбъекта, МассивСсылок);

		КонецЕсли;

		МассивСсылок.Добавить(СтрокаТаблицы.Ссылка);

	КонецЦикла;		//СтрокаТаблицы
	
	Если КэшПоТипамОбъектов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	ТекстЗапросаНачало = "ВЫБРАТЬ РАЗРЕШЕННЫЕ * ИЗ (";
	ТекстЗапросаКонец = ") КАК ПодчиненныеОбъекты УПОРЯДОЧИТЬ ПО ПодчиненныеОбъекты.Дата";

	Запрос = Новый Запрос;
	ТекстЗапроса = "";
	Для Каждого КлючИЗначение Из КэшПоТипамОбъектов Цикл
		
		МассивИмениОбъекта = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КлючИЗначение.Ключ, ".");
		Если МассивИмениОбъекта.Количество() = 2 Тогда
			ИмяОбъекта = МассивИмениОбъекта[1];
		Иначе
			Продолжить;
		КонецЕсли;

		ТекстПоТипуОбъекта = "
		|" + КэшРеквизитовОбъекта[КлючИЗначение.Ключ]["Дата"] + "           КАК Дата,
		|	Ссылка,
		|" + КэшРеквизитовОбъекта[КлючИЗначение.Ключ]["Проведен"] + "       КАК Проведен,
		|	ПометкаУдаления,
		|" + КэшРеквизитовОбъекта[КлючИЗначение.Ключ]["СуммаДокумента"] + " КАК СуммаДокумента,
		|" + КэшРеквизитовОбъекта[КлючИЗначение.Ключ]["Валюта"] + "         КАК Валюта,
		|	#Представление
		|ИЗ
		|	" + КлючИЗначение.Ключ + "
		|ГДЕ
		|	Ссылка В (&" + ИмяОбъекта + ")";
		
		Запрос.УстановитьПараметр(ИмяОбъекта, КлючИЗначение.Значение);
		
		МассивДопРеквизитов = СтруктураПодчиненностиПереопределяемый.МассивРеквизитовОбъектаДляФормированияПредставления(ИмяОбъекта);
		ДополнитьТекстЗапросаПоРеквизитамОбъекта(ТекстПоТипуОбъекта, МассивДопРеквизитов);
		
		ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", " ВЫБРАТЬ ", " ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ") + ТекстПоТипуОбъекта;

	КонецЦикла;		//КлючИЗначение

	Запрос.Текст = ТекстЗапросаНачало + ТекстЗапроса + ТекстЗапросаКонец;
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		
		Если ( ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка._ЗаявкаНаДоставку") ) Тогда
			
			СтруктураПоиска = Новый Структура("ЗаказКлиента, НужныДокументы", ТекущийОбъект, Истина);
			МассивНайденныхСтрок  = Выборка.Ссылка.Заказы.НайтиСтроки(СтруктураПоиска);
			 Если МассивНайденныхСтрок.Количество() = 0 Тогда
			 	Продолжить;
			 КонецЕсли; 
			
		КонецЕсли;
		Если ( Выборка.Ссылка.Проведен) И  		//** 
			 ( ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ
			   ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.СчетФактураВыданный") ) Тогда
			 
			НоваяСтрока = ТаблицаДокументов.Добавить();
			НоваяСтрока.Документ = Выборка.Ссылка;
			
		КонецЕсли;
		
	КонецЦикла;

	Возврат ТаблицаДокументов;
	
КонецФункции // ВывестиСтруктуруПодчиненности(ТекСтрока.Распоряжение);()

&НаСервере
Функция ВыборДокументовДляПечатиУПД(Объект) Экспорт
	
	ТоварыПоРаспоряжениям		= Объект.ТоварыПоРаспоряжениям;
	ОтгружаемыеТовары			= Объект.ОтгружаемыеТовары;
	
	ТаблицаДокументов			= Новый ТаблицаЗначений;
	ТаблицаДокументов.Колонки.Добавить("Документ");
	
	Для Каждого ТекСтрока Из ТоварыПоРаспоряжениям Цикл
		
		СтруктураПоиска		= Новый Структура("Номенклатура, Характеристика, Назначение, Серия, Действие");
		СтруктураПоиска.Вставить("Номенклатура", ТекСтрока.Номенклатура);
		СтруктураПоиска.Вставить("Характеристика", ТекСтрока.Характеристика);
		СтруктураПоиска.Вставить("Назначение", ТекСтрока.Назначение);
		СтруктураПоиска.Вставить("Серия", ТекСтрока.Серия);
		СтруктураПоиска.Вставить("Действие", Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить);
		
		НайденныеСтроки		= ОтгружаемыеТовары.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаВыборки		= ТаблицаДокументов;
		ТаблицаВыборки.Очистить();
		ВыбранныеДокументы	= ВывестиСтруктуруПодчиненности(ТекСтрока.Распоряжение, ТаблицаВыборки);
		
		//Для Каждого СтрокаДок Из ВыбранныеДокументы Цикл
		//	НовСтрока		= ТаблицаДокументов.Добавить();
		//	ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаДок);
		//КонецЦикла;		// СтрокаДок
		
	КонецЦикла;		// ТекСтрока
	
	Возврат _ДоработкиСлужебный.ПреобразоватьТаблицуЗначенийВМассив(ТаблицаДокументов);	
	
КонецФункции	// ПечатьУПД()

// Функция находит счета-фактуры заданного документа.
//
// Параметры:
//	Основание - ДокументСсылка - Документ, для которого необходимо найти счет-фактуру
//	ПараметрыОтбора - Структура - Отбор счетов-фактуры по реквизитам. Ключ структуры является именем реквизита.
//	РеквизитыСчетаФактуры - Структура - Возвращаемый. Данные счета-фактуры (Ссылка, Номер, Дата, Организация, Валюта и т.д.).
//	Проведен - Булево - Если признак установлен в значение Истина, то будет произведен поиск только проведенных.
//
// Возвращаемое значение:
//	ТаблицаЗначений - Таблица найденных счетов-фактур (Ссылка, Номер, Дата, Организация, Валюта)
//
&НаСервере
Функция СчетаФактурыПоОснованию(Основание, ПараметрыОтбора = Неопределено, РеквизитыСчетаФактуры = Неопределено, Проведен = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	СчетФактура.Ссылка                    КАК Ссылка,
	|	СчетФактура.Номер                     КАК Номер,
	|	СчетФактура.Дата                      КАК Дата,
	|	СчетФактура.Организация               КАК Организация,
	|	СчетФактура.Контрагент                КАК Контрагент,
	|	СчетФактура.КППКонтрагента            КАК КППКонтрагента,
	|	СчетФактура.Валюта                    КАК Валюта,
	|	СчетФактура.Проведен                  КАК Проведен,
	|	СчетФактура.Корректировочный          КАК Корректировочный,
	|	СчетФактура.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта,
	|
	|	СчетФактураДокументыОснования.НомерИсходногоДокумента            КАК НомерИсходногоДокумента,
	|	СчетФактураДокументыОснования.ДатаИсходногоДокумента             КАК ДатаИсходногоДокумента,
	|	СчетФактураДокументыОснования.НомерИсправленияИсходногоДокумента КАК НомерИсправленияИсходногоДокумента,
	|	СчетФактураДокументыОснования.ДатаИсправленияИсходногоДокумента  КАК ДатаИсправленияИсходногоДокумента
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураДокументыОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактура
	|		ПО СчетФактураДокументыОснования.Ссылка = СчетФактура.Ссылка
	|ГДЕ
	|	СчетФактураДокументыОснования.ДокументОснование = &Основание
	|	И (НЕ СчетФактура.ПометкаУдаления)
	|	//УсловияОтбора
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетФактура.НомерИсправления УБЫВ
	|");
	
	Запрос.УстановитьПараметр("Основание",   Основание);
	
	Если ПараметрыОтбора <> Неопределено Тогда
		
		ТекстУсловий = "";
		
		Для Каждого ЭлементОтбора Из ПараметрыОтбора Цикл
			ТекстУсловий = ТекстУсловий + "
			|	И СчетФактура." + ЭлементОтбора.Ключ + " = &" + ЭлементОтбора.Ключ;
			Запрос.УстановитьПараметр(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
		КонецЦикла;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УсловияОтбора", ТекстУсловий);
		
	КонецЕсли;
	
	Если Проведен Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"(НЕ СчетФактура.ПометкаУдаления)",
			"СчетФактура.Проведен");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РеквизитыСчетаФактуры = Новый Структура;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		РеквизитыСчетаФактуры.Вставить(Колонка.Имя);
	КонецЦикла;
	
	ТаблицаСчетовФактур = Новый ТаблицаЗначений;
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ТаблицаСчетовФактур = РезультатЗапроса.Выгрузить();
		ЗаполнитьЗначенияСвойств(РеквизитыСчетаФактуры, ТаблицаСчетовФактур[0]);
	КонецЕсли;
	
	Возврат ТаблицаСчетовФактур;
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуСФ(МассивДокументов)
	
	Перем РеквизитыСчетаФактуры;
	
	мТаблицаСчетовФактур = Новый ТаблицаЗначений;
	
	Для Каждого ТекДокумент Из МассивДокументов Цикл
		
		ПараметрыОтбора = Новый Структура("Организация", ТекДокумент.Организация);
		мТаблицаСФ = СчетаФактурыПоОснованию(ТекДокумент, ПараметрыОтбора, РеквизитыСчетаФактуры, Истина);  
		Если мТаблицаСФ.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если мТаблицаСчетовФактур.Количество() = 0 Тогда
			мТаблицаСчетовФактур = мТаблицаСФ;
		Иначе
			Для Каждого СтрокаСФ Из мТаблицаСФ Цикл
				НоваяСтрокаСФ = мТаблицаСчетовФактур.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаСФ, СтрокаСФ);
			КонецЦикла;		// СтрокаСФ
		КонецЕсли;
	КонецЦикла;		// ТекДокумент 
	
	Возврат мТаблицаСчетовФактур 
	
КонецФункции	// ПолучитьМассивСФ()

&НаСервере
Функция ПечатьУПД(МассивДокументов) Экспорт
	
	ТаблицаСчетовФактур = Новый ТаблицаЗначений;
	
	ТаблицаСФ = ПолучитьТаблицуСФ(МассивДокументов);
	
	Если ТаблицаСчетовФактур.Количество() = 0 Тогда
		ТаблицаСчетовФактур = ТаблицаСФ;
	Иначе
		Для Каждого СтрокаСФ Из ТаблицаСФ Цикл
			НоваяСтрокаСФ = ТаблицаСчетовФактур.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСФ, СтрокаСФ);
		КонецЦикла;		// СтрокаСФ
	КонецЕсли;
	
	Если ТаблицаСчетовФактур.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='В Заявке на доставку нет отметок 'Нужны документы' или нет счет-фактур для вывода на печать'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	МассивСчетовФактур = _ДоработкиСлужебный.ПреобразоватьТаблицуЗначенийВМассив(ТаблицаСчетовФактур);
	АдресХранилища = ПоместитьВоВременноеХранилище(МассивСчетовФактур);
	
	Возврат АдресХранилища;
	
КонецФункции // ОткрытьВыборДокументовНаСервере()

#КонецОбласти
 

#Область ЗаданиеНаПеревозку

&НаСервере
Функция СоздатьЗаданиеНаПеревозкуПоРасходномуОрдеру(Объект, ДатаОтгрузки) Экспорт
	
	ТоварыПоРаспоряжениям		= Объект.ТоварыПоРаспоряжениям;
	ОтгружаемыеТовары			= Объект.ОтгружаемыеТовары;
	ДокументОснование			= Документы.ЗаказКлиента.ПустаяСсылка();
	
	ТоварыПоРаспоряжениям		= Объект.ТоварыПоРаспоряжениям;
	ОтгружаемыеТовары			= Объект.ОтгружаемыеТовары;
	ДокументОснование			= Документы.ЗаказКлиента.ПустаяСсылка();
	

	Если ТоварыПоРаспоряжениям.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Задание на перевозку не создано, в расходном ордере на товары отсутствуют распоряжения'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат (Документы.ЗаданиеНаПеревозку.СоздатьДокумент());
	КонецЕсли;  
	
	ЗаданиеНаПеревозку = СоздатьНовоеЗаданиеНаПеревозку(ДатаОтгрузки);
	//ЗаданиеНаПеревозку.Дата					= ТекущаяДата();
	//ЗаданиеНаПеревозку.ДатаВремяРейсаПланС	= ДатаОтгрузки;
	//ЗаданиеНаПеревозку.ДатаВремяРейсаПланПо	= ДатаОтгрузки;
	
	Для Каждого ТекСтрока Из ТоварыПоРаспоряжениям Цикл
		
		Если НЕ ДокументОснование = ТекСтрока.Распоряжение Тогда
			
			СтруктураПоиска		 = Новый Структура("Номенклатура, Характеристика, Назначение, Серия, Действие");
			СтруктураПоиска.Вставить("Номенклатура", ТекСтрока.Номенклатура);
			СтруктураПоиска.Вставить("Характеристика", ТекСтрока.Характеристика);
			СтруктураПоиска.Вставить("Назначение", ТекСтрока.Назначение);
			СтруктураПоиска.Вставить("Серия", ТекСтрока.Серия);
			СтруктураПоиска.Вставить("Действие", Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить);
			
			НайденныеСтроки		 = ОтгружаемыеТовары.НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументОснование = ТекСтрока.Распоряжение;
			
			ЗаполнитьЗаданиеНаПеревозку(Объект, ЗаданиеНаПеревозку, ДокументОснование, ДатаОтгрузки);
			
		КонецЕсли;		//НЕ ДокументОснование = ТекСтрока.Распоряжение 
	КонецЦикла;		// ТекСтрока Из ТоварыПоРаспоряжениям
	
	Если НЕ ЗаданиеНаПеревозку.Маршрут.Количество() = 0 Тогда
		ЗаданиеНаПеревозку.Записать(РежимЗаписиДокумента.Проведение);
		Возврат ЗаданиеНаПеревозку.Ссылка;
	Иначе
		
		Возврат Документы.ЗаданиеНаПеревозку.ПустаяСсылка();
	КонецЕсли; 
	
КонецФункции	// СоздатьЗаданиеНаПеревозкуПоРасходномуОрдеру(ЭтотОбъект.ТекущийЭлемент.ТекущаяСтрока.Ссылка)()


&НаСервере
Функция СоздатьНовоеЗаданиеНаПеревозку(ДатаОтгрузки)
	
	НовоеЗаданиеНаПеревозку							= Документы.ЗаданиеНаПеревозку.СоздатьДокумент(); 
	НовоеЗаданиеНаПеревозку.Дата					= ТекущаяДата();
	НовоеЗаданиеНаПеревозку.ДатаВремяРейсаПланС		= ДатаОтгрузки;
	НовоеЗаданиеНаПеревозку.ДатаВремяРейсаПланПо	= ДатаОтгрузки;
//	НовоеЗаданиеНаПеревозку.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат НовоеЗаданиеНаПеревозку;
	
КонецФункции // СоздатьНовоеЗаданиеНаПеревозку()

&НаСервере
Процедура ЗаполнитьЗаданиеНаПеревозку(Ордер, ЗаданиеНаПеревозку, ДокРаспоряжение, ДатаОтгрузки)
	
	 ВремяОтгрузки	  = ДатаОтгрузки - НачалоДня(ДатаОтгрузки);
	 ВремяДоставкиС	  = ДокРаспоряжение.ВремяДоставкиС - НачалоДня(ДокРаспоряжение.ВремяДоставкиС);
	 ВремяДоставкиПо  = ДокРаспоряжение.ВремяДоставкиПо - НачалоДня(ДокРаспоряжение.ВремяДоставкиПо);
	 ВремяРейсаПланС  = ЗаданиеНаПеревозку.ДатаВремяРейсаПланС - НачалоДня(ЗаданиеНаПеревозку.ДатаВремяРейсаПланС);
	 ВремяРейсаПланПо = ЗаданиеНаПеревозку.ДатаВремяРейсаПланС - НачалоДня(ЗаданиеНаПеревозку.ДатаВремяРейсаПланС);
	 
	 Если ВремяРейсаПланС = 0 Тогда
	 	ЗаданиеНаПеревозку.ДатаВремяРейсаПланС = НачалоДня(ЗаданиеНаПеревозку.ДатаВремяРейсаПланС) + ВремяДоставкиС;
	 ИначеЕсли ВремяРейсаПланС > ВремяДоставкиС Тогда
	 	ЗаданиеНаПеревозку.ДатаВремяРейсаПланС = НачалоДня(ЗаданиеНаПеревозку.ДатаВремяРейсаПланС) + ВремяДоставкиС;
	 КонецЕсли;
	 
	 Если ВремяРейсаПланПо = 0 Тогда
	 	ЗаданиеНаПеревозку.ДатаВремяРейсаПланПо = НачалоДня(ЗаданиеНаПеревозку.ДатаВремяРейсаПланПо) + ВремяДоставкиПо;
	 ИначеЕсли ВремяРейсаПланС < ВремяДоставкиПо Тогда
	 	ЗаданиеНаПеревозку.ДатаВремяРейсаПланПо = НачалоДня(ЗаданиеНаПеревозку.ДатаВремяРейсаПланПо) + ВремяДоставкиПо;
	 КонецЕсли;
	 
	 ЗаданиеНаПеревозку.ЗаданиеВыполняет		= Перечисления.ТипыИсполнителейЗаданийНаПеревозку.НашаТранспортнаяСлужба;
	 ЗаданиеНаПеревозку.ЛицензионнаяКарточкаВид	= "Стандартная";
	 ЗаданиеНаПеревозку.Операция				= Перечисления.ВидыДоставки.СоСклада;
	 ЗаданиеНаПеревозку.Ответственный			= Ордер.Ответственный;
	 ЗаданиеНаПеревозку.Приоритет				= Справочники.Приоритеты.ПолучитьПриоритетПоУмолчанию(ЗаданиеНаПеревозку.Приоритет);
	 ЗаданиеНаПеревозку.Склад					= Ордер.Склад;
	 ЗаданиеНаПеревозку.Статус					= Перечисления.СтатусыЗаданийНаПеревозку.Формируется;
	 ЗаданиеНаПеревозку.ТранспортноеСредство	= Ордер._СпособДоставки;
	 
	 Распоряжения								= ЗаданиеНаПеревозку.Распоряжения;
	 Маршрут									= ЗаданиеНаПеревозку.Маршрут;
	 
	 
	 
	 
	 СтрокаРаспоряжения = Распоряжения.Найти(ДокРаспоряжение.Ссылка, "Распоряжение");
	 Если СтрокаРаспоряжения = Неопределено Тогда
		КлючСвязи								= Новый УникальныйИдентификатор();
	Иначе
		КлючСвязи								= СтрокаРаспоряжения.КлючСвязи;
	КонецЕсли;
	
	НовоеРаспоряжение							= Распоряжения.Добавить();
	НовоеРаспоряжение.Распоряжение				= ДокРаспоряжение.Ссылка;
	НовоеРаспоряжение.КлючСвязи					= КлючСвязи;
	НовоеРаспоряжение.ВремяС					= ВремяДоставкиС;
	НовоеРаспоряжение.ВремяПо					= ВремяДоставкиПо;
	НовоеРаспоряжение.Склад						= ДокРаспоряжение.Склад;
	НовоеРаспоряжение.ДоставляетсяПолностью 	= ДокРаспоряжение.НеОтгружатьЧастями;
	НовоеРаспоряжение.Перевозчик				= Справочники.Партнеры.ПустаяСсылка();
	НовоеРаспоряжение.ПолучательОтправитель		= ДокРаспоряжение.Партнер;
	
	
	СтрокаМаршрута								= Маршрут.Найти(КлючСвязи, "КлючСвязи");
	 Если СтрокаМаршрута = Неопределено Тогда
	 	НовыйМаршрут							= Маршрут.Добавить();
		НовыйМаршрут.КлючСвязи					= КлючСвязи;
		НовыйМаршрут.ВремяС                     = НачалоДня(ЗаданиеНаПеревозку.ДатаВремяРейсаПланС) + ВремяДоставкиС;
		НовыйМаршрут.ВремяПо                    = НачалоДня(ЗаданиеНаПеревозку.ДатаВремяРейсаПланПо) + ВремяДоставкиПо;
		НовыйМаршрут.Адрес						= ДокРаспоряжение.АдресДоставки;
		НовыйМаршрут.Зона						= ДокРаспоряжение.ЗонаДоставки;
	 КонецЕсли;
	 
	 //ЗаданиеНаПеревозку.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры	// ЗаполнитьЗаданиеНаПеревозку(ЗаданиеНаПеревозку, ТекДокументОснование, ДатаОтгрузки)()


#КонецОбласти


#Область ДополнительныеФункции

&НаСервере
Функция ПолучитьВариантОбеспечения() Экспорт
	НеОбеспечивать = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.НеТребуется");
	Возврат НеОбеспечивать;
КонецФункции // ПолучитьВариантОбеспечения()

#КонецОбласти
   
#Область СозданиеРасходныхОрдеровНаТавары

//++ 13.03.2025 Ниронов
Процедура ПерезаполнитьТабличныеЧастиРО(ЗаявкаНаДоставку, РасходныйОрдерОбъект)
	
	Заказы = РасходныйОрдерОбъект.ТоварыПоРаспоряжениям.ВыгрузитьКолонку("Распоряжение");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	_ЗаявкаНаДоставку_ТоварыТ.Номенклатура КАК Номенклатура,
	|	_ЗаявкаНаДоставку_ТоварыТ.Характеристика КАК Характеристика,
	|	НазначенияТ.Ссылка КАК Назначение,
	|	_ЗаявкаНаДоставку_ТоварыТ.Серия КАК Серия,
	|	_ЗаявкаНаДоставку_ТоварыТ.Количество КАК Количество,
	|	_ЗаявкаНаДоставку_ТоварыТ.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ЗаказКлиента_ТоварыТ.Ссылка КАК Распоряжение,
	|	ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиОрдеровНаОтгрузку.Отобрать) КАК Действие
	|ИЗ
	|	Документ._ЗаявкаНаДоставку.Товары КАК _ЗаявкаНаДоставку_ТоварыТ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиента_ТоварыТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК НазначенияТ
	|		ПО ЗаказКлиента_ТоварыТ.Ссылка = НазначенияТ.Заказ
	|			И НазначенияТ.ПометкаУдаления = ЛОЖЬ
	|	ПО _ЗаявкаНаДоставку_ТоварыТ._УИДОтгрузка = ЗаказКлиента_ТоварыТ._УИДОтгрузка
	|ГДЕ _ЗаявкаНаДоставку_ТоварыТ.Ссылка = &ЗаявкаНаДоставку
	|	И ЗаказКлиента_ТоварыТ.Ссылка В (&Заказы)
	|";
	Запрос.Параметры.Вставить("ЗаявкаНаДоставку", ЗаявкаНаДоставку);
	Запрос.Параметры.Вставить("Заказы", Заказы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РасходныйОрдерОбъект.ТоварыПоРаспоряжениям.Очистить();
	РасходныйОрдерОбъект.ОтгружаемыеТовары.Очистить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НС = РасходныйОрдерОбъект.ТоварыПоРаспоряжениям.Добавить();
		ЗаполнитьЗначенияСвойств(НС, ВыборкаДетальныеЗаписи);
		НС = РасходныйОрдерОбъект.ОтгружаемыеТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НС, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры //--

&НаСервере
Процедура ОформитьРасходныеОрдераПоДоставкеНаСервере(МассивРаспоряжений, ЗаявкаНаДоставку, НовыйОрдер = Истина) Экспорт
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	РасходныйОрдерНаТовары.Ссылка КАК Ссылка,
	//|	РасходныйОрдерНаТовары._ЗаявкаНаДоставку КАК _ЗаявкаНаДоставку
	//|ИЗ
	//|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	//|ГДЕ
	//|	НЕ РасходныйОрдерНаТовары.ПометкаУдаления
	//|	И РасходныйОрдерНаТовары.Проведен
	//|	И РасходныйОрдерНаТовары._ЗаявкаНаДоставку = &_ЗаявкаНаДоставку";
	//
	//Запрос.УстановитьПараметр("_ЗаявкаНаДоставку", ЗаявкаНаДоставку);
	//
	//Результат = Запрос.Выполнить();
	//Если НЕ Результат.Пустой() Тогда
	//	ТекстСообщения = НСтр("ru='По данной заявке уже создан расходный ордер №'") + РасходныйОрдерОбъект.Номер +  НСтр("ru=' от '") + РасходныйОрдерОбъект.Дата;
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	//	Возврат;
	//КонецЕсли;
	
	ПараметрыПереоформленияРасходныхОрдеров = СкладыСервер.ПараметрыПереоформленияРасходныхОрдеров();
		
	Запрос = Новый Запрос;
	Запрос.Текст =	
	
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.ЗаказНаВнутреннееПотребление КАК ДокументОтгрузки,
	|	ДокументТовары.Ссылка.Склад КАК Склад
	|ПОМЕСТИТЬ ДокументыОтгрузки
	|ИЗ
	|	Документ.ВнутреннееПотребление.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка В(&МассивРаспоряжений)
	|	И ДокументТовары.Ссылка.ПотреблениеПоЗаказам
	|	И ДокументТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка,
	|	ДокументТовары.Склад
	|ИЗ
	|	Документ.ВнутреннееПотребление КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка В(&МассивРаспоряжений)
	|	И ДокументТовары.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка,
	|	ДокументТовары.Склад
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка В(&МассивРаспоряжений)
	|	И ДокументТовары.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.ЗаказНаПеремещение,
	|	ДокументТовары.Ссылка.СкладОтправитель
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка В(&МассивРаспоряжений)
	|	И ДокументТовары.Ссылка.ПеремещениеПоЗаказам
	|	И ДокументТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка,
	|	ДокументТовары.СкладОтправитель
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка В(&МассивРаспоряжений)
	|	И ДокументТовары.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка,
	|	ДокументТовары.СкладОтправитель
	|ИЗ
	|	Документ.ЗаказНаПеремещение КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка В(&МассивРаспоряжений)
	|	И ДокументТовары.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.ЗаказКлиента,
	|	ДокументТовары.Склад
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка В(&МассивРаспоряжений)
	|	И ДокументТовары.Ссылка.РеализацияПоЗаказам
	|	И ДокументТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка,
	|	ДокументТовары.Склад
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка В(&МассивРаспоряжений)
	|	И ДокументТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка,
	|	ДокументТовары.Склад
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка В(&МассивРаспоряжений)
	|	И ДокументТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка,
	|	ДокументТовары.Склад
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка В(&МассивРаспоряжений)
	|	И ДокументТовары.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Документ.ЗаказНаСборку,
	|	Документ.Склад
	|ИЗ
	|	Документ.СборкаТоваров КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивРаспоряжений)
	|	И Документ.ЗаказНаСборку <> ЗНАЧЕНИЕ(Документ.ЗаказНаСборку.ПустаяСсылка)
	|	И Документ.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Документ.Ссылка,
	|	Документ.Склад
	|ИЗ
	|	Документ.СборкаТоваров КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивРаспоряжений)
	|	И Документ.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка,
	|	ДокументТовары.Склад
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка В(&МассивРаспоряжений)
	|	И ДокументТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Документ.Ссылка,
	|	Документ.Склад
	|ИЗ
	|	Документ.ЗаказНаСборку КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивРаспоряжений)
	|	И Документ.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка,
	|	ДокументТовары.Склад
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка В(&МассивРаспоряжений)
	|	И ДокументТовары.Ссылка.Проведен
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка КАК ЗаданиеНаПеревозку,
	|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение КАК ДокументОтгрузки,
	|	ЗаданиеНаПеревозкуРаспоряжения.Склад КАК Склад
	|ПОМЕСТИТЬ ДокументыОтгрузкиЗаданияНаПерервозку
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	|ГДЕ
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка В(&МассивРаспоряжений)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗНАЧЕНИЕ(Документ.ЗаданиеНаПеревозку.ПустаяСсылка) КАК ЗаданиеНаПеревозку,
	|	ТоварыКОтгрузке.Склад КАК Склад,
	|	ТоварыКОтгрузке.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ТоварыКОтгрузке.Получатель КАК Получатель,
	|	ЕСТЬNULL(РеквизитыРаспоряжения.ДатаДокументаИБ, ДАТАВРЕМЯ(1,1,1)) КАК Дата
	|ПОМЕСТИТЬ ДанныеДляПереоформленияОрдеров
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыОтгрузки КАК ДокументыОтгрузки
	|		ПО ТоварыКОтгрузке.ДокументОтгрузки = ДокументыОтгрузки.ДокументОтгрузки
	|			И ТоварыКОтгрузке.Склад = ДокументыОтгрузки.Склад
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеквизитыРаспоряжения
	|			ПО ТоварыКОтгрузке.ДокументОтгрузки = РеквизитыРаспоряжения.Ссылка
	|				И НЕ РеквизитыРаспоряжения.ДополнительнаяЗапись
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыОтгрузкиЗаданияНаПерервозку.ЗаданиеНаПеревозку,
	|	ТоварыКОтгрузке.Склад,
	|	ТоварыКОтгрузке.ДокументОтгрузки,
	|	ТоварыКОтгрузке.Получатель,
	|	ДокументыОтгрузкиЗаданияНаПерервозку.ЗаданиеНаПеревозку.ДатаВремяРейсаПланС
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыОтгрузкиЗаданияНаПерервозку КАК ДокументыОтгрузкиЗаданияНаПерервозку
	|		ПО ТоварыКОтгрузке.ДокументОтгрузки = ДокументыОтгрузкиЗаданияНаПерервозку.ДокументОтгрузки
	|			И ТоварыКОтгрузке.Склад = ДокументыОтгрузкиЗаданияНаПерервозку.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныДляПереофрмленияОррдеров.ЗаданиеНаПеревозку,
	|	ДанныДляПереофрмленияОррдеров.Склад,
	|	ДанныДляПереофрмленияОррдеров.ДокументОтгрузки,
	|	ДанныДляПереофрмленияОррдеров.Получатель
	|ИЗ
	|	ДанныеДляПереоформленияОрдеров КАК ДанныДляПереофрмленияОррдеров
	|ГДЕ
	|	ДанныДляПереофрмленияОррдеров.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
	|	И ДанныДляПереофрмленияОррдеров.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= ДанныДляПереофрмленияОррдеров.Дата";
	
	Запрос.УстановитьПараметр("МассивРаспоряжений", МассивРаспоряжений);
	
	УстановитьПривилегированныйРежим(Истина);
	ЗапросПакет = Запрос.ВыполнитьПакет();
	Выборка = ЗапросПакет[3].Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	СоздатьОрдера = Ложь; 
	
	Если НовыйОрдер Тогда
		// Заполняем таблицу созданных документов для перезапонлнения
		СозданныеРасходныеОрдера = Новый ТаблицаЗначений;
		СозданныеРасходныеОрдера.Колонки.Добавить("ДокументОбъект",Новый ОписаниеТипов("ДокументОбъект.РасходныйОрдерНаТовары"));
		СозданныеРасходныеОрдера.Колонки.Добавить("Использован",Новый ОписаниеТипов("Булево"));
		
		ПараметрыПереоформленияРасходныхОрдеров.Вставить("СозданныеРасходныеОрдера", СозданныеРасходныеОрдера);
	КонецЕсли;
	
	Пока Выборка.СледующийПоЗначениюПоля("ЗаданиеНаПеревозку") Цикл
		
		ПараметрыПереоформленияРасходныхОрдеров.ЗаданиеНаПеревозку = Выборка.ЗаданиеНаПеревозку;
		
		Пока Выборка.СледующийПоЗначениюПоля("Склад") Цикл		
			
			СоздатьОрдера = Истина;
			
			ПараметрыПереоформленияРасходныхОрдеров.Склад = Выборка.Склад;
			
			Пока Выборка.СледующийПоЗначениюПоля("Получатель") Цикл	
				
				ПараметрыПереоформленияРасходныхОрдеров.Получатель = Выборка.Получатель;
				
				Распоряжения = Новый Массив;
				Пока Выборка.Следующий() Цикл
					Распоряжения.Добавить(Выборка.ДокументОтгрузки);
				КонецЦикла;
				
				ПараметрыПереоформленияРасходныхОрдеров.РаспоряженияНаОтгрузку = Распоряжения;		
				
				СтруктураЗадания = СкладыСервер.ПереоформитьРасходныеОрдера(ПараметрыПереоформленияРасходныхОрдеров);
				Для Каждого ОформленныеОрдераСтрока Из СтруктураЗадания.ОформленныеОрдера Цикл
					Если НовыйОрдер Тогда
						РасходныйОрдерОбъект				   = ОформленныеОрдераСтрока.РасходныйОрдер.ПолучитьОбъект();
						РасходныйОрдерОбъект.Статус			   = Перечисления.СтатусыРасходныхОрдеров.КОтбору;
						РасходныйОрдерОбъект.ДатаОтгрузки	   = ЗаявкаНаДоставку.ЖелаемаяДатаОтгрузки;
						РасходныйОрдерОбъект._ЗаявкаНаДоставку = ЗаявкаНаДоставку;
						РасходныйОрдерОбъект.Комментарий	   = ЗаявкаНаДоставку.Комментарий;
						
						//***************************************************************
						//ИЗМЕНЕНО Стефутин В.П. 15.10.2023
						Если ( Не ПустаяСтрока(ЗаявкаНаДоставку.ОсобыеУсловияПеревозкиОписание) ) Тогда
							//РасходныйОрдерОбъект.Комментарий = РасходныйОрдерОбъект.Комментарий + Символы.ПС +
							//									ЗаявкаНаДоставку.ОсобыеУсловияПеревозкиОписание;
							РасходныйОрдерОбъект.Комментарий = 
								?(ЗначениеЗаполнено(СокрЛП(РасходныйОрдерОбъект.Комментарий)), 
								СокрЛП(РасходныйОрдерОбъект.Комментарий) + Символы.ПС + СокрЛП(ЗаявкаНаДоставку.ОсобыеУсловияПеревозкиОписание),
								СокрЛП(ЗаявкаНаДоставку.ОсобыеУсловияПеревозкиОписание));
						КонецЕсли;
						//***************************************************************
						
						//++ 13.03.2025 Ниронов
						ПерезаполнитьТабличныеЧастиРО(ЗаявкаНаДоставку, РасходныйОрдерОбъект);
						
						Попытка
							РасходныйОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
						Исключение
							РасходныйОрдерОбъект.Записать(РежимЗаписиДокумента.Запись);
						КонецПопытки;
						//-- 13.03.2025
						
						РасходныйОрдерОбъект.Записать();
					КонецЕсли; 
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
	Если НЕ СоздатьОрдера Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru='По выбранным распоряжениям не требуется отгрузка товаров.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		Если ( РасходныйОрдерОбъект <> Неопределено ) Тогда
			ТекстСообщения = НСтр("ru='Создан расходный ордер №'") + РасходныйОрдерОбъект.Номер +  НСтр("ru=' от '") + РасходныйОрдерОбъект.Дата;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка создания расходного ордера");
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область РабочийСтолДоставки

&НаСервере
Функция ТекстЗапросаПоРасходнымОрдерам()
	
	ТекстЗапроса ="ВЫБРАТЬ
	              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ордер,
	              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ДатаОтгрузки КАК Дата,
	              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
	              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика КАК Характеристика,
	              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Назначение КАК Назначение,
	              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Серия КАК Серия,
	              |	РасходныйОрдерНаТоварыОтгружаемыеТовары.КоличествоУпаковок КАК Количество,
	              |	0 КАК Вес,
	              |	0 КАК Объем,
	              |	РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.Склад КАК Склад,
	              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение,
	              |	РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.Получатель КАК ПолучательОтправитель,
	              |	ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) КАК ВидРаспоряжения,
	              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.Номер КАК Номер,
	              |	ВЫБОР
	              |		КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._ЗаявкаНаДоставку = ЗНАЧЕНИЕ(Документ._ЗаявкаНаДоставку.ПустаяСсылка)
	              |			ТОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.АдресДоставки
	              |		ИНАЧЕ РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка._ЗаявкаНаДоставку.АдресДоставки
	              |	КОНЕЦ КАК Адрес,
	              |	ВЫБОР
	              |		КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._ЗаявкаНаДоставку = ЗНАЧЕНИЕ(Документ._ЗаявкаНаДоставку.ПустаяСсылка)
	              |			ТОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.АдресДоставкиЗначенияПолей
	              |		ИНАЧЕ РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка._ЗаявкаНаДоставку.АдресДоставкиЗначенияПолей
	              |	КОНЕЦ КАК АдресЗначенияПолей,
	              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._СпособДоставки КАК ТипТранспортногоСредства,
	              |	ВЫБОР
	              |		КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._ЗаявкаНаДоставку = ЗНАЧЕНИЕ(Документ._ЗаявкаНаДоставку.ПустаяСсылка)
	              |			ТОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ЗонаДоставки
	              |		ИНАЧЕ РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка._ЗаявкаНаДоставку.ЗонаДоставки
	              |	КОНЕЦ КАК Зона,
	              |	ВЫБОР
	              |		КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._ЗаявкаНаДоставку = ЗНАЧЕНИЕ(Документ._ЗаявкаНаДоставку.ПустаяСсылка)
	              |			ТОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ЗонаДоставки.Представление
	              |		ИНАЧЕ РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка._ЗаявкаНаДоставку.ЗонаДоставки.Представление
	              |	КОНЕЦ КАК ЗонаПредставление,
	              |	ВЫБОР
	              |		КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._ЗаявкаНаДоставку = ЗНАЧЕНИЕ(Документ._ЗаявкаНаДоставку.ПустаяСсылка)
	              |			ТОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ВремяДоставкиС
	              |		ИНАЧЕ РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка._ЗаявкаНаДоставку.ВремяДоставкиС
	              |	КОНЕЦ КАК ВремяС,
	              |	ВЫБОР
	              |		КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._ЗаявкаНаДоставку = ЗНАЧЕНИЕ(Документ._ЗаявкаНаДоставку.ПустаяСсылка)
	              |			ТОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ВремяДоставкиПо
	              |		ИНАЧЕ РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка._ЗаявкаНаДоставку.ВремяДоставкиПо
	              |	КОНЕЦ КАК ВремяПо,
	              |	ВЫБОР
	              |		КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._ЗаявкаНаДоставку = ЗНАЧЕНИЕ(Документ._ЗаявкаНаДоставку.ПустаяСсылка)
	              |			ТОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ДополнительнаяИнформацияПоДоставке
	              |		ИНАЧЕ РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка._ЗаявкаНаДоставку.ДополнительнаяИнформацияПоДоставке
	              |	КОНЕЦ КАК ДополнительнаяИнформация,
	              |	ВЫБОР
	              |		КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._ЗаявкаНаДоставку = ЗНАЧЕНИЕ(Документ._ЗаявкаНаДоставку.ПустаяСсылка)
	              |			ТОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ОсобыеУсловияПеревозки
	              |		ИНАЧЕ РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка._ЗаявкаНаДоставку.ОсобыеУсловияПеревозки
	              |	КОНЕЦ КАК ОсобыеУсловияПеревозки,
	              |	ВЫБОР
	              |		КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._ЗаявкаНаДоставку = ЗНАЧЕНИЕ(Документ._ЗаявкаНаДоставку.ПустаяСсылка)
	              |			ТОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ОсобыеУсловияПеревозкиОписание
	              |		ИНАЧЕ РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка._ЗаявкаНаДоставку.ОсобыеУсловияПеревозкиОписание
	              |	КОНЕЦ КАК ОсобыеУсловияПеревозкиОписание,
	              |	ВЫБОР
	              |		КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._ЗаявкаНаДоставку = ЗНАЧЕНИЕ(Документ._ЗаявкаНаДоставку.ПустаяСсылка)
	              |			ТОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.АдресДоставки
	              |		ИНАЧЕ РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка._ЗаявкаНаДоставку.АдресДоставки
	              |	КОНЕЦ КАК ПолеУпорядочивания,
	              |	ВЫБОР
	              |		КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._ЗаявкаНаДоставку = ЗНАЧЕНИЕ(Документ._ЗаявкаНаДоставку.ПустаяСсылка)
	              |			ТОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.СпособДоставки
	              |		ИНАЧЕ РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка._ЗаявкаНаДоставку.СпособДоставки
	              |	КОНЕЦ КАК СособДоставки,
	              |	ЛОЖЬ КАК МернаяЕдиницаИзмерения,
	              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус КАК Статус,
	              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._НужныДокументы КАК НужныДокументы,
	              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка._ЗаявкаНаДоставку КАК ЗаявкаНаДоставку,
	              |	1 КАК Картинка,
	              |	РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
	              |ИЗ
	              |	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК РасходныйОрдерНаТоварыОтгружаемыеТовары
	              |		ПО РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка = РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка
	              |			И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура = РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура
	              |			И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика = РасходныйОрдерНаТоварыОтгружаемыеТовары.Характеристика
	              |			И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Назначение = РасходныйОрдерНаТоварыОтгружаемыеТовары.Назначение
	              |			И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Серия = РасходныйОрдерНаТоварыОтгружаемыеТовары.Серия
	              |ГДЕ
	              |	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ДатаОтгрузки <= &ДатаОтгрузки
	              |	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус В(&Статус)
	              |	И РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.Склад = &Склад
	              |	И НЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ПометкаУдаления
	              |	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен
	              |	И РасходныйОрдерНаТоварыОтгружаемыеТовары.Действие = &Действие
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Ордер";
	
	Возврат ТекстЗапроса;
				
КонецФункции // ПолучитьДанныеПоОрдеру()

&НаСервере
Функция ТекстЗапросаПоТаблицеДоставок()
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТаблицаДоставки.Дата КАК Дата,
	               |	ТаблицаДоставки.Номенклатура КАК Номенклатура,
	               |	ТаблицаДоставки.МернаяЕдиницаИзмерения КАК МернаяЕдиницаИзмерения,
	               |	ТаблицаДоставки.Характеристика КАК Характеристика,
	               |	ТаблицаДоставки.Назначение КАК Назначение,
	               |	ТаблицаДоставки.Серия КАК Серия,
	               |	ТаблицаДоставки.Количество КАК Количество,
	               |	ТаблицаДоставки.Вес КАК Вес,
	               |	ТаблицаДоставки.Объем КАК Объем,
	               |	ТаблицаДоставки.Склад КАК Склад,
	               |	ТаблицаДоставки.Распоряжение КАК Распоряжение,
	               |	ТаблицаДоставки.ПолучательОтправитель КАК ПолучательОтправитель,
	               |	ТаблицаДоставки.Номер КАК Номер,
	               |	ТаблицаДоставки.Адрес КАК Адрес,
	               |	ТаблицаДоставки.АдресЗначенияПолей КАК АдресЗначенияПолей,
	               |	ТаблицаДоставки.СпособДоставки КАК СпособДоставки,
	               |	ТаблицаДоставки.Картинка КАК Картинка,
	               |	ТаблицаДоставки.Зона КАК Зона,
	               |	ТаблицаДоставки.ЗонаПредставление КАК ЗонаПредставление,
	               |	ТаблицаДоставки.Перевозчик КАК Перевозчик,
	               |	ТаблицаДоставки.ВремяС КАК ВремяС,
	               |	ТаблицаДоставки.ВремяПо КАК ВремяПо,
	               |	ТаблицаДоставки.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	               |	ТаблицаДоставки.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	               |	ТаблицаДоставки.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	               |	ТаблицаДоставки.ПолеУпорядочивания КАК ПолеУпорядочивания,
	               |	ТаблицаДоставки.ТипТранспортногоСредства КАК ТипТранспортногоСредства,
	               |	ТаблицаДоставки.ЗаявкаНаДоставку КАК ЗаявкаНаДоставку
	               |ПОМЕСТИТЬ ВтДоставки
	               |ИЗ
	               |	&ТаблицаДоставок КАК ТаблицаДоставки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВтДоставки.Дата КАК Дата,
	               |	ВтДоставки.Номенклатура КАК Номенклатура,
	               |	ВтДоставки.МернаяЕдиницаИзмерения КАК МернаяЕдиницаИзмерения,
	               |	ВтДоставки.Характеристика КАК Характеристика,
	               |	ВтДоставки.Назначение КАК Назначение,
	               |	ВтДоставки.Серия КАК Серия,
	               |	ВтДоставки.Количество КАК Количество,
	               |	ВтДоставки.Вес КАК Вес,
	               |	ВтДоставки.Объем КАК Объем,
	               |	ВтДоставки.Склад КАК Склад,
	               |	ВтДоставки.Распоряжение КАК Распоряжение,
	               |	ВтДоставки.ПолучательОтправитель КАК ПолучательОтправитель,
	               |	ВтДоставки.Номер КАК Номер,
	               |	ВтДоставки.Адрес КАК Адрес,
	               |	ВтДоставки.АдресЗначенияПолей КАК АдресЗначенияПолей,
	               |	ВтДоставки.СпособДоставки КАК СпособДоставки,
	               |	ВтДоставки.Картинка КАК Картинка,
	               |	ВтДоставки.Зона КАК Зона,
	               |	ВтДоставки.ЗонаПредставление КАК ЗонаПредставление,
	               |	ВтДоставки.Перевозчик КАК Перевозчик,
	               |	ВтДоставки.ВремяС КАК ВремяС,
	               |	ВтДоставки.ВремяПо КАК ВремяПо,
	               |	ВтДоставки.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	               |	ВтДоставки.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	               |	ВтДоставки.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	               |	ВтДоставки.ПолеУпорядочивания КАК ПолеУпорядочивания,
	               |	ВтДоставки.ТипТранспортногоСредства КАК ТипТранспортногоСредства,
	               |	ВтДоставки.ЗаявкаНаДоставку КАК ЗаявкаНаДоставку
	               |ИЗ
	               |	ВтДоставки КАК ВтДоставки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Зона,
	               |	ПолучательОтправитель,
	               |	Распоряжение,
				   |	ЗаявкаНаДоставку,
	               |	Склад,
	               |	Номенклатура,
	               |	Характеристика,
	               |	Назначение,
	               |	Серия,
	               |	Дата";
	
	Возврат ТекстЗапроса
КонецФункции // ТекстЗапросаПоТаблицеОтгрузки()

Функция ПолучитьПозициюДляВставки(РаспоряженияНаДоставку, ЗонаГруппаИлиПустая, СтрокаИсточник)
	
	Адрес = СтрокаИсточник.Адрес;
	КоллекцияРаспоряжений = РаспоряженияНаДоставку.ПолучитьЭлементы();
	Если ЗонаГруппаИлиПустая Тогда
		Для Каждого СтрокаЗона Из КоллекцияРаспоряжений Цикл
			Если СтрокаИсточник.Зона = СтрокаЗона.Зона Тогда
				Ветка = СтрокаЗона.ПолучитьЭлементы();
				Для Каждого СтрокаРаспоряжение Из Ветка Цикл
					Если Адрес < СтрокаРаспоряжение.Адрес Тогда
						Возврат Новый Структура("Зона, Распоряжение", КоллекцияРаспоряжений.Индекс(СтрокаЗона), Ветка.Индекс(СтрокаРаспоряжение));
					КонецЕсли;
				КонецЦикла;
				Возврат Новый Структура("Зона, Распоряжение", КоллекцияРаспоряжений.Индекс(СтрокаЗона), Макс(0,Ветка.Количество()));
			ИначеЕсли Строка(СтрокаИсточник.Зона) < Строка(СтрокаЗона.Зона) Тогда
				НоваяСтрока = КоллекцияРаспоряжений.Вставить(КоллекцияРаспоряжений.Индекс(СтрокаЗона));
				НоваяСтрока.Зона  = СтрокаИсточник.Зона;
				НоваяСтрока.Адрес = СтрокаИсточник.Зона;
				НоваяСтрока.ОформлениеСтроки = 5;
				Возврат Новый Структура("Зона, Распоряжение", КоллекцияРаспоряжений.Индекс(НоваяСтрока), 0);
			КонецЕсли;
		КонецЦикла;
		НоваяСтрока = КоллекцияРаспоряжений.Добавить();
		НоваяСтрока.Зона  = СтрокаИсточник.Зона;
		НоваяСтрока.Адрес = СтрокаИсточник.Зона;
		НоваяСтрока.ОформлениеСтроки = 5;
		Возврат Новый Структура("Зона, Распоряжение", КоллекцияРаспоряжений.Количество() - 1, 0);
	Иначе
		Для Каждого СтрокаРаспоряжение Из КоллекцияРаспоряжений Цикл
			Если Адрес < СтрокаРаспоряжение.Адрес Тогда
				Возврат Новый Структура("Зона, Распоряжение", 0, КоллекцияРаспоряжений.Индекс(СтрокаРаспоряжение));
			КонецЕсли;
		КонецЦикла;
		Возврат Новый Структура("Зона, Распоряжение", 0, КоллекцияРаспоряжений.Количество());
	КонецЕсли;
	
КонецФункции

Функция ТекстЗапросаРаспоряженияНаДоставку(ВыборочноеОбновление, ЕстьОрдерныйСклад, ЕстьНеОрдерныйСклад, ДоставкаПолучателям)
	
	Если ВыборочноеОбновление Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ОбновляемыеРаспоряжения.Распоряжение,
		|	ОбновляемыеРаспоряжения.Склад
		|ПОМЕСТИТЬ ОбновляемыеРаспоряжения
		|ИЗ
		|	&ОбновляемыеРаспоряжения КАК ОбновляемыеРаспоряжения";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО КАК Распоряжение,
		|	НЕОПРЕДЕЛЕНО КАК Склад
		|ПОМЕСТИТЬ ОбновляемыеРаспоряжения";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
		ТекстЗапросаВтРаспоряженияНаДоставку(ДоставкаПолучателям);
	
	ШаблонВыборкаДвиженийКРаспределению = ?(ДоставкаПолучателям,
		"ВЫБРАТЬ
		|	ТаблицыИсточника.Склад                  КАК Склад,
		|	ТаблицыИсточника.Распоряжение           КАК Распоряжение,
		|	ТаблицыИсточника.ПолучательОтправитель  КАК ПолучательОтправитель,
		|	ТаблицыИсточника.СпособДоставки         КАК СпособДоставки,
		|	ТаблицыИсточника.Зона                   КАК Зона,
		|	ТаблицыИсточника.Перевозчик             КАК Перевозчик,
		|	ТаблицыИсточника.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
		|	ТаблицыИсточника.Номенклатура           КАК Номенклатура,
		|	ТаблицыИсточника.Характеристика         КАК Характеристика,
		|	ТаблицыИсточника.Назначение             КАК Назначение,
		|	ТаблицыИсточника.Серия                  КАК Серия,
		|	ТаблицыИсточника.Количество             КАК Количество
		|ИЗ
		|	ИмяТаблицыИсточника КАК ТаблицыИсточника",
		"ВЫБРАТЬ
		|	ТаблицыИсточника.Период         КАК Период,
		|	ТаблицыИсточника.Распоряжение   КАК Распоряжение,
		|	ТаблицыИсточника.Номенклатура   КАК Номенклатура,
		|	ТаблицыИсточника.Характеристика КАК Характеристика,
		|	ТаблицыИсточника.Назначение     КАК Назначение,
		|	ТаблицыИсточника.Склад          КАК Склад,
		|	ТаблицыИсточника.Количество     КАК Количество,
		|	ТаблицыИсточника.Вес            КАК Вес,
		|	ТаблицыИсточника.Объем          КАК Объем
		|ИЗ
		|	ИмяТаблицыИсточника КАК ТаблицыИсточника");
	
	ШаблонВыборкаРаспоряжений = 
	"ВЫБРАТЬ
	|	ТаблицыИсточника.Дата                   КАК Дата,
	|	ТаблицыИсточника.Номенклатура           КАК Номенклатура,
	|	ТаблицыИсточника.МернаяЕдиницаИзмерения КАК МернаяЕдиницаИзмерения,
	|	ТаблицыИсточника.Характеристика         КАК Характеристика,
	|	ТаблицыИсточника.Назначение             КАК Назначение,
	|	ТаблицыИсточника.Серия                  КАК Серия,
	|	ТаблицыИсточника.Количество             КАК Количество,
	|	ТаблицыИсточника.Вес                    КАК Вес,
	|	ТаблицыИсточника.Объем                  КАК Объем,
	|	ТаблицыИсточника.Склад                  КАК Склад,
	|	ТаблицыИсточника.Распоряжение           КАК Распоряжение,
	|	ТаблицыИсточника.ПолучательОтправитель  КАК ПолучательОтправитель,
	|	ТаблицыИсточника.ВидРаспоряжения        КАК ВидРаспоряжения,
	|	ТаблицыИсточника.Номер                  КАК Номер,
	|	ТаблицыИсточника.Адрес                  КАК Адрес,
	|	ТаблицыИсточника.АдресЗначенияПолей     КАК АдресЗначенияПолей,
	|	ТаблицыИсточника.СпособДоставки         КАК СпособДоставки,
	|	ТаблицыИсточника.Картинка               КАК Картинка,
	|	ТаблицыИсточника.Зона                   КАК Зона,
	|	ТаблицыИсточника.ЗонаПредставление      КАК ЗонаПредставление,
	|	ТаблицыИсточника.Перевозчик             КАК Перевозчик,
	|	ТаблицыИсточника.ВремяС                 КАК ВремяС,
	|	ТаблицыИсточника.ВремяПо                КАК ВремяПо,
	|	ТаблицыИсточника.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	ТаблицыИсточника.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ТаблицыИсточника.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	ТаблицыИсточника.ПолеУпорядочивания     КАК ПолеУпорядочивания
	|ИЗ
	|	ИмяТаблицыИсточника КАК ТаблицыИсточника";
	
	ТекстИсточникиДвиженийКРаспределению = "";
	ТекстИсточникиРаспоряжений = "";
	
	Если ЕстьОрдерныйСклад Тогда
		
		ТекстЗапроса = ТекстЗапроса
			+ ОбщегоНазначения.РазделительПакетаЗапросов()
			+ ?(ДоставкаПолучателям,
				ТекстЗапросаРаспоряженияНаДоставкуПолучателямПоОрдернойСхеме(),
				ТекстЗапросаРаспоряженияНаДоставкуОтОтправителейПоОрдернойСхеме());
		
		ИмяТаблицыКРаспределению = "ВтДвиженияКРаспределениюПоОрдернойСхеме";
		ИмяТаблицыРаспоряжений = ?(ДоставкаПолучателям,
			"ВтРаспоряженияНаДоставкуПолучателямПоОрдернойСхеме",
			"ВтРаспоряженияНаДоставкуОтОтправителейПоОрдернойСхеме");
		
		ТекстИсточникДвиженийКРаспределению = СтрЗаменить(ШаблонВыборкаДвиженийКРаспределению,
			"ИмяТаблицыИсточника",
			ИмяТаблицыКРаспределению);
		ТекстИсточникРаспоряжений = СтрЗаменить(ШаблонВыборкаРаспоряжений,
			"ИмяТаблицыИсточника",
			ИмяТаблицыРаспоряжений);
		
		ТекстИсточникиДвиженийКРаспределению = ТекстИсточникДвиженийКРаспределению;
		ТекстИсточникиРаспоряжений = ТекстИсточникРаспоряжений;
		
	КонецЕсли;
	
	Если ЕстьНеОрдерныйСклад Тогда
		ТекстЗапроса = ТекстЗапроса
			+ ОбщегоНазначения.РазделительПакетаЗапросов()
			+ ?(ДоставкаПолучателям,
				ТекстЗапросаРаспоряженияНаДоставкуПолучателямБезОрдернойСхемы(),
				ТекстЗапросаРаспоряженияНаДоставкуОтОтправителейБезОрдернойСхемы());
		
		ИмяТаблицыКРаспределению = "ВтДвиженияКРаспределениюБезОрдернойСхемы";
		ИмяТаблицыРаспоряжений = ?(ДоставкаПолучателям,
			"ВтРаспоряженияНаДоставкуПолучателямБезОрдернойСхемы",
			"ВтРаспоряженияНаДоставкуОтОтправителейБезОрдернойСхемы");
		
		ТекстИсточникДвиженийКРаспределению = СтрЗаменить(ШаблонВыборкаДвиженийКРаспределению,
			"ИмяТаблицыИсточника",
			ИмяТаблицыКРаспределению);
		ТекстИсточникРаспоряжений = СтрЗаменить(ШаблонВыборкаРаспоряжений,
			"ИмяТаблицыИсточника",
			ИмяТаблицыРаспоряжений);
		
		ТекстИсточникиДвиженийКРаспределению = ?(ПустаяСтрока(ТекстИсточникиДвиженийКРаспределению),
			ТекстИсточникДвиженийКРаспределению,
			ТекстИсточникиДвиженийКРаспределению
			+ "
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|"
			+ ТекстИсточникДвиженийКРаспределению);
			
		ТекстИсточникиРаспоряжений = ?(ПустаяСтрока(ТекстИсточникиРаспоряжений),
			ТекстИсточникРаспоряжений,
			ТекстИсточникиРаспоряжений
			+ "
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|"
			+ ТекстИсточникРаспоряжений);
		
	КонецЕсли;
	
	ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению = 
		СтрЗаменить(ШаблонВыборкаДвиженийКРаспределению,
			"ИмяТаблицыИсточника",
			"("
			+ ТекстИсточникиДвиженийКРаспределению
			+ ")");
	Если Не ДоставкаПолучателям Тогда
		ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению = ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению
			+
			"
			|УПОРЯДОЧИТЬ ПО
			|	ТаблицыИсточника.Период";
	КонецЕсли;
	
	ФинальныйТекстЗапросаИсточникиРаспоряжений = 
		СтрЗаменить(ШаблонВыборкаРаспоряжений,
			"ИмяТаблицыИсточника",
			"("
			+ ТекстИсточникиРаспоряжений
			+ ")");
	
	ТекстЗапросаУпорядочивание = "";
	Если Не ДоставкаПолучателям
		И ЕстьОрдерныйСклад Тогда
		ТекстЗапросаУпорядочивание = 
		"
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицыИсточника.ЗонаПредставление,
		|	ТаблицыИсточника.Зона,
		|	ТаблицыИсточника.Распоряжение,
		|	ТаблицыИсточника.Склад,
		|	ТаблицыИсточника.Номенклатура,
		|	ТаблицыИсточника.Характеристика,
		|	ТаблицыИсточника.Назначение,
		|	ТаблицыИсточника.Серия,
		|	ТаблицыИсточника.Дата";
	Иначе
		ТекстЗапросаУпорядочивание = 
		"
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицыИсточника.ЗонаПредставление,
		|	ТаблицыИсточника.Зона,
		|	ТаблицыИсточника.ПолеУпорядочивания,
		|	ТаблицыИсточника.ПолучательОтправитель,
		|	ТаблицыИсточника.Распоряжение,
		|	ТаблицыИсточника.Склад,
		|	ТаблицыИсточника.Номенклатура,
		|	ТаблицыИсточника.Характеристика,
		|	ТаблицыИсточника.Назначение,
		|	ТаблицыИсточника.Серия,
		|	ТаблицыИсточника.Дата";
	КонецЕсли;
	
	ФинальныйТекстЗапросаИсточникиРаспоряжений = ФинальныйТекстЗапросаИсточникиРаспоряжений
		+ ТекстЗапросаУпорядочивание;
	
	ТекстЗапроса = ТекстЗапроса
		+ ОбщегоНазначения.РазделительПакетаЗапросов() 
		+ ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению
		+ ОбщегоНазначения.РазделительПакетаЗапросов() 
		+ ФинальныйТекстЗапросаИсточникиРаспоряжений;
		
	Если Не ВыборочноеОбновление Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения",
		"ЛЕВОЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаВесУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки("СправочникНоменклатура.ЕдиницаИзмерения", "СправочникНоменклатура"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаОбъемУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки("СправочникНоменклатура.ЕдиницаИзмерения", "СправочникНоменклатура"));
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтРаспоряженияНаДоставку(ДоставкаПолучателям)
	
	ТекстЗапроса = "";
	
	Если ДоставкаПолучателям Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РаспоряженияНаДоставку.Распоряжение КАК Распоряжение,
		|	РаспоряженияНаДоставку.Склад КАК Склад,
		|	(РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
		|		И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДатаСеанса) КАК ЭтоОрдерныйСклад,
		|	РаспоряженияНаДоставку.ПолучательОтправитель,
		|	РаспоряженияНаДоставку.СпособДоставки,
		|	РаспоряженияНаДоставку.Зона,
		|	РаспоряженияНаДоставку.Перевозчик,
		|	РаспоряженияНаДоставку.Дата,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
		|ПОМЕСТИТЬ РаспоряженияНаДоставку
		|ИЗ
		|	РегистрСведений.СостоянияИРеквизитыДоставки КАК РаспоряженияНаДоставку
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
		|		ПО (ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
		|			И (ТоварыКДоставке.Склад = РаспоряженияНаДоставку.Склад)
		|			И (ТоварыКДоставке.ВсеТовары)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения КАК ОбновляемыеРаспоряжения
		|		ПО РаспоряженияНаДоставку.Распоряжение = ОбновляемыеРаспоряжения.Распоряжение
		|			И РаспоряженияНаДоставку.Склад = ОбновляемыеРаспоряжения.Склад
		|ГДЕ
		|	(ТоварыКДоставке.Распоряжение ЕСТЬ NULL
		|			ИЛИ ТоварыКДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПодбор
		|			ИЛИ НЕ ТоварыКДоставке.ЗаданиеНаПеревозку.Проведен)
		|	И РаспоряженияНаДоставку.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДоставки.ТребуетсяДоставка)
		|	И ВЫБОР
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.НашаТранспортнаяСлужба)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиКПолучателю)
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомКПолучателю)
		|			ИНАЧЕ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиКПолучателю)
		|					ИЛИ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомКПолучателю)
		|		КОНЕЦ
		|	И (&БезОтбораПоЗоне
		|			ИЛИ РаспоряженияНаДоставку.Зона В ИЕРАРХИИ (&Зона))
		|	И (РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
		|			ИЛИ РаспоряженияНаДоставку.Склад В ИЕРАРХИИ (&Склад))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РаспоряженияНаДоставку.Распоряжение,
		|	РаспоряженияНаДоставку.Склад,
		|	(РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
		|		И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДатаСеанса) КАК ЭтоОрдерныйСклад,
		|	РаспоряженияНаДоставку.ПолучательОтправитель,
		|	РаспоряженияНаДоставку.СпособДоставки,
		|	РаспоряженияНаДоставку.Зона,
		|	РаспоряженияНаДоставку.Перевозчик,
		|	РаспоряженияНаДоставку.Дата,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
		|ИЗ
		|	РегистрСведений.СостоянияИРеквизитыДоставки КАК РаспоряженияНаДоставку
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК РаспоряженияЗадания
		|		ПО (РаспоряженияЗадания.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
		|			И (РаспоряженияЗадания.Склад = РаспоряженияНаДоставку.Склад)
		|			И (РаспоряженияЗадания.Ссылка = &ЗаданиеНаПеревозкуПодбор)
		|			И (РаспоряженияНаДоставку.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияДоставки.ТребуетсяДоставка))
		|ГДЕ
		|	(&БезОтбораПоЗоне
		|			ИЛИ РаспоряженияНаДоставку.Зона В ИЕРАРХИИ (&Зона))
		|	И (РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
		|			ИЛИ РаспоряженияНаДоставку.Склад В ИЕРАРХИИ (&Склад))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Распоряжение,
		|	Склад";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РаспоряженияНаДоставку.Распоряжение КАК Распоряжение,
		|	РаспоряженияНаДоставку.Склад КАК Склад,
		|	(РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|		И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриПоступлении <= &ТекущаяДатаСеанса) КАК ЭтоОрдерныйСклад,
		|	РаспоряженияНаДоставку.ПолучательОтправитель,
		|	ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) КАК ВидРаспоряжения,
		|	РаспоряженияНаДоставку.Номер КАК Номер,
		|	РаспоряженияНаДоставку.Дата КАК Дата,
		|	РаспоряженияНаДоставку.Адрес КАК Адрес,
		|	РаспоряженияНаДоставку.АдресЗначенияПолей КАК АдресЗначенияПолей,
		|	РаспоряженияНаДоставку.СпособДоставки КАК СпособДоставки,
		|	РаспоряженияНаДоставку.Зона КАК Зона,
		|	РаспоряженияНаДоставку.Перевозчик КАК Перевозчик,
		|	РаспоряженияНаДоставку.ВремяС КАК ВремяС,
		|	РаспоряженияНаДоставку.ВремяПо КАК ВремяПо,
		|	РаспоряженияНаДоставку.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
		|	ВЫБОР
		|		КОГДА РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада)
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(РаспоряженияНаДоставку.Перевозчик)
		|		ИНАЧЕ РаспоряженияНаДоставку.Адрес
		|	КОНЕЦ КАК ПолеУпорядочения
		|ПОМЕСТИТЬ РаспоряженияНаДоставку
		|ИЗ
		|	РегистрСведений.СостоянияИРеквизитыДоставки КАК РаспоряженияНаДоставку
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
		|		ПО (ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
		|			И (ТоварыКДоставке.Склад = РаспоряженияНаДоставку.Склад)
		|			И (ТоварыКДоставке.ВсеТовары)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения КАК ОбновляемыеРаспоряжения
		|		ПО РаспоряженияНаДоставку.Распоряжение = ОбновляемыеРаспоряжения.Распоряжение
		|			И РаспоряженияНаДоставку.Склад = ОбновляемыеРаспоряжения.Склад
		|ГДЕ
		|	(ТоварыКДоставке.Распоряжение ЕСТЬ NULL
		|			ИЛИ ТоварыКДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПодбор
		|			ИЛИ НЕ ТоварыКДоставке.ЗаданиеНаПеревозку.Проведен)
		|	И РаспоряженияНаДоставку.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДоставки.ТребуетсяДоставка)
		|	И ВЫБОР
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.НашаТранспортнаяСлужба)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиОтОтправителя)
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомОтОтправителя)
		|			ИНАЧЕ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиОтОтправителя)
		|					ИЛИ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомОтОтправителя)
		|		КОНЕЦ
		|	И (&БезОтбораПоЗоне
		|			ИЛИ РаспоряженияНаДоставку.Зона В ИЕРАРХИИ (&Зона))
		|	И (РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
		|			ИЛИ РаспоряженияНаДоставку.Склад В ИЕРАРХИИ (&Склад))
		|	И (НЕ (РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|			И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриПоступлении <= &ТекущаяДатаСеанса)
		|		ИЛИ (НЕ РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.СоглашенияСПоставщиками
		|			 И НЕ РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.ДоговорыКонтрагентов)
		|		)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РаспоряженияНаДоставку.Распоряжение КАК Распоряжение,
		|	РаспоряженияНаДоставку.Склад КАК Склад,
		|	(РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|		И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриПоступлении <= &ТекущаяДатаСеанса) КАК ЭтоОрдерныйСклад,
		|	РаспоряженияНаДоставку.ПолучательОтправитель,
		|	ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) КАК ВидРаспоряжения,
		|	РаспоряженияНаДоставку.Номер,
		|	РаспоряженияНаДоставку.Дата,
		|	РаспоряженияНаДоставку.Адрес,
		|	РаспоряженияНаДоставку.АдресЗначенияПолей,
		|	РаспоряженияНаДоставку.СпособДоставки,
		|	РаспоряженияНаДоставку.Зона,
		|	РаспоряженияНаДоставку.Перевозчик,
		|	РаспоряженияНаДоставку.ВремяС,
		|	РаспоряженияНаДоставку.ВремяПо,
		|	РаспоряженияНаДоставку.ДополнительнаяИнформация,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозкиОписание,
		|	ВЫБОР
		|		КОГДА РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада)
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(РаспоряженияНаДоставку.Перевозчик)
		|		ИНАЧЕ РаспоряженияНаДоставку.Адрес
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.СостоянияИРеквизитыДоставки КАК РаспоряженияНаДоставку
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК РаспоряженияЗадания
		|		ПО (РаспоряженияЗадания.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
		|			И (РаспоряженияЗадания.Склад = РаспоряженияНаДоставку.Склад)
		|			И (РаспоряженияЗадания.Ссылка = &ЗаданиеНаПеревозкуПодбор)
		|			И (РаспоряженияНаДоставку.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияДоставки.ТребуетсяДоставка))
		|ГДЕ
		|	(&БезОтбораПоЗоне
		|			ИЛИ РаспоряженияНаДоставку.Зона В ИЕРАРХИИ (&Зона))
		|	И (РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
		|			ИЛИ РаспоряженияНаДоставку.Склад В ИЕРАРХИИ (&Склад))
		|	И (НЕ (РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|			И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриПоступлении <= &ТекущаяДатаСеанса)
		|		ИЛИ (НЕ РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.СоглашенияСПоставщиками
		|			 И НЕ РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.ДоговорыКонтрагентов)
		|		)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РаспоряженияНаДоставку.Распоряжение,
		|	РаспоряженияНаДоставку.Склад,
		|	(РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|		И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриПоступлении <= &ТекущаяДатаСеанса) КАК ЭтоОрдерныйСклад,
		|	РаспоряженияНаДоставку.ПолучательОтправитель,
		|	ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) КАК ВидРаспоряжения,
		|	NULL КАК Номер,
		|	РаспоряженияНаДоставку.Дата,
		|	NULL КАК Адрес,
		|	NULL КАК АдресЗначенияПолей,
		|	РаспоряженияНаДоставку.СпособДоставки,
		|	РаспоряженияНаДоставку.Зона,
		|	РаспоряженияНаДоставку.Перевозчик,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	РегистрСведений.СостоянияИРеквизитыДоставки КАК РаспоряженияНаДоставку
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения КАК ОбновляемыеРаспоряжения
		|		ПО РаспоряженияНаДоставку.Распоряжение = ОбновляемыеРаспоряжения.Распоряжение
		|			И РаспоряженияНаДоставку.Склад = ОбновляемыеРаспоряжения.Склад
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.НашаТранспортнаяСлужба)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиОтОтправителя)
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомОтОтправителя)
		|			ИНАЧЕ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиОтОтправителя)
		|					ИЛИ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомОтОтправителя)
		|		КОНЕЦ
		|	И (&БезОтбораПоЗоне
		|			ИЛИ РаспоряженияНаДоставку.Зона В ИЕРАРХИИ (&Зона))
		|	И (РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
		|			ИЛИ РаспоряженияНаДоставку.Склад В ИЕРАРХИИ (&Склад))
		|	И (РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.СоглашенияСПоставщиками
		|		ИЛИ РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.ДоговорыКонтрагентов)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Распоряжение,
		|	Склад";
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРаспоряженияНаДоставкуПолучателямПоОрдернойСхеме()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЧастичноДоставленныеЗаказы.Склад             КАК Склад,
	|	ЧастичноДоставленныеЗаказы.Распоряжение      КАК Распоряжение,
	|	РаспоряженияНаДоставку.ПолучательОтправитель КАК ПолучательОтправитель,
	|	РаспоряженияНаДоставку.СпособДоставки        КАК СпособДоставки,
	|	РаспоряженияНаДоставку.Зона                  КАК Зона,
	|	РаспоряженияНаДоставку.Перевозчик            КАК Перевозчик,
	|	NULL                                         КАК ОсобыеУсловияПеревозки,
	|	ЧастичноДоставленныеЗаказы.Номенклатура      КАК Номенклатура,
	|	ЧастичноДоставленныеЗаказы.Характеристика    КАК Характеристика,
	|	ЧастичноДоставленныеЗаказы.Назначение        КАК Назначение,
	|	ЧастичноДоставленныеЗаказы.Серия             КАК Серия,
	|	СУММА(ЧастичноДоставленныеЗаказы.Количество) КАК Количество
	|ПОМЕСТИТЬ ВтДвиженияКРаспределениюПоОрдернойСхеме
	|ИЗ
	|	РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ЧастичноДоставленныеЗаказы
	|		ПО РаспоряженияНаДоставку.Распоряжение = ЧастичноДоставленныеЗаказы.Распоряжение
	|			И РаспоряженияНаДоставку.Склад = ЧастичноДоставленныеЗаказы.Склад
	|			И (НЕ ЧастичноДоставленныеЗаказы.ВсеТовары)
	|			И (РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|				ИЛИ РаспоряженияНаДоставку.СпособДоставки
	|					= ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте))
	|ГДЕ
	|	(ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку <> &ЗаданиеНаПеревозкуПодбор
	|		И ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку.Проведен
	|			ИЛИ ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧастичноДоставленныеЗаказы.Склад,
	|	ЧастичноДоставленныеЗаказы.Распоряжение,
	|	РаспоряженияНаДоставку.ПолучательОтправитель,
	|	РаспоряженияНаДоставку.СпособДоставки,
	|	РаспоряженияНаДоставку.Зона,
	|	РаспоряженияНаДоставку.Перевозчик,
	|	ЧастичноДоставленныеЗаказы.Номенклатура,
	|	ЧастичноДоставленныеЗаказы.Характеристика,
	|	ЧастичноДоставленныеЗаказы.Назначение,
	|	ЧастичноДоставленныеЗаказы.Серия
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЧастичноДоставленныеЗаказы.Количество) > 0
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОтгрузкеДетально.ДатаОтгрузки КАК Дата,
	|	ТоварыКОтгрузкеДетально.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузкеДетально.МернаяЕдиницаИзмерения КАК МернаяЕдиницаИзмерения,
	|	ТоварыКОтгрузкеДетально.Характеристика КАК Характеристика,
	|	ТоварыКОтгрузкеДетально.Назначение КАК Назначение,
	|	ТоварыКОтгрузкеДетально.Серия КАК Серия,
	|	ТоварыКОтгрузкеДетально.Количество КАК Количество,
	|	ТоварыКОтгрузкеДетально.Вес КАК Вес,
	|	ТоварыКОтгрузкеДетально.Объем КАК Объем,
	|	ТоварыКОтгрузкеДетально.Склад КАК Склад,
	|	ТоварыКОтгрузкеДетально.Распоряжение КАК Распоряжение,
	|	ТоварыКОтгрузкеДетально.ПолучательОтправитель КАК ПолучательОтправитель,
	|	ТИПЗНАЧЕНИЯ(ТоварыКОтгрузкеДетально.Распоряжение) КАК ВидРаспоряжения,
	|	СостоянияИРеквизитыДоставки.Номер КАК Номер,
	|	СостоянияИРеквизитыДоставки.Адрес КАК Адрес,
	|	СостоянияИРеквизитыДоставки.АдресЗначенияПолей КАК АдресЗначенияПолей,
	|	ТоварыКОтгрузкеДетально.СпособДоставки КАК СпособДоставки,
	|	ВЫБОР
	|		КОГДА ТоварыКОтгрузкеДетально.ЭтоПоручениеЭкспедитору
	|			ТОГДА 4
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТоварыКОтгрузкеДетально.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика))
	|					ТОГДА 0
	|				КОГДА ТоварыКОтгрузкеДетально.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу))
	|					ТОГДА 1
	|				ИНАЧЕ 2
	|			КОНЕЦ + ВЫБОР
	|				КОГДА СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки
	|					ТОГДА 3
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Картинка,
	|	ТоварыКОтгрузкеДетально.Зона КАК Зона,
	|	ТоварыКОтгрузкеДетально.Зона.Представление КАК ЗонаПредставление,
	|	ТоварыКОтгрузкеДетально.Перевозчик КАК Перевозчик,
	|	СостоянияИРеквизитыДоставки.ВремяС КАК ВремяС,
	|	СостоянияИРеквизитыДоставки.ВремяПо КАК ВремяПо,
	|	ВЫРАЗИТЬ(СостоянияИРеквизитыДоставки.ДополнительнаяИнформация КАК СТРОКА(200)) КАК ДополнительнаяИнформация,
	|	СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ВЫРАЗИТЬ(СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозкиОписание КАК СТРОКА(200)) КАК ОсобыеУсловияПеревозкиОписание,
	|	ВЫБОР
	|		КОГДА ТоварыКОтгрузкеДетально.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ТоварыКОтгрузкеДетально.Перевозчик)
	|		ИНАЧЕ СостоянияИРеквизитыДоставки.Адрес
	|	КОНЕЦ КАК ПолеУпорядочивания
	|ПОМЕСТИТЬ ВтРаспоряженияНаДоставкуПолучателямПоОрдернойСхеме
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		МАКСИМУМ(
	|			ВЫБОР КОГДА
	|				НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|					ТОГДА НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|				ИНАЧЕ НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ)
	|			КОНЕЦ) КАК ДатаОтгрузки,
	|		ВЫБОР КОГДА
	|			НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|				ТОГДА НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ)
	|		КОНЕЦ КАК ПолеГруппировкиПросроченныхДатОтгрузки,
	|		ТоварыСУчетомДоставленных.Номенклатура КАК Номенклатура,
	|		ТоварыСУчетомДоставленных.Характеристика КАК Характеристика,
	|		ТоварыСУчетомДоставленных.Назначение КАК Назначение,
	|		ТоварыСУчетомДоставленных.Серия КАК Серия,
	|		РаспоряженияНаДоставку.Склад                 КАК Склад,
	|		РаспоряженияНаДоставку.Распоряжение          КАК Распоряжение,
	|		РаспоряженияНаДоставку.ПолучательОтправитель КАК ПолучательОтправитель,
	|		РаспоряженияНаДоставку.СпособДоставки        КАК СпособДоставки,
	|		РаспоряженияНаДоставку.Зона                  КАК Зона,
	|		РаспоряженияНаДоставку.Перевозчик            КАК Перевозчик,
	|		СУММА(ТоварыСУчетомДоставленных.КОтгрузке) КАК Количество,      // Количество
	|		СУММА(ТоварыСУчетомДоставленных.КОтгрузке * &ТекстЗапросаВесУпаковки) КАК Вес,
	|		СУММА(ТоварыСУчетомДоставленных.КОтгрузке * &ТекстЗапросаОбъемУпаковки) КАК Объем,
	|		ЛОЖЬ КАК ЭтоПоручениеЭкспедитору,
	|		ТоварыСУчетомДоставленных.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК МернаяЕдиницаИзмерения
	|	ИЗ
	|		РегистрНакопления.ТоварыКОтгрузке КАК ТоварыСУчетомДоставленных
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ПО ТоварыСУчетомДоставленных.ДокументОтгрузки = РаспоряженияНаДоставку.Распоряжение
	|			И ТоварыСУчетомДоставленных.Склад = РаспоряженияНаДоставку.Склад
	|			И РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|			ПО ТоварыСУчетомДоставленных.Номенклатура = СправочникНоменклатура.Ссылка
	|	ГДЕ
	|		ТоварыСУчетомДоставленных.КОтгрузке > 0
	|		И ТоварыСУчетомДоставленных.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВЫБОР КОГДА
	|			НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|				ТОГДА НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ)
	|		КОНЕЦ,
	|		РаспоряженияНаДоставку.Склад,
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.Зона,
	|		РаспоряженияНаДоставку.ПолучательОтправитель,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		РаспоряженияНаДоставку.Перевозчик,
	|		ТоварыСУчетомДоставленных.Номенклатура,
	|		ТоварыСУчетомДоставленных.Характеристика,
	|		ТоварыСУчетомДоставленных.Назначение,
	|		ТоварыСУчетомДоставленных.Серия,
	|		ТоварыСУчетомДоставленных.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(РаспоряженияНаДоставку.Дата, ДЕНЬ),
	|		НАЧАЛОПЕРИОДА(РаспоряженияНаДоставку.Дата, ДЕНЬ),
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		РаспоряженияНаДоставку.Склад,
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.ПолучательОтправитель,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		РаспоряженияНаДоставку.Зона,
	|		NULL,
	|		0,
	|		0,
	|		0,
	|		ИСТИНА,
	|		ЛОЖЬ
	|	ИЗ
	|		РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|			ПО (ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
	|	ГДЕ
	|		ТоварыКДоставке.Распоряжение ЕСТЬ NULL
	|		И РаспоряженияНаДоставку.СпособДоставки В (
	|			ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуСоСклада),
	|			ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
	|			)
	|	) КАК ТоварыКОтгрузкеДетально
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
	|	ПО ТоварыКОтгрузкеДетально.Распоряжение = СостоянияИРеквизитыДоставки.Распоряжение
	|		И ТоварыКОтгрузкеДетально.Склад = СостоянияИРеквизитыДоставки.Склад";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРаспоряженияНаДоставкуПолучателямБезОрдернойСхемы()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЧастичноДоставленныеЗаказы.Склад              КАК Склад,
	|	ЧастичноДоставленныеЗаказы.Распоряжение       КАК Распоряжение,
	|	NULL                                          КАК ПолучательОтправитель,
	|	РаспоряженияНаДоставку.СпособДоставки         КАК СпособДоставки,
	|	NULL                                          КАК Зона,
	|	NULL                                          КАК Перевозчик,
	|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ЧастичноДоставленныеЗаказы.Номенклатура       КАК Номенклатура,
	|	ЧастичноДоставленныеЗаказы.Характеристика     КАК Характеристика,
	|	ЧастичноДоставленныеЗаказы.Назначение         КАК Назначение,
	|	ЧастичноДоставленныеЗаказы.Серия              КАК Серия,
	|	СУММА(ЧастичноДоставленныеЗаказы.Количество)  КАК Количество
	|ПОМЕСТИТЬ ВтДвиженияКРаспределениюБезОрдернойСхемы
	|ИЗ
	|	РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ЧастичноДоставленныеЗаказы
	|		ПО РаспоряженияНаДоставку.Распоряжение = ЧастичноДоставленныеЗаказы.Распоряжение
	|			И РаспоряженияНаДоставку.Склад = ЧастичноДоставленныеЗаказы.Склад
	|			И НЕ РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|			И (НЕ ЧастичноДоставленныеЗаказы.ВсеТовары)
	|ГДЕ
	|	(ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку <> &ЗаданиеНаПеревозкуПодбор
	|				И ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку.Проведен
	|			ИЛИ ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧастичноДоставленныеЗаказы.Склад,
	|	ЧастичноДоставленныеЗаказы.Распоряжение,
	|	РаспоряженияНаДоставку.СпособДоставки,
	|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки,
	|	ЧастичноДоставленныеЗаказы.Номенклатура,
	|	ЧастичноДоставленныеЗаказы.Характеристика,
	|	ЧастичноДоставленныеЗаказы.Назначение,
	|	ЧастичноДоставленныеЗаказы.Серия
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЗ.Дата КАК Дата,
	|	ВЗ.Номенклатура КАК Номенклатура,
	|	ВЗ.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК МернаяЕдиницаИзмерения,
	|	ВЗ.Характеристика КАК Характеристика,
	|	ВЗ.Назначение КАК Назначение,
	|	ВЗ.Серия КАК Серия,
	|	ВЗ.Количество КАК Количество,
	|	ВЗ.Количество * &ТекстЗапросаВесУпаковки КАК Вес,
	|	ВЗ.Количество * &ТекстЗапросаОбъемУпаковки КАК Объем,
	|	ВЗ.Склад КАК Склад,
	|	ВЗ.Распоряжение КАК Распоряжение,
	|	ДопРеквизиты.ПолучательОтправитель КАК ПолучательОтправитель,
	|	ТИПЗНАЧЕНИЯ(ВЗ.Распоряжение) КАК ВидРаспоряжения,
	|	ДопРеквизиты.Номер КАК Номер,
	|	ДопРеквизиты.Адрес КАК Адрес,
	|	ВЫРАЗИТЬ(ДопРеквизиты.АдресЗначенияПолей КАК СТРОКА(1000)) КАК АдресЗначенияПолей,
	|	ВЗ.СпособДоставки КАК СпособДоставки,
	|	ВЗ.Картинка КАК Картинка,
	|	ЕСТЬNULL(ДопРеквизиты.Зона, ЗНАЧЕНИЕ(Справочник.ЗоныДоставки.ПустаяСсылка)) КАК Зона,
	|	ДопРеквизиты.Зона.Представление КАК ЗонаПредставление,
	|	ДопРеквизиты.Перевозчик КАК Перевозчик,
	|	ДопРеквизиты.ВремяС КАК ВремяС,
	|	ДопРеквизиты.ВремяПо КАК ВремяПо,
	|	ВЫРАЗИТЬ(ДопРеквизиты.ДополнительнаяИнформация КАК СТРОКА(500)) КАК ДополнительнаяИнформация,
	|	ДопРеквизиты.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ВЫРАЗИТЬ(ДопРеквизиты.ОсобыеУсловияПеревозкиОписание КАК СТРОКА(500)) КАК ОсобыеУсловияПеревозкиОписание,
	|	ВЫБОР
	|		КОГДА ВЗ.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ДопРеквизиты.Перевозчик)
	|		ИНАЧЕ ДопРеквизиты.Адрес
	|	КОНЕЦ КАК ПолеУпорядочивания
	|ПОМЕСТИТЬ ВтРаспоряженияНаДоставкуПолучателямБезОрдернойСхемы
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(НАЧАЛОПЕРИОДА(ТоварыКОтгрузке.Период, ДЕНЬ)) КАК Дата,
	|		РаспоряженияНаДоставку.Распоряжение КАК Распоряжение,
	|		РаспоряженияНаДоставку.Склад КАК Склад,
	|		ТоварыКОтгрузке.Номенклатура КАК Номенклатура,
	|		ТоварыКОтгрузке.Характеристика КАК Характеристика,
	|		ТоварыКОтгрузке.Назначение КАК Назначение,
	|		ТоварыКОтгрузке.Серия КАК Серия,
	|		РаспоряженияНаДоставку.СпособДоставки КАК СпособДоставки,
	|		СУММА(ТоварыКОтгрузке.КОтгрузке) КАК Количество,
	|		ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика))
	|				ТОГДА 0
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу))
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ + ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
	|				ТОГДА 3
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Картинка
	|	ИЗ
	|		РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
	|			ПО РаспоряженияНаДоставку.Распоряжение = ТоварыКОтгрузке.ДокументОтгрузки
	|				И РаспоряженияНаДоставку.Склад = ТоварыКОтгрузке.Склад
	|				И НЕ РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|	ГДЕ
	|		ТоварыКОтгрузке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.Склад,
	|		ТоварыКОтгрузке.Номенклатура,
	|		ТоварыКОтгрузке.Характеристика,
	|		ТоварыКОтгрузке.Назначение,
	|		ТоварыКОтгрузке.Серия,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика))
	|				ТОГДА 0
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу))
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ + ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
	|				ТОГДА 3
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ИМЕЮЩИЕ
	|		СУММА(ТоварыКОтгрузке.КОтгрузке) > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(РаспоряженияНаДоставку.Дата, ДЕНЬ),
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.Склад,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		NULL,
	|		4
	|	ИЗ
	|		РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|			ПО (ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
	|	ГДЕ
	|		РаспоряженияНаДоставку.СпособДоставки В
	|			(ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуСоСклада),
	|			ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте))
	|		И ТоварыКДоставке.Распоряжение ЕСТЬ NULL
	|	) КАК ВЗ
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИРеквизитыДоставки КАК ДопРеквизиты
	|	ПО ВЗ.Распоряжение = ДопРеквизиты.Распоряжение
	|		И ВЗ.Склад = ДопРеквизиты.Склад
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|	ПО ВЗ.Номенклатура = СправочникНоменклатура.Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРаспоряженияНаДоставкуОтОтправителейПоОрдернойСхеме()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТоварыКПоступлениюОстатки.Склад КАК Склад,
	|	ТоварыКПоступлениюОстатки.ДокументПоступления КАК Распоряжение,
	|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
	|	ТоварыКПоступлениюОстатки.Назначение КАК Назначение,
	|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток КАК Количество
	|ПОМЕСТИТЬ ТоварыКДоставкеОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Остатки(
	|			,
	|			(Склад, ДокументПоступления) В
	|				(ВЫБРАТЬ
	|					РаспоряженияНаДоставку.Склад,
	|					РаспоряженияНаДоставку.Распоряжение
	|				ИЗ
	|					РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ГДЕ
	|					РаспоряженияНаДоставку.ЭтоОрдерныйСклад)) КАК ТоварыКПоступлениюОстатки
	|ГДЕ
	|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДетальныеДанные.Склад КАК Склад,
	|	ДетальныеДанные.Распоряжение КАК Распоряжение,
	|	ДетальныеДанные.Номенклатура КАК Номенклатура,
	|	ДетальныеДанные.Характеристика КАК Характеристика,
	|	ДетальныеДанные.Назначение КАК Назначение,
	|	СУММА(ДетальныеДанные.Количество) КАК Количество
	|ПОМЕСТИТЬ ТоварыСУчетомДоставленных
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыКДоставкеОстатки.Склад КАК Склад,
	|		ТоварыКДоставкеОстатки.Распоряжение КАК Распоряжение,
	|		ТоварыКДоставкеОстатки.Номенклатура КАК Номенклатура,
	|		ТоварыКДоставкеОстатки.Характеристика КАК Характеристика,
	|		ТоварыКДоставкеОстатки.Назначение КАК Назначение,
	|		ТоварыКДоставкеОстатки.Количество КАК Количество
	|	ИЗ
	|		ТоварыКДоставкеОстатки КАК ТоварыКДоставкеОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыКДоставкеОстатки.Склад,
	|		ТоварыКДоставкеОстатки.Распоряжение,
	|		ТоварыКДоставкеОстатки.Номенклатура,
	|		ТоварыКДоставкеОстатки.Характеристика,
	|		ТоварыКДоставкеОстатки.Назначение,
	|		-ЕСТЬNULL(ТоварыКДоставке.Количество, 0)
	|	ИЗ
	|		ТоварыКДоставкеОстатки КАК ТоварыКДоставкеОстатки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|			ПО ТоварыКДоставкеОстатки.Склад = ТоварыКДоставке.Склад
	|				И ТоварыКДоставкеОстатки.Распоряжение = ТоварыКДоставке.Распоряжение
	|				И ТоварыКДоставкеОстатки.Номенклатура = ТоварыКДоставке.Номенклатура
	|				И ТоварыКДоставкеОстатки.Характеристика = ТоварыКДоставке.Характеристика
	|				И ТоварыКДоставкеОстатки.Назначение = ТоварыКДоставке.Назначение
	|	ГДЕ
	|		(ТоварыКДоставке.ЗаданиеНаПеревозку <> &ЗаданиеНаПеревозкуПодбор
	|					И ТоварыКДоставке.ЗаданиеНаПеревозку.Проведен
	|				ИЛИ ТоварыКДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПустаяСсылка)
	|		И НЕ ТоварыКДоставке.ВсеТовары) КАК ДетальныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ДетальныеДанные.Склад,
	|	ДетальныеДанные.Распоряжение,
	|	ДетальныеДанные.Номенклатура,
	|	ДетальныеДанные.Характеристика,
	|	ДетальныеДанные.Назначение
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДетальныеДанные.Количество) > 0
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКПоступлению.Период КАК Период,
	|	ТоварыКПоступлению.ДокументПоступления КАК Распоряжение,
	|	ТоварыКПоступлению.Номенклатура КАК Номенклатура,
	|	ТоварыКПоступлению.Характеристика КАК Характеристика,
	|	ТоварыКПоступлению.Назначение КАК Назначение,
	|	ТоварыКПоступлению.Склад КАК Склад,
	|	ЕСТЬNULL(ТоварыКПоступлению.КОформлениюОрдеров, 0) КАК Количество,
	|	ЕСТЬNULL(ТоварыКПоступлению.КОформлениюОрдеров, 0) * &ТекстЗапросаВесУпаковки КАК Вес,
	|	ЕСТЬNULL(ТоварыКПоступлению.КОформлениюОрдеров, 0) * &ТекстЗапросаОбъемУпаковки КАК Объем
	|ПОМЕСТИТЬ ВтДвиженияКРаспределениюПоОрдернойСхеме
	|ИЗ
	|	ТоварыСУчетомДоставленных КАК ТоварыСУчетомДоставленных
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПоступлению КАК ТоварыКПоступлению
	|		ПО ТоварыСУчетомДоставленных.Распоряжение = ТоварыКПоступлению.ДокументПоступления
	|			И ТоварыСУчетомДоставленных.Склад = ТоварыКПоступлению.Склад
	|			И ТоварыСУчетомДоставленных.Номенклатура = ТоварыКПоступлению.Номенклатура
	|			И ТоварыСУчетомДоставленных.Характеристика = ТоварыКПоступлению.Характеристика
	|			И ТоварыСУчетомДоставленных.Назначение = ТоварыКПоступлению.Назначение
	|			И (ТоварыКПоступлению.Период >= &ДатаОтбора)
	|			И (ТоварыКПоступлению.КОформлениюОрдеров > 0)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТоварыСУчетомДоставленных.Номенклатура = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	ТоварыКПоступлению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СостоянияИРеквизитыДоставки.ПолучательОтправитель, НЕОПРЕДЕЛЕНО) КАК ПолучательОтправитель,
	|	ТоварыСУчетомДоставленных.Номенклатура КАК Номенклатура,
	|	ТоварыСУчетомДоставленных.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК МернаяЕдиницаИзмерения,
	|	ТоварыСУчетомДоставленных.Характеристика КАК Характеристика,
	|	ТоварыСУчетомДоставленных.Назначение КАК Назначение,
	|	ТоварыСУчетомДоставленных.Количество КАК Количество,
	|	ТоварыСУчетомДоставленных.Количество * &ТекстЗапросаВесУпаковки КАК Вес,
	|	ТоварыСУчетомДоставленных.Количество * &ТекстЗапросаОбъемУпаковки КАК Объем,
	|	ТоварыСУчетомДоставленных.Склад КАК Склад,
	|	ТоварыСУчетомДоставленных.Распоряжение КАК Распоряжение,
	|	ТИПЗНАЧЕНИЯ(ТоварыСУчетомДоставленных.Распоряжение) КАК ВидРаспоряжения,
	|	СостоянияИРеквизитыДоставки.Номер КАК Номер,
	|	СостоянияИРеквизитыДоставки.Адрес КАК Адрес,
	|	СостоянияИРеквизитыДоставки.АдресЗначенияПолей КАК АдресЗначенияПолей,
	|	СостоянияИРеквизитыДоставки.СпособДоставки КАК СпособДоставки,
	|	СостоянияИРеквизитыДоставки.Зона КАК Зона,
	|	СостоянияИРеквизитыДоставки.Зона.Представление КАК ЗонаПредставление,
	|	СостоянияИРеквизитыДоставки.Перевозчик КАК Перевозчик,
	|	СостоянияИРеквизитыДоставки.ВремяС КАК ВремяС,
	|	СостоянияИРеквизитыДоставки.ВремяПо КАК ВремяПо,
	|	ВЫБОР
	|		КОГДА СостоянияИРеквизитыДоставки.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада))
	|			ТОГДА 0
	|		КОГДА СостоянияИРеквизитыДоставки.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи))
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ + ВЫБОР
	|		КОГДА СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки
	|			ТОГДА 3
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Картинка,
	|	ВЫРАЗИТЬ(СостоянияИРеквизитыДоставки.ДополнительнаяИнформация КАК СТРОКА(200)) КАК ДополнительнаяИнформация,
	|	СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ВЫРАЗИТЬ(СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозкиОписание КАК СТРОКА(200)) КАК ОсобыеУсловияПеревозкиОписание,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	СостоянияИРеквизитыДоставки.Дата КАК Дата,
	|	NULL КАК ПолеУпорядочивания
	|ПОМЕСТИТЬ ВтРаспоряженияНаДоставкуОтОтправителейПоОрдернойСхеме
	|ИЗ
	|	ТоварыСУчетомДоставленных КАК ТоварыСУчетомДоставленных
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
	|		ПО ТоварыСУчетомДоставленных.Склад = СостоянияИРеквизитыДоставки.Склад
	|			И ТоварыСУчетомДоставленных.Распоряжение = СостоянияИРеквизитыДоставки.Распоряжение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТоварыСУчетомДоставленных.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаспоряженияНаДоставку.ПолучательОтправитель,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	0,
	|	РаспоряженияНаДоставку.Склад,
	|	РаспоряженияНаДоставку.Распоряжение,
	|	ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение),
	|	СостоянияИРеквизитыДоставки.Номер,
	|	СостоянияИРеквизитыДоставки.Адрес,
	|	СостоянияИРеквизитыДоставки.АдресЗначенияПолей,
	|	СостоянияИРеквизитыДоставки.СпособДоставки,
	|	СостоянияИРеквизитыДоставки.Зона,
	|	СостоянияИРеквизитыДоставки.Зона.Представление,
	|	СостоянияИРеквизитыДоставки.Перевозчик,
	|	СостоянияИРеквизитыДоставки.ВремяС,
	|	СостоянияИРеквизитыДоставки.ВремяПо,
	|	4,
	|	ВЫРАЗИТЬ(СостоянияИРеквизитыДоставки.ДополнительнаяИнформация КАК СТРОКА(200)),
	|	СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки,
	|	ВЫРАЗИТЬ(СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозкиОписание КАК СТРОКА(200)),
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА РаспоряженияНаДоставку.Распоряжение ССЫЛКА Документ.ПоручениеЭкспедитору
	|			ТОГДА НАЧАЛОПЕРИОДА(СостоянияИРеквизитыДоставки.Дата, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ,
	|	РаспоряженияНаДоставку.ПолеУпорядочения
	|ИЗ
	|	РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|		ПО РаспоряженияНаДоставку.Распоряжение = ТоварыКДоставке.Распоряжение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
	|		ПО РаспоряженияНаДоставку.Распоряжение = СостоянияИРеквизитыДоставки.Распоряжение
	|ГДЕ
	|	ТоварыКДоставке.Распоряжение ЕСТЬ NULL
	|	И РаспоряженияНаДоставку.СпособДоставки В (
	|		ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуНаСклад),
	|		ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте))
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРаспоряженияНаДоставкуОтОтправителейБезОрдернойСхемы()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Распоряжение КАК Распоряжение,
	|	ВложенныйЗапрос.Склад КАК Склад,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.Назначение КАК Назначение,
	|	ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.КоличествоВДоставке) > СУММА(ВложенныйЗапрос.КоличествоПринято)
	|			ТОГДА СУММА(ВложенныйЗапрос.КоличествоВДоставке)
	|		ИНАЧЕ СУММА(ВложенныйЗапрос.КоличествоПринято)
	|	КОНЕЦ КАК Количество
	|ПОМЕСТИТЬ ТоварыКВычетуИзДоставки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыКДоставке.Распоряжение КАК Распоряжение,
	|		ТоварыКДоставке.Склад КАК Склад,
	|		ТоварыКДоставке.Номенклатура КАК Номенклатура,
	|		ТоварыКДоставке.Характеристика КАК Характеристика,
	|		ТоварыКДоставке.Назначение КАК Назначение,
	|		ТоварыКДоставке.Количество КАК КоличествоВДоставке,
	|		0 КАК КоличествоПринято
	|	ИЗ
	|		РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ПО ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение
	|				И ТоварыКДоставке.Склад = РаспоряженияНаДоставку.Склад
	|				И НЕ РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|				И (НЕ ТоварыКДоставке.ВсеТовары)
	|	ГДЕ
	|		(ТоварыКДоставке.ЗаданиеНаПеревозку <> &ЗаданиеНаПеревозкуПодбор
	|					И ТоварыКДоставке.ЗаданиеНаПеревозку.Проведен
	|				ИЛИ ТоварыКДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПустаяСсылка)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыКПоступлениюОбороты.ДокументПоступления,
	|		ТоварыКПоступлениюОбороты.Склад,
	|		ТоварыКПоступлениюОбороты.Номенклатура,
	|		ТоварыКПоступлениюОбороты.Характеристика,
	|		ТоварыКПоступлениюОбороты.Назначение,
	|		0,
	|		ТоварыКПоступлениюОбороты.КОформлениюОрдеровРасход
	|	ИЗ
	|		РегистрНакопления.ТоварыКПоступлению.Обороты(, , , 
	|			(ДокументПоступления, Склад) В (
	|				ВЫБРАТЬ
	|					РаспоряженияНаДоставку.Распоряжение,
	|					РаспоряженияНаДоставку.Склад
	|				ИЗ
	|					РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ГДЕ
	|					НЕ РаспоряженияНаДоставку.ЭтоОрдерныйСклад)
	|			) КАК ТоварыКПоступлениюОбороты
	|	) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.Назначение,
	|	ВложенныйЗапрос.Распоряжение,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВложенныйЗапрос.Распоряжение,
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Характеристика,
	|	ВложенныйЗапрос.Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	NULL КАК Период,
	|	NULL КАК Распоряжение,
	|	NULL КАК Номенклатура,
	|	NULL КАК Характеристика,
	|	NULL КАК Назначение,
	|	NULL КАК Склад,
	|	0 КАК Количество,
	|	0 КАК Вес,
	|	0 КАК Объем
	|ПОМЕСТИТЬ ВтДвиженияКРаспределениюБезОрдернойСхемы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДетальныеДанные.Дата КАК Дата,
	|	ДетальныеДанные.Номенклатура КАК Номенклатура,
	|	ДетальныеДанные.МернаяЕдиницаИзмерения КАК МернаяЕдиницаИзмерения,
	|	ДетальныеДанные.Характеристика КАК Характеристика,
	|	ДетальныеДанные.Назначение КАК Назначение,
	|	ДетальныеДанные.Серия КАК Серия,
	|	ДетальныеДанные.НачальнаяПотребностьПоДатам - ДетальныеДанные.ВычетТоварыКДоставке КАК Количество,
	|	ДетальныеДанные.НачальнаяПотребностьПоДатамВес - ДетальныеДанные.ВычетТоварыКДоставкеВес КАК Вес,
	|	ДетальныеДанные.НачальнаяПотребностьПоДатамОбъем - ДетальныеДанные.ВычетТоварыКДоставкеОбъем КАК Объем,
	|	ДетальныеДанные.Склад КАК Склад,
	|	ДетальныеДанные.Распоряжение КАК Распоряжение,
	|	ДетальныеДанные.ПолучательОтправитель КАК ПолучательОтправитель,
	|	ДетальныеДанные.ВидРаспоряжения КАК ВидРаспоряжения,
	|	ДетальныеДанные.Номер КАК Номер,
	|	ДетальныеДанные.Адрес КАК Адрес,
	|	ДетальныеДанные.АдресЗначенияПолей КАК АдресЗначенияПолей,
	|	ДетальныеДанные.СпособДоставки КАК СпособДоставки,
	|	ДетальныеДанные.Картинка КАК Картинка,
	|	ДетальныеДанные.Зона КАК Зона,
	|	ДетальныеДанные.ЗонаПредставление КАК ЗонаПредставление,
	|	ДетальныеДанные.Перевозчик КАК Перевозчик,
	|	ДетальныеДанные.ВремяС КАК ВремяС,
	|	ДетальныеДанные.ВремяПо КАК ВремяПо,
	|	ДетальныеДанные.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	ДетальныеДанные.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ДетальныеДанные.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	ДетальныеДанные.ПолеУпорядочения КАК ПолеУпорядочивания
	|ПОМЕСТИТЬ ВтРаспоряженияНаДоставкуОтОтправителейБезОрдернойСхемы
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ТоварыКДоставкеПоРегистраторам.Период, ДЕНЬ) КАК Дата,
	|		ТоварыКДоставкеПоРегистраторам.Номенклатура КАК Номенклатура,
	|		ТоварыКДоставкеПоРегистраторам.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК МернаяЕдиницаИзмерения,
	|		ТоварыКДоставкеПоРегистраторам.Характеристика КАК Характеристика,
	|		ТоварыКДоставкеПоРегистраторам.Назначение КАК Назначение,
	|		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|		ТоварыКДоставкеПоРегистраторам.КОформлениюОрдеровПриход КАК НачальнаяПотребностьПоДатам,
	|		ТоварыКДоставкеПоРегистраторам.КОформлениюОрдеровПриход * &ТекстЗапросаВесУпаковки КАК НачальнаяПотребностьПоДатамВес,
	|		ТоварыКДоставкеПоРегистраторам.КОформлениюОрдеровПриход * &ТекстЗапросаОбъемУпаковки КАК НачальнаяПотребностьПоДатамОбъем,
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0) КАК ВычетТоварыКДоставке,
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0) * &ТекстЗапросаВесУпаковки КАК ВычетТоварыКДоставкеВес,
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0) * &ТекстЗапросаОбъемУпаковки КАК ВычетТоварыКДоставкеОбъем,
	|		РаспоряженияНаДоставку.Склад КАК Склад,
	|		РаспоряженияНаДоставку.Распоряжение КАК Распоряжение,
	|		РаспоряженияНаДоставку.ПолучательОтправитель КАК ПолучательОтправитель,
	|		РаспоряженияНаДоставку.ВидРаспоряжения КАК ВидРаспоряжения,
	|		РаспоряженияНаДоставку.Номер КАК Номер,
	|		РаспоряженияНаДоставку.Адрес КАК Адрес,
	|		РаспоряженияНаДоставку.АдресЗначенияПолей КАК АдресЗначенияПолей,
	|		РаспоряженияНаДоставку.СпособДоставки КАК СпособДоставки,
	|		ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада)
	|				ТОГДА 0
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуНаСклад), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте))
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ + ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
	|				ТОГДА 3
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Картинка,
	|		РаспоряженияНаДоставку.Зона КАК Зона,
	|		РаспоряженияНаДоставку.Зона.Представление КАК ЗонаПредставление,
	|		РаспоряженияНаДоставку.Перевозчик КАК Перевозчик,
	|		РаспоряженияНаДоставку.ВремяС КАК ВремяС,
	|		РаспоряженияНаДоставку.ВремяПо КАК ВремяПо,
	|		РаспоряженияНаДоставку.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|		РаспоряженияНаДоставку.ПолеУпорядочения КАК ПолеУпорядочения
	|	ИЗ
	|		РегистрНакопления.ТоварыКПоступлению.Обороты(, , Регистратор, 
	|			(ДокументПоступления, Склад) В (
	|				ВЫБРАТЬ
	|					РаспоряженияНаДоставку.Распоряжение,
	|					РаспоряженияНаДоставку.Склад
	|				ИЗ
	|					РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ГДЕ
	|					НЕ РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|				)
	|			) КАК ТоварыКДоставкеПоРегистраторам
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТоварыКВычетуИзДоставки КАК ТоварыКВычетуИзДоставки
	|			ПО (ТоварыКВычетуИзДоставки.Распоряжение = ТоварыКДоставкеПоРегистраторам.Регистратор)
	|				И (ТоварыКВычетуИзДоставки.Склад = ТоварыКДоставкеПоРегистраторам.Склад)
	|				И (ТоварыКВычетуИзДоставки.Номенклатура = ТоварыКДоставкеПоРегистраторам.Номенклатура)
	|				И (ТоварыКВычетуИзДоставки.Характеристика = ТоварыКДоставкеПоРегистраторам.Характеристика)
	|				И (ТоварыКВычетуИзДоставки.Назначение = ТоварыКДоставкеПоРегистраторам.Назначение)
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|			ПО (СправочникНоменклатура.Ссылка = ТоварыКДоставкеПоРегистраторам.Номенклатура)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ПО ТоварыКДоставкеПоРегистраторам.Регистратор = РаспоряженияНаДоставку.Распоряжение
	|				И ТоварыКДоставкеПоРегистраторам.Склад = РаспоряженияНаДоставку.Склад
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗоныДоставки КАК Зоны
	|			ПО (Зоны.Ссылка = РаспоряженияНаДоставку.Зона)
	|	ГДЕ
	|		ТоварыКДоставкеПоРегистраторам.КОформлениюОрдеровПриход > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ТоварыКДоставкеПоДням.Период, ДЕНЬ),
	|		ТоварыКДоставкеПоДням.Номенклатура,
	|		ТоварыКДоставкеПоДням.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук),
	|		ТоварыКДоставкеПоДням.Характеристика,
	|		ТоварыКДоставкеПоДням.Назначение,
	|		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|		ТоварыКДоставкеПоДням.Количество,
	|		ТоварыКДоставкеПоДням.Количество * &ТекстЗапросаВесУпаковки,
	|		ТоварыКДоставкеПоДням.Количество * &ТекстЗапросаОбъемУпаковки,
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0),
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0) * &ТекстЗапросаВесУпаковки,
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0) * &ТекстЗапросаОбъемУпаковки,
	|		РаспоряженияНаДоставку.Склад,
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.ПолучательОтправитель,
	|		РаспоряженияНаДоставку.ВидРаспоряжения,
	|		РаспоряженияНаДоставку.Номер,
	|		РаспоряженияНаДоставку.Адрес,
	|		РаспоряженияНаДоставку.АдресЗначенияПолей,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада))
	|				ТОГДА 0
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи))
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ + ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
	|				ТОГДА 3
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		РаспоряженияНаДоставку.Зона,
	|		РаспоряженияНаДоставку.Зона.Представление,
	|		РаспоряженияНаДоставку.Перевозчик,
	|		РаспоряженияНаДоставку.ВремяС,
	|		РаспоряженияНаДоставку.ВремяПо,
	|		РаспоряженияНаДоставку.ДополнительнаяИнформация,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозки,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозкиОписание,
	|		РаспоряженияНаДоставку.ПолеУпорядочения
	|	ИЗ
	|		(ВЫБРАТЬ
	|			Т.Ссылка КАК Ссылка,
	|			Т.ДатаПоступления КАК Период,
	|			Т.Склад КАК Склад,
	|			Т.Номенклатура КАК Номенклатура,
	|			Т.Характеристика КАК Характеристика,
	|			Т.Назначение КАК Назначение,
	|			СУММА(Т.Количество) КАК Количество
	|		ИЗ
	|			Документ.ЗаказПоставщику.Товары КАК Т
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ПО Т.Ссылка = РаспоряженияНаДоставку.Распоряжение
	|					И Т.Склад = РаспоряженияНаДоставку.Склад
	|					И (НЕ Т.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|						ИЛИ Т.ДатаПоступления < Т.Склад.ДатаНачалаОрдернойСхемыПриПоступлении)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Т.Ссылка,
	|			Т.ДатаПоступления,
	|			Т.Склад,
	|			Т.Номенклатура,
	|			Т.Характеристика,
	|			Т.Назначение
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			Т.Ссылка,
	|			Т.Ссылка.Дата,
	|			Т.Склад,
	|			Т.Номенклатура,
	|			Т.Характеристика,
	|			Т.Назначение,
	|			СУММА(Т.Количество)
	|		ИЗ
	|			Документ.ПриобретениеТоваровУслуг.Товары КАК Т
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ПО Т.Ссылка = РаспоряженияНаДоставку.Распоряжение
	|					И Т.Склад = РаспоряженияНаДоставку.Склад
	|					И (НЕ Т.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|						ИЛИ Т.Ссылка.Дата < Т.Склад.ДатаНачалаОрдернойСхемыПриПоступлении)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Т.Ссылка,
	|			Т.Склад,
	|			Т.Номенклатура,
	|			Т.Характеристика,
	|			Т.Назначение,
	|			Т.Ссылка.Дата
	|	) КАК ТоварыКДоставкеПоДням
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыКВычетуИзДоставки КАК ТоварыКВычетуИзДоставки
	|		ПО (ТоварыКВычетуИзДоставки.Распоряжение = ТоварыКДоставкеПоДням.Ссылка)
	|			И (ТоварыКВычетуИзДоставки.Склад = ТоварыКДоставкеПоДням.Склад)
	|			И (ТоварыКВычетуИзДоставки.Номенклатура = ТоварыКДоставкеПоДням.Номенклатура)
	|			И (ТоварыКВычетуИзДоставки.Характеристика = ТоварыКДоставкеПоДням.Характеристика)
	|			И (ТоварыКВычетуИзДоставки.Назначение = ТоварыКДоставкеПоДням.Назначение)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО (СправочникНоменклатура.Ссылка = ТоварыКДоставкеПоДням.Номенклатура)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|		ПО ТоварыКДоставкеПоДням.Ссылка = РаспоряженияНаДоставку.Распоряжение
	|			И ТоварыКДоставкеПоДням.Склад = РаспоряженияНаДоставку.Склад
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(РаспоряженияНаДоставку.Дата, ДЕНЬ),
	|		НЕОПРЕДЕЛЕНО,
	|		ЛОЖЬ,
	|		НЕОПРЕДЕЛЕНО,
	|		НЕОПРЕДЕЛЕНО,
	|		НЕОПРЕДЕЛЕНО,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		РаспоряженияНаДоставку.Склад,
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.ПолучательОтправитель,
	|		РаспоряженияНаДоставку.ВидРаспоряжения,
	|		РаспоряженияНаДоставку.Номер,
	|		РаспоряженияНаДоставку.Адрес,
	|		РаспоряженияНаДоставку.АдресЗначенияПолей,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		4,
	|		РаспоряженияНаДоставку.Зона,
	|		РаспоряженияНаДоставку.Зона.Представление,
	|		РаспоряженияНаДоставку.Перевозчик,
	|		РаспоряженияНаДоставку.ВремяС,
	|		РаспоряженияНаДоставку.ВремяПо,
	|		РаспоряженияНаДоставку.ДополнительнаяИнформация,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозки,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозкиОписание,
	|		РаспоряженияНаДоставку.ПолеУпорядочения
	|	ИЗ
	|		РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|			ПО (ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
	|	ГДЕ
	|		РаспоряженияНаДоставку.СпособДоставки В (
	|			ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуНаСклад),
	|			ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте))
	|		И ТоварыКДоставке.Распоряжение ЕСТЬ NULL
	|	) КАК ДетальныеДанные
	|ГДЕ
	|	(ДетальныеДанные.НачальнаяПотребностьПоДатам = 0
	|			ИЛИ ДетальныеДанные.НачальнаяПотребностьПоДатам - ДетальныеДанные.ВычетТоварыКДоставке > 0)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция СпособыДоставкиНашимиСиламиКПолучателю()
	
	СпособыДоставкиНашимиСиламиКПолучателю = Новый Массив;
	СпособыДоставкиНашимиСиламиКПолучателю.Добавить(Перечисления.СпособыДоставки.ДоКлиента);
	СпособыДоставкиНашимиСиламиКПолучателю.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу);
	СпособыДоставкиНашимиСиламиКПолучателю.Добавить(Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки);
	СпособыДоставкиНашимиСиламиКПолучателю.Добавить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуСоСклада);
	СпособыДоставкиНашимиСиламиКПолучателю.Добавить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте);
	//РИВ
	СпособыДоставкиНашимиСиламиКПолучателю.Добавить(Перечисления.СпособыДоставки.НашимиСиламиСАдресаОтправителя);
	//РИВ
	
	Возврат СпособыДоставкиНашимиСиламиКПолучателю;
	
КонецФункции

Функция СпособыДоставкиПеревозчикомКПолучателю()
	
	СпособыДоставкиПеревозчикомКПолучателю = Новый Массив;
	СпособыДоставкиПеревозчикомКПолучателю.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчика);
	СпособыДоставкиПеревозчикомКПолучателю.Добавить(Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки);
	СпособыДоставкиПеревозчикомКПолучателю.Добавить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте);
	
	Возврат СпособыДоставкиПеревозчикомКПолучателю;	
	
КонецФункции

Функция СпособыДоставкиНашимиСиламиОтОтправителя()
	
	СпособыДоставкиНашимиСиламиОтОтправителя = Новый Массив;
	СпособыДоставкиНашимиСиламиОтОтправителя.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи);
	СпособыДоставкиНашимиСиламиОтОтправителя.Добавить(Перечисления.СпособыДоставки.НашимиСиламиСАдресаОтправителя);
	СпособыДоставкиНашимиСиламиОтОтправителя.Добавить(Перечисления.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки);
	СпособыДоставкиНашимиСиламиОтОтправителя.Добавить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуНаСклад);
	СпособыДоставкиНашимиСиламиОтОтправителя.Добавить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте);
	
	Возврат СпособыДоставкиНашимиСиламиОтОтправителя;
	
КонецФункции

Функция СпособыДоставкиПеревозчикомОтОтправителя()
	
	СпособыДоставкиПеревозчикомОтОтправителя = Новый Массив;
	СпособыДоставкиПеревозчикомОтОтправителя.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада);
	СпособыДоставкиПеревозчикомОтОтправителя.Добавить(Перечисления.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки);
	СпособыДоставкиПеревозчикомОтОтправителя.Добавить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте);
	Возврат СпособыДоставкиПеревозчикомОтОтправителя;
	
КонецФункции

Функция ПолучитьСтрокиТаблицы(ТаблицаПоиска, СтрПоиска, ДатаПоиска, ПоискПоДате = Ложь, ПоискПоНоменклатуре = Ложь)
	
	НайденныеСтрокиДоставки = Неопределено;
	
	Если ПоискПоДате Тогда
		СтруктураПоиска = Новый Структура("Дата, Склад, Распоряжение, ПолучательОтправитель, ВидРаспоряжения, Номер, СпособДоставки, Зона", 
										  ДатаПоиска,  СтрПоиска.Склад, СтрПоиска.Распоряжение, СтрПоиска.ПолучательОтправитель, 
										  СтрПоиска.ВидРаспоряжения, СтрПоиска.Номер, СтрПоиска.СпособДоставки, СтрПоиска.Зона);
	Иначе
		Если ПоискПоНоменклатуре Тогда
			СтруктураПоиска = Новый Структура("Номенклатура, Характеристика, Назначение, Склад, Распоряжение, ПолучательОтправитель, ВидРаспоряжения, Номер, СпособДоставки, Зона", 
											  СтрПоиска.Номенклатура , СтрПоиска.Характеристика, СтрПоиска.Назначение, СтрПоиска.Склад, СтрПоиска.Распоряжение, 
											  СтрПоиска.ПолучательОтправитель, СтрПоиска.ВидРаспоряжения, СтрПоиска.Номер, СтрПоиска.СпособДоставки, СтрПоиска.Зона);
		Иначе
			СтруктураПоиска = Новый Структура("Назначение, Склад, Распоряжение, ПолучательОтправитель, ВидРаспоряжения, Номер, СпособДоставки, Зона", 
											  СтрПоиска.Назначение, СтрПоиска.Склад, СтрПоиска.Распоряжение, СтрПоиска.ПолучательОтправитель, 
											  СтрПоиска.ВидРаспоряжения, СтрПоиска.Номер, СтрПоиска.СпособДоставки, СтрПоиска.Зона);
		КонецЕсли;								  
	КонецЕсли;
	
	НайденныеСтрокиДоставки = ТаблицаПоиска.НайтиСтроки(СтруктураПоиска);
	
	Возврат НайденныеСтрокиДоставки;
	
КонецФункции // ПолучитьСтрокиТаблицы()

Функция ПолучитьТоварыПозаказу(Заказ, Заявка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	_ЗаявкаНаДоставкуЗаказы.Ссылка КАК Ссылка,
	               |	_ЗаявкаНаДоставкуТовары.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	_ЗаявкаНаДоставкуТовары.Номенклатура КАК Номенклатура,
	               |	_ЗаявкаНаДоставкуТовары.Характеристика КАК Характеристика,
	               |	_ЗаявкаНаДоставкуТовары.Упаковка КАК Упаковка,
	               |	_ЗаявкаНаДоставкуТовары.КоличествоУпаковок КАК КоличествоУпаковок
	               |ИЗ
	               |	Документ._ЗаявкаНаДоставку.Заказы КАК _ЗаявкаНаДоставкуЗаказы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ._ЗаявкаНаДоставку.Товары КАК _ЗаявкаНаДоставкуТовары
	               |		ПО _ЗаявкаНаДоставкуЗаказы.Ссылка = _ЗаявкаНаДоставкуТовары.Ссылка
	               |			И _ЗаявкаНаДоставкуЗаказы.НомерСтроки = _ЗаявкаНаДоставкуТовары.КлючСвязи
	               |ГДЕ
	               |	_ЗаявкаНаДоставкуЗаказы.Ссылка = &Ссылка
	               |	И _ЗаявкаНаДоставкуЗаказы.ЗаказКлиента = &ЗаказКлиента";
	
	Запрос.УстановитьПараметр("", );
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		 	
	КонецЦикла;
	
КонецФункции // ПолучитьТоварыПозаказу()

// Перезаполняет список распоряжений на доставку на форме.
//
// Параметры:
//	Форма - УправляемаяФорма - форма, для которой необходимо обновить список распоряжений на доставку;
//	ОбновляемыеРаспоряжения - ТаблицаЗначений, Неопределено - фильтр для частичного перезаполнения списка только 
//		по переданным в таблице распоряжениям.
//
Процедура ОбновитьСписокРаспоряженийНаДоставкуНовая(Форма, ОбновляемыеРаспоряжения = Неопределено, _НоваяФорма = Ложь, ВсеРаспоряжения = Ложь) Экспорт
	
	ДопустимоеОтклонениеПроцент = Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
	
	РаспоряженияНаДоставку 		= Форма.РаспоряженияНаДоставку;
	ТоварыРаспоряженийКДоставке = Форма.ТоварыРаспоряженийКДоставке;
	ОтборПоТипуИсполнителей 	= Форма.ОтборПоТипуИсполнителей;
	Зона 						= Форма.Зона;
	Склад 						= Форма.Склад;
	ДатаРаспоряжений 			= Форма.ДатаРаспоряжений;
	ЗонаГруппаИлиПустая 		= НЕ ЗначениеЗаполнено(Зона) ИЛИ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Зона,"ЭтоГруппа");
	ВыводитьВсе					= Форма.ВсеРаспоряжения;
	
	ВыборочноеОбновление = (ОбновляемыеРаспоряжения <> Неопределено);
	
	ВесОбъемРаспоряженийПоДатам = Новый ТаблицаЗначений;
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Вес", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Объем", ОбщегоНазначения.ОписаниеТипаЧисло(18,6));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	
	КешДобавляемыхСтрок = Новый Массив;
	
	КоллекцияРаспоряжений = РаспоряженияНаДоставку.ПолучитьЭлементы();
	ВесОбъем = Новый Структура;
	
	Если Не ВыборочноеОбновление Тогда
		ВесОбъем.Вставить("ИтогоВес", 0);
		ВесОбъем.Вставить("ИтогоОбъем",0);
		КоллекцияРаспоряжений.Очистить();
		ТоварыРаспоряженийКДоставке.Очистить();
	Иначе
		СтруктураПоиска = Новый Структура("Склад, Распоряжение");
		
		Для Каждого Стр Из ОбновляемыеРаспоряжения Цикл
			
			// При выборочном обновлении сначала нужно удалить строки обновляемых распоряжений,
			// для этого воспользуемся списком товаров по распоряжениям.
			ПредыдущийИдентификатор = Неопределено;
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, Стр);
			
			НайденныеСтроки = ТоварыРаспоряженийКДоставке.НайтиСтроки(СтруктураПоиска);
			Для Каждого СтрокаТовары Из НайденныеСтроки Цикл
				Идентификатор = СтрокаТовары.ИдентификаторВДеревеРаспоряжений;
				Если ПредыдущийИдентификатор = Идентификатор
					Или Не ЗначениеЗаполнено(Идентификатор) Тогда
					Продолжить;
				КонецЕсли;
				СтрокаРаспоряжение = РаспоряженияНаДоставку.НайтиПоИдентификатору(Идентификатор);
				Если СтрокаРаспоряжение <> Неопределено Тогда
					Если ЗонаГруппаИлиПустая Тогда
						ТекущаяВетка = СтрокаРаспоряжение.ПолучитьРодителя();
						КоллекцияТекущаяВетка = ТекущаяВетка.ПолучитьЭлементы();
						// Если удаляем последний элемент в ветке, удалим родителя.
						Если КоллекцияТекущаяВетка.Количество() = 1 Тогда
							КоллекцияРаспоряжений.Удалить(ТекущаяВетка);
						Иначе
							ТекущаяВетка.Вес = ТекущаяВетка.Вес - СтрокаРаспоряжение.Вес;
							ТекущаяВетка.Объем = ТекущаяВетка.Объем - СтрокаРаспоряжение.Объем;
							КоллекцияТекущаяВетка.Удалить(СтрокаРаспоряжение);
						КонецЕсли;
					Иначе
						КоллекцияРаспоряжений.Удалить(СтрокаРаспоряжение);
					КонецЕсли;
				КонецЕсли;
				ТоварыРаспоряженийКДоставке.Удалить(СтрокаТовары);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	СтруктураЗадание = Новый Структура("ЗаданиеНаПеревозку", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураЗадание, Форма);
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "";
	
	
	//**Изменено Максимов
	ИсходящаяДоставка = ИСТИНА;//Форма.ВидДоставки = Перечисления.ВидыДоставки.СоСклада;
	//*******************
	ЕстьОрдерныйНаОтгрузкуСклад      = Ложь;
	ЕстьНеОрдерныйНаОтгрузкуСклад    = Ложь;
	ЕстьОрдерныйНаПоступлениеСклад   = Ложь;
	ЕстьНеОрдерныйНаПоступлениеСклад = Ложь;
	
	Если ИсходящаяДоставка Тогда
		ЕстьОрдерныйНаОтгрузкуСклад = СкладыСервер.ЕстьОрдерныйНаОтгрузкуСклад(Склад);
		ЕстьНеОрдерныйНаОтгрузкуСклад = СкладыСервер.ЕстьНеОрдерныйНаОтгрузкуСклад(Склад);
	КонецЕсли;
	
	Если ИсходящаяДоставка Тогда
		
		ТекстЗапроса = ТекстЗапросаРаспоряженияНаДоставку(ВыборочноеОбновление,
			ЕстьОрдерныйНаОтгрузкуСклад,
			ЕстьНеОрдерныйНаОтгрузкуСклад,
			Истина);
		
		Запрос.УстановитьПараметр("СпособыДоставкиНашимиСиламиКПолучателю", СпособыДоставкиНашимиСиламиКПолучателю());
		Запрос.УстановитьПараметр("СпособыДоставкиПеревозчикомКПолучателю", СпособыДоставкиПеревозчикомКПолучателю());
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	БезОтбораПоЗоне = Зона = Справочники.ЗоныДоставки.ПустаяСсылка();
	
	Запрос.УстановитьПараметр("Зона",                              Зона);
	Запрос.УстановитьПараметр("Склад",                             Склад);
	Запрос.УстановитьПараметр("БезОтбораПоЗоне",                   БезОтбораПоЗоне);
	Запрос.УстановитьПараметр("ОбновляемыеРаспоряжения",           ОбновляемыеРаспоряжения);
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозкуПодбор",          СтруктураЗадание.ЗаданиеНаПеревозку);
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозкуПустаяСсылка",    Документы.ЗаданиеНаПеревозку.ПустаяСсылка());
	Запрос.УстановитьПараметр("СтатусЗаданияЗакрыто",              Перечисления.СтатусыЗаданийНаПеревозку.Закрыто);
	Запрос.УстановитьПараметр("ОтборПоТипуИсполнителей",           ОтборПоТипуИсполнителей);
	Запрос.УстановитьПараметр("ТекущаяДатаСеанса",                 ТекущаяДатаСеанса());
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДвиженияКРаспределению = Пакет[Пакет.ВГраница()-1].Выгрузить();
	мТаблицаДоставок	   = Пакет[Пакет.ВГраница()].Выгрузить();
	ТаблицаДоставок		   = мТаблицаДоставок.СкопироватьКолонки();
	ТаблицаДоставок.Колонки.Добавить("ТипТранспортногоСредства", Новый ОписаниеТипов("СправочникСсылка.ТипыТранспортныхСредств"));
	ТаблицаДоставок.Колонки.Добавить("ЗаявкаНаДоставку", Новый ОписаниеТипов("ДокументСсылка._ЗаявкаНаДоставку"));
	
	ТаблицаРаспоряжений	   = Пакет[Пакет.ВГраница()].Выгрузить();
	ТаблицаРаспоряжений.Свернуть("Дата, Назначение, Склад, Распоряжение, ПолучательОтправитель, ВидРаспоряжения, Номер, СпособДоставки, Зона, ЗонаПредставление, ДополнительнаяИнформация, ОсобыеУсловияПеревозки, ОсобыеУсловияПеревозкиОписание");
	ТаблицаРаспоряжений.Колонки.Добавить("Номенклатура",   Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаРаспоряжений.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	
	ПоляОтбораДвиженийКРаспределению = "Распоряжение,Склад,Номенклатура,Характеристика,Назначение";
	Если ИсходящаяДоставка
		Или ЕстьОрдерныйНаПоступлениеСклад Тогда
		ДвиженияКРаспределению.Индексы.Добавить(ПоляОтбораДвиженийКРаспределению);
	КонецЕсли;
	
	Для Каждого СтрРаспоряжения Из ТаблицаРаспоряжений Цикл
		
		Если НЕ СтрРаспоряжения.ВидРаспоряжения = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			НайденныеСтрокиДоставки = ПолучитьСтрокиТаблицы(мТаблицаДоставок, СтрРаспоряжения, СтрРаспоряжения.Дата, Истина);
			Если НЕ НайденныеСтрокиДоставки = Неопределено Тогда
				Для Каждого тСтрока Из НайденныеСтрокиДоставки Цикл
					НоваяСтрокаДоставки = ТаблицаДоставок.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаДоставки, тСтрока);
				КонецЦикла;		// тСтрока Из НайденныеСтрокиДоставки  			
			КонецЕсли; 
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;		// СтрРаспоряжения Из ТаблицаРаспоряжений 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗаданиеНаПеревозкуРаспоряжения.Ссылка КАК Ссылка,
	               |	ЗаданиеНаПеревозкуРаспоряжения.НомерСтроки КАК НомерСтроки,
	               |	ЗаданиеНаПеревозкуРаспоряжения.КлючСвязи КАК КлючСвязи,
	               |	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение КАК Распоряжение,
	               |	ЗаданиеНаПеревозкуРаспоряжения.Вес КАК Вес,
	               |	ЗаданиеНаПеревозкуРаспоряжения.Объем КАК Объем,
	               |	ЗаданиеНаПеревозкуРаспоряжения.Перевозчик КАК Перевозчик,
	               |	ЗаданиеНаПеревозкуРаспоряжения.ПолучательОтправитель КАК ПолучательОтправитель,
	               |	ЗаданиеНаПеревозкуРаспоряжения.ВремяС КАК ВремяС,
	               |	ЗаданиеНаПеревозкуРаспоряжения.ВремяПо КАК ВремяПо,
	               |	ЗаданиеНаПеревозкуРаспоряжения.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	               |	ЗаданиеНаПеревозкуРаспоряжения.Доставлено КАК Доставлено,
	               |	ЗаданиеНаПеревозкуРаспоряжения.Склад КАК Склад,
	               |	ЗаданиеНаПеревозкуРаспоряжения.ДоставляетсяПолностью КАК ДоставляетсяПолностью,
	               |	ЗаданиеНаПеревозкуРаспоряжения._ЗаявкаНаДоставку КАК _ЗаявкаНаДоставку
	               |ИЗ
	               |	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	               |ГДЕ
	               |	НЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ПометкаУдаления
	               |	И ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Проведен
	               |	И НЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Статус = &СтатусЗаданияЗакрыто
	               |	И ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Дата > &ДатаАнализа
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Дата,
	               |	Распоряжение,
	               |	_ЗаявкаНаДоставку";
	
	
	Запрос.УстановитьПараметр("ДатаАнализа", 		  НачалоДня(ДобавитьМесяц(ТекущаяДата(), -3)));
	Запрос.УстановитьПараметр("СтатусЗаданияЗакрыто", Перечисления.СтатусыЗаданийНаПеревозку.Закрыто);
	ТаблицаПеревозок = Запрос.Выполнить().Выгрузить();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПоРасходнымОрдерам();
	
	Если ВыводитьВсе Тогда
		СтатусыОредров = Новый СписокЗначений;
		СтатусыОредров.Добавить(Перечисления.СтатусыРасходныхОрдеров.Подготовлен);
		СтатусыОредров.Добавить(Перечисления.СтатусыРасходныхОрдеров.КОтбору);
		СтатусыОредров.Добавить(Перечисления.СтатусыРасходныхОрдеров.КПроверке);
		СтатусыОредров.Добавить(Перечисления.СтатусыРасходныхОрдеров.ВПроцессеПроверки);
		СтатусыОредров.Добавить(Перечисления.СтатусыРасходныхОрдеров.Проверен);
		СтатусыОредров.Добавить(Перечисления.СтатусыРасходныхОрдеров.КОтгрузке);
	Иначе
		СтатусыОредров = Новый СписокЗначений;
		СтатусыОредров.Добавить(Перечисления.СтатусыРасходныхОрдеров.Проверен);
		СтатусыОредров.Добавить(Перечисления.СтатусыРасходныхОрдеров.КОтгрузке);
	КонецЕсли; 
		
	
	Запрос.УстановитьПараметр("Статус"		, СтатусыОредров);
	Запрос.УстановитьПараметр("Склад"		, Склад);
	Запрос.УстановитьПараметр("ДатаОтгрузки", КонецДня(ДатаРаспоряжений));
	Запрос.УстановитьПараметр("Действие", 	  Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить);
	
	Результат = Запрос.Выполнить();
	
	//Максимов
	ТаблицаДоставок.Колонки.Добавить("НужныДокументы");
	ВыборкаОрдера = Запрос.Выполнить().Выбрать();
	Пока ВыборкаОрдера.СледующийПоЗначениюПоля("Ордер") Цикл
		Пока ВыборкаОрдера.Следующий() Цикл
			Для Каждого Стр Из ВыборкаОрдера.ЗаявкаНаДоставку.Заказы Цикл				
												
				НоваяСтрокаДоставки = ТаблицаДоставок.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаДоставки, ВыборкаОрдера);
				НоваяСтрокаДоставки.СпособДоставки = ВыборкаОрдера.СособДоставки;
				НоваяСтрокаДоставки.ВремяС		   = ВыборкаОрдера.ВремяС;
				НоваяСтрокаДоставки.ВремяПо        = ВыборкаОрдера.ВремяПо;
				НоваяСтрокаДоставки.НужныДокументы = Стр.НужныДокументы;
				
				Если ВыборкаОрдера.Зона = Справочники.ЗоныДоставки.ПустаяСсылка() Тогда
					НоваяСтрокаДоставки.ЗонаПредставление = "<зона не указана>";
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;		// Выборка.Следующий()
	КонецЦикла;		// ВыборкаОрдера.Следующий()	
	
	//ВыборкаОрдера = Запрос.Выполнить().Выбрать();
	//Пока ВыборкаОрдера.СледующийПоЗначениюПоля("Ордер") Цикл
	//	Пока ВыборкаОрдера.Следующий() Цикл
	//		НоваяСтрокаДоставки = ТаблицаДоставок.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрокаДоставки, ВыборкаОрдера);
	//		НоваяСтрокаДоставки.СпособДоставки = ВыборкаОрдера.СособДоставки;
	//		НоваяСтрокаДоставки.ВремяС		   = ВыборкаОрдера.ВремяС;
	//		НоваяСтрокаДоставки.ВремяПо        = ВыборкаОрдера.ВремяПо;
	//		Если ВыборкаОрдера.Зона = Справочники.ЗоныДоставки.ПустаяСсылка() Тогда
	//			НоваяСтрокаДоставки.ЗонаПредставление = "<зона не указана>";
	//		КонецЕсли;
	//	КонецЦикла;		// Выборка.Следующий()
	//КонецЦикла;		// ВыборкаОрдера.Следующий()	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПоТаблицеДоставок();
	Запрос.УстановитьПараметр("ТаблицаДоставок", ТаблицаДоставок);
	
	Пакет = Запрос.Выполнить();
	Выборка = Пакет.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Зона") Цикл
		
		Если ВыборочноеОбновление Тогда
			ТекущаяВетка = КоллекцияРаспоряжений.Добавить();
			ТекущаяВетка.Адрес = Строка(Выборка.Зона);
			ТекущаяВетка.Зона = Выборка.Зона;
			КоллекцияТекущаяВетка = ТекущаяВетка.ПолучитьЭлементы();
			
		ИначеЕсли ЗонаГруппаИлиПустая Тогда
			ТекущаяВетка		  = КоллекцияРаспоряжений.Добавить();
			ТекущаяВетка.Адрес	  = Строка(Выборка.Зона);				// ?(Выборка.Зона = Справочники.ЗоныДоставки.ПустаяСсылка(), "<зона не указана>", Строка(Выборка.Зона)); 
			ТекущаяВетка.Зона	  = Выборка.Зона;
			КоллекцияТекущаяВетка = ТекущаяВетка.ПолучитьЭлементы();
			ТекущаяВетка.Картинка = 1;
		Иначе
			КоллекцияТекущаяВетка = КоллекцияРаспоряжений;
		КонецЕсли;
		ВесПоЗоне	= 0;
		ОбъемПоЗоне = 0;
		
		Пока Выборка.СледующийПоЗначениюПоля("Распоряжение") Цикл
			
			Если ТипЗнч(Выборка.Распоряжение) = Тип("ДокументСсылка.ПоручениеЭкспедитору") Тогда
				
				Если ЗначениеЗаполнено(ДатаРаспоряжений)
					И ЗначениеЗаполнено(Выборка.Дата)
					И НачалоДня(Выборка.Дата) > ДатаРаспоряжений Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаРаспоряжение = КоллекцияТекущаяВетка.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРаспоряжение, Выборка);
				СтрокаРаспоряжение.ПолучательОтправительПредставление = Выборка.ПолучательОтправитель;
				СтрокаРаспоряжение.Время = ДоставкаТоваровКлиентСервер.ПредставлениеВремениДоставки(Выборка.ВремяС, Выборка.ВремяПо);
				
				СтрокаДляХраненияИдентификатора = ТоварыРаспоряженийКДоставке.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДляХраненияИдентификатора, Выборка);
				СтрокаДляХраненияИдентификатора.ИдентификаторВДеревеРаспоряжений = СтрокаРаспоряжение.ПолучитьИдентификатор();
				СтрокаРаспоряжение.ВидРаспоряжения = ТипЗнч(Выборка.Распоряжение);
				Продолжить;
				
			КонецЕсли;
			
			Пока Выборка.СледующийПоЗначениюПоля("ЗаявкаНаДоставку") Цикл
				
				СтруктураПоиска = Новый Структура();
				СтруктураПоиска.Вставить("Распоряжение", Выборка.Распоряжение);
				Если ЗначениеЗаполнено(Выборка.ЗаявкаНаДоставку) Тогда
					СтруктураПоиска.Вставить("_ЗаявкаНаДоставку", Выборка.ЗаявкаНаДоставку);
				КонецЕсли;
				
				Если Выборка.ЗаявкаНаДоставку.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда
					Продолжить;
				КонецЕсли;
				
				НайденныеСтроки = ТаблицаПеревозок.НайтиСтроки(СтруктураПоиска);
				Если НайденныеСтроки.Количество() > 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Пока Выборка.СледующийПоЗначениюПоля("Склад") Цикл
					
					
					Номенклатура   = Неопределено;
					Характеристика = Неопределено;
					Назначение     = Неопределено;
					Серия          = Неопределено;
					
					ВесОбъемРаспоряженийПоДатам.Очистить();
					КешДобавляемыхСтрок.Очистить();
					ПотребностьПоТовару = 0;
					ПроверитьОтклонение = Ложь;
					
					Пока Выборка.Следующий() Цикл
						
						Если Номенклатура      <> Выборка.Номенклатура
							Или Характеристика <> Выборка.Характеристика
							Или Назначение     <> Выборка.Назначение
							Или Серия          <> Выборка.Серия Тогда
							// перешли к другому товару
							
							Номенклатура   = Выборка.Номенклатура;
							Характеристика = Выборка.Характеристика;
							Назначение     = Выборка.Назначение;
							Серия          = Выборка.Серия;
							
							Если ПроверитьОтклонение Тогда
								ДопустимоеОтклонение = ДопустимоеОтклонениеПроцент/100 * ПотребностьПоТовару;
								// Не нужно выводить строки с мерным товаром, если остаток к доставке не превысил допустимое отклонение;
								Для Каждого Стр Из КешДобавляемыхСтрок Цикл
									Если Стр.Количество <= ДопустимоеОтклонение Тогда
										ВесОбъемРаспоряженийПоДатам.Удалить(Стр);
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
							КешДобавляемыхСтрок.Очистить();
							ПотребностьПоТовару = 0;
							
							ПроверитьОтклонение = ?(Выборка.МернаяЕдиницаИзмерения = Неопределено, Ложь, Выборка.МернаяЕдиницаИзмерения) И ДопустимоеОтклонениеПроцент > 0;
							
						КонецЕсли;
						
						Если ИсходящаяДоставка Тогда
							
							ОсталосьРаспределить = Выборка.Количество;
							
							//ПараметрыОтбора = Новый Структура(ПоляОтбораДвиженийКРаспределению);
							//ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Выборка);
							//ДетальныеДанные = ДвиженияКРаспределению.НайтиСтроки(ПараметрыОтбора);
							//Для Каждого СтрокаДетальныхДанных Из ДетальныеДанные Цикл
							//	Списываем = Мин(ОсталосьРаспределить, СтрокаДетальныхДанных.Количество);
							//	ОсталосьРаспределить = ОсталосьРаспределить - Списываем;
							//	СтрокаДетальныхДанных.Количество = СтрокаДетальныхДанных.Количество - Списываем;
							//	
							//	Если ОсталосьРаспределить = 0 Тогда
							//		Прервать;
							//	КонецЕсли;
							//КонецЦикла;
							
							Если ОсталосьРаспределить > 0 Тогда
								ТекущаяСтрокаВесОбъем = ВесОбъемРаспоряженийПоДатам.Добавить();
								ЗаполнитьЗначенияСвойств(ТекущаяСтрокаВесОбъем, Выборка);
								ТекущаяСтрокаВесОбъем.Количество = ОсталосьРаспределить;
								ТекущаяСтрокаВесОбъем.Вес = ОсталосьРаспределить * (Выборка.Вес / Выборка.Количество);
								ТекущаяСтрокаВесОбъем.Объем = ОсталосьРаспределить * (Выборка.Объем / Выборка.Количество);
								
								КешДобавляемыхСтрок.Добавить(ТекущаяСтрокаВесОбъем);
								ПотребностьПоТовару = ПотребностьПоТовару + ОсталосьРаспределить;
							КонецЕсли;
							
						ИначеЕсли Не ЕстьОрдерныйНаПоступлениеСклад Тогда
							
							ТекущаяСтрокаВесОбъем = ВесОбъемРаспоряженийПоДатам.Добавить();
							ЗаполнитьЗначенияСвойств(ТекущаяСтрокаВесОбъем, Выборка);
							КешДобавляемыхСтрок.Добавить(ТекущаяСтрокаВесОбъем);
							ПотребностьПоТовару = ПотребностьПоТовару + Выборка.Количество;
							
						Иначе
							
							ПараметрыОтбора = Новый Структура(ПоляОтбораДвиженийКРаспределению);
							ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Выборка);
							ДетальныеДанные = ДвиженияКРаспределению.НайтиСтроки(ПараметрыОтбора);
							
							ОсталосьРаспределить = Выборка.Количество;
							// Распределение товаров по датам поступления;
							Для Каждого СтрокаДетальныхДанных Из ДетальныеДанные Цикл
								
								Списываем = Мин(ОсталосьРаспределить, СтрокаДетальныхДанных.Количество);
								ОсталосьРаспределить = ОсталосьРаспределить - Списываем;
								
								ТекущаяСтрокаВесОбъем = ВесОбъемРаспоряженийПоДатам.Добавить();
								ЗаполнитьЗначенияСвойств(ТекущаяСтрокаВесОбъем, Выборка,,"Количество,Вес,Объем");
								ТекущаяСтрокаВесОбъем.Дата = СтрокаДетальныхДанных.Период;
								ТекущаяСтрокаВесОбъем.Количество = Списываем;
								ТекущаяСтрокаВесОбъем.Вес = Списываем * СтрокаДетальныхДанных.Вес / СтрокаДетальныхДанных.Количество;
								ТекущаяСтрокаВесОбъем.Объем = Списываем * СтрокаДетальныхДанных.Объем / СтрокаДетальныхДанных.Количество;
								КешДобавляемыхСтрок.Добавить(ТекущаяСтрокаВесОбъем);
								
								Если ОсталосьРаспределить <= 0 Тогда
									Прервать;
								КонецЕсли;
								
							КонецЦикла;
							
							Если ОсталосьРаспределить > 0 Тогда
								ТекущаяСтрокаВесОбъем = ВесОбъемРаспоряженийПоДатам.Добавить();
								ЗаполнитьЗначенияСвойств(ТекущаяСтрокаВесОбъем, Выборка,,"Количество,Вес,Объем");
								ТекущаяСтрокаВесОбъем.Дата = НачалоДня(ТекущаяДатаСеанса());
								ТекущаяСтрокаВесОбъем.Количество = ОсталосьРаспределить;
								ТекущаяСтрокаВесОбъем.Вес = ОсталосьРаспределить 	* Выборка.Вес 	/ Выборка.Количество;
								ТекущаяСтрокаВесОбъем.Объем = ОсталосьРаспределить 	* Выборка.Объем / Выборка.Количество;
								КешДобавляемыхСтрок.Добавить(ТекущаяСтрокаВесОбъем);
							КонецЕсли;
							ПотребностьПоТовару = ПотребностьПоТовару + Выборка.Количество;
						КонецЕсли;
					КонецЦикла;
					
					// Нужно проверить последний добавленный товар распоряжения;
					Если ПроверитьОтклонение Тогда
						ДопустимоеОтклонение = ДопустимоеОтклонениеПроцент/100 * ПотребностьПоТовару;
						// Не нужно выводить строки с мерным товаром, если остаток к доставке не превысил допустимое отклонение;
						Для Каждого Стр Из КешДобавляемыхСтрок Цикл
							Если Стр.Количество <= ДопустимоеОтклонение Тогда
								ВесОбъемРаспоряженийПоДатам.Удалить(Стр);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
					ВесОбъемРаспоряженийПоДатам.Сортировать("Дата");
					
					ТекущаяДата = Неопределено;
					
					Для Каждого СтрокаВесОбъемДата Из ВесОбъемРаспоряженийПоДатам Цикл
						
						Если ЗначениеЗаполнено(ДатаРаспоряжений)
							И СтрокаВесОбъемДата.Дата > ДатаРаспоряжений Тогда
							Прервать;
						КонецЕсли;
						
						СтрокаТовар = ТоварыРаспоряженийКДоставке.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТовар, Выборка);
						ЗаполнитьЗначенияСвойств(СтрокаТовар, СтрокаВесОбъемДата);
						
						Если ТекущаяДата <> СтрокаВесОбъемДата.Дата Тогда
							
							ТекущаяДата = СтрокаВесОбъемДата.Дата;
							
							СтрокаРаспоряжение = КоллекцияТекущаяВетка.Добавить();
							
							ЗаполнитьЗначенияСвойств(СтрокаРаспоряжение, Выборка);
							
							Если СтрокаРаспоряжение.Свойство("АдресДоставкиЗначенияПолей") Тогда
								СтрокаРаспоряжение.АдресДоставкиЗначенияПолей = Выборка.АдресЗначенияПолей;
							КонецЕсли;
							
							СтрокаРаспоряжение.Дата = ТекущаяДата;
							СтрокаРаспоряжение.Вес = 0;
							СтрокаРаспоряжение.Объем = 0;
							
							СтрокаРаспоряжение.ПолучательОтправительПредставление = ДоставкаТоваровКлиентСервер.ПредставлениеПолучателяОтправителя(Выборка.ПолучательОтправитель, Выборка.Перевозчик, Форма.ВидДоставки);
							СтрокаРаспоряжение.Время = ДоставкаТоваровКлиентСервер.ПредставлениеВремениДоставки(Выборка.ВремяС, Выборка.ВремяПо);
							
							ИдентификаторВДеревеРаспоряжений = СтрокаРаспоряжение.ПолучитьИдентификатор();
							
						КонецЕсли;
						
						СтрокаТовар.ИдентификаторВДеревеРаспоряжений = ИдентификаторВДеревеРаспоряжений;
						
						СтрокаРаспоряжение.Вес						 = СтрокаРаспоряжение.Вес + СтрокаВесОбъемДата.Вес;
						СтрокаРаспоряжение.Объем					 = СтрокаРаспоряжение.Объем + СтрокаВесОбъемДата.Объем;
						
						ВесПоЗоне  									 = ВесПоЗоне   + СтрокаВесОбъемДата.Вес;
						ОбъемПоЗоне									 = ОбъемПоЗоне + СтрокаВесОбъемДата.Объем;
						
						СтрокаРаспоряжение.ВидРаспоряжения			 = ТипЗнч(Выборка.Распоряжение);
						СтрокаРаспоряжение.ТипТранспортногоСредства  = Выборка.ТипТранспортногоСредства;
						СтрокаРаспоряжение.ЗаявкаНаДоставкуНомер	 = ?(ЗначениеЗаполнено(Выборка.ЗаявкаНаДоставку), Выборка.ЗаявкаНаДоставку.Номер, "");
					КонецЦикла;		// Выборка.Следующий()
					
				КонецЦикла;		// СтрокаРаспоряжение.ВидРаспоряжения.СледующийПоЗначениюПоля("Склад")
			КонецЦикла;		// Выборка.СледующийПоЗначениюПоля("ЗаявкаНаДоставку") 
			
		КонецЦикла;		// Выборка.СледующийПоЗначениюПоля("Распоряжение")
		
		Если Не ВыборочноеОбновление Тогда
			ВесОбъем.ИтогоВес = ВесОбъем.ИтогоВес + ВесПоЗоне;
			ВесОбъем.ИтогоОбъем = ВесОбъем.ИтогоОбъем  + ОбъемПоЗоне;
		КонецЕсли;
		
		Если ЗонаГруппаИлиПустая Тогда
			
			Если КоллекцияТекущаяВетка.Количество() = 0 Тогда
				КоллекцияРаспоряжений.Удалить(ТекущаяВетка);
			Иначе
				Если ВыборочноеОбновление Тогда
					ТекущаяВетка.Вес   = ТекущаяВетка.Вес + ВесПоЗоне;
					ТекущаяВетка.Объем = ТекущаяВетка.Объем + ОбъемПоЗоне;
				Иначе
					ТекущаяВетка.Вес   = ВесПоЗоне;
					ТекущаяВетка.Объем = ОбъемПоЗоне;
				КонецЕсли;
				ТекущаяВетка.ОформлениеСтроки = 5;
				ТекущаяВетка.Зона = Выборка.Зона;
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла;		// Выборка.СледующийПоЗначениюПоля("Зона")
	
	ЗаполнитьЗначенияСвойств(Форма, ВесОбъем);
	ЗаполнитьПризнакиОформленияРаспоряжений(РаспоряженияНаДоставку, ЗонаГруппаИлиПустая);
	
КонецПроцедуры

// Заполняет признаки оформления в дереве распоряжений на доставку.
// Параметры:
//	РаспоряженияНаДоставку - ДанныеФормыДерево - распоряжения на доставку,
//  ЗонаГруппаИлиПустая - Булево - признак того, что в отборе по зоне доставки установлена группа или этот отбор не заполнен.
//
Процедура ЗаполнитьПризнакиОформленияРаспоряжений(РаспоряженияНаДоставку, ЗонаГруппаИлиПустая) Экспорт
	
	ВерхниеСтрокиДерева = РаспоряженияНаДоставку.ПолучитьЭлементы();
	Если ЗонаГруппаИлиПустая Тогда
		Для каждого СтрокаЗонаДоставки Из ВерхниеСтрокиДерева Цикл
			ЗаполнитьПризнакиОформленияРаспоряженийНижнийУровень(СтрокаЗонаДоставки.ПолучитьЭлементы())
		КонецЦикла;
	Иначе
		ЗаполнитьПризнакиОформленияРаспоряженийНижнийУровень(ВерхниеСтрокиДерева)
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПризнакиОформленияРаспоряженийНижнийУровень(КоллекцияСтрокДерева)
	
	//ПредыдущийАдресИлиПеревозчик = Неопределено;
	//Подсвечиваем = 0;
	//Для каждого Строка Из КоллекцияСтрокДерева Цикл
	//	Если (Строка.ПолеУпорядочения <> ПредыдущийАдресИлиПеревозчик)
	//		И (ПредыдущийАдресИлиПеревозчик <> Неопределено) Тогда
	//		Подсвечиваем = Макс(Подсвечиваем-1,-Подсвечиваем+1);
	//	КонецЕсли;
	//	Строка.ОформлениеСтроки = Подсвечиваем;
	//	ПредыдущийАдресИлиПеревозчик = Строка.ПолеУпорядочения;
	//КонецЦикла;
	ПредыдущийАдресИлиПеревозчик = Неопределено;
	Подсвечиваем = 0;
	Для каждого Строка Из КоллекцияСтрокДерева Цикл
		//Максимов
		Для Каждого Стр Из Строка.ЗаявкаНаДоставку.Заказы Цикл;
			Строка.НужныДокументы = Стр.НужныДокументы;
		КонецЦикла;	
		Если (Строка.ПолеУпорядочения <> ПредыдущийАдресИлиПеревозчик)
			И (ПредыдущийАдресИлиПеревозчик <> Неопределено) Тогда
			Подсвечиваем = Макс(Подсвечиваем-1,-Подсвечиваем+1);
		КонецЕсли;
		Строка.ОформлениеСтроки = Подсвечиваем;
		ПредыдущийАдресИлиПеревозчик = Строка.ПолеУпорядочения;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
//== Сухарев Б.В

