#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриОткрытииНаСервере()

	ТекЗапись = РеквизитФормыВЗначение("Запись");	
	ТекРасписание = ТекЗапись.Расписание.Получить();
	Если ТекРасписание = Неопределено тогда
    	ТекРасписание = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;      

	Расписание = Строка(ТекРасписание);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере(); 
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура РасписаниеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекРасписание = РасписаниеНаСервере(); 
	ДиалогРедактированияРасписания = Новый ДиалогРасписанияРегламентногоЗадания(ТекРасписание);
	ОП = Новый ОписаниеОповещения("ПослеРедактированияРасписания", ЭтотОбъект);
	ДиалогРедактированияРасписания.Показать(ОП);
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция РасписаниеНаСервере()
	
	ТекЗапись = РеквизитФормыВЗначение("Запись");	
	ТекРасписание = ТекЗапись.Расписание.Получить();
	Если ТекРасписание = Неопределено тогда
    	ТекРасписание = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;      
	
	Возврат ТекРасписание;
	
КонецФункции

&НаКлиенте
Процедура ПослеРедактированияРасписания(РедРасписание, ДопПараметры) Экспорт

	РасписаниеВОбъектНаСервере(РедРасписание);
	Расписание = Строка(РедРасписание);

КонецПроцедуры    

&НаСервере
Процедура РасписаниеВОбъектНаСервере(РедРасписание)

	ТекЗапись = РеквизитФормыВЗначение("Запись");
	ТекЗапись.Расписание = Новый ХранилищеЗначения(РедРасписание);   
	ТекЗапись.Записать();
	ЗначениеВРеквизитФормы(ТекЗапись, "Запись");	
	
КонецПроцедуры



#КонецОбласти



