
&ИзменениеИКонтроль("ЗаполнитьВидыЗапасовПоТаблицеОстатковСформироватьВТНовыеРезервы")
Процедура Кт_ЗаполнитьВидыЗапасовПоТаблицеОстатковСформироватьВТНовыеРезервы(ДокументОбъект, МенеджерВременныхТаблиц, Отказ, ПараметрыЗаполненияВидовЗапасов)
	
	ТаблицаОшибок			= ТаблицаОшибокЗаполненияВидовЗапасов();
	ДополнительныеСвойства	= ДокументОбъект.ДополнительныеСвойства;
	
	Если ПараметрыЗаполненияВидовЗапасов.ТаблицаВидыЗапасов <> Неопределено Тогда
		ТаблицаВидыЗапасов = ПараметрыЗаполненияВидовЗапасов.ТаблицаВидыЗапасов;
	Иначе
		ТаблицаВидыЗапасов = ДокументОбъект[ПараметрыЗаполненияВидовЗапасов.ИмяТЧВидыЗапасов].ВыгрузитьКолонки();
	КонецЕсли;
	
	КонтролироватьИзменениеНомеровГТД = ДополнительныеСвойства.Свойство("КонтролироватьИзменениеНомеровГТД");
	
	Если КонтролироватьИзменениеНомеровГТД Тогда
		ТаблицаНомеровГТД = ТаблицаВидыЗапасов.Скопировать(, "АналитикаУчетаНоменклатуры, НомерГТД, Количество"); // ТаблицаЗначений
	КонецЕсли;
	
	ВидЗапасовПоУмолчанию	= Неопределено;
	ТаблицаНовыеРезервы		= РегистрыНакопления.РезервыТоваровОрганизаций.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	ПриНехваткеТоваровОрганизацииЗаполнятьВидамиЗапасовПоУмолчанию =
		ПриНехваткеТоваровОрганизацииЗаполнятьВидамиЗапасовПоУмолчанию(ПараметрыЗаполненияВидовЗапасов);
	ИгнорироватьКонтрольТоваровОрганизацийПриЗапретеЗаполненияПоУмолчанию = 
		Не ПриНехваткеТоваровОрганизацииЗаполнятьВидамиЗапасовПоУмолчанию
		И ПараметрыЗаполненияВидовЗапасов.ИгнорироватьКонтрольТоваровОрганизацийПриЗапретеЗаполненияПоУмолчанию;
	
	СтруктураДанныхСтроки = Новый Структура("
		|Склад,
		|Количество,
		|КоличествоПоРНПТ,
		|СуммаСНДС,
		|СтавкаНДС,
		|СуммаНДС,
		|СуммаВознаграждения,
		|СуммаНДСВознаграждения,
		|АналитикаУчетаНоменклатурыОтгрузки,
		|ВидЗапасовОтгрузки,
		|КорВидЗапасов,
		|ДокументПередачи,
		|ЗаказКлиента,
		|НедостаточноОстатковТоваровОрганизаций");
	
	СтруктураВидаЗапасовПоУмолчанию = Новый Структура("
		|ГруппаФинансовогоУчета,
		|ВладелецТовара,
		|Контрагент,
		|Соглашение,
		|Договор,
		|Валюта,
		|НалогообложениеНДС,
		|НалогообложениеОрганизации,
		|ТипЗапасов,
		|ВидЦены");
	
	КлючПоискаОстатков =
		"Приоритет,
		|ВидЗапасов,
		|АналитикаУчетаНоменклатуры,
		|ПорядокОформленияСписанияНедостачТоваровПринятыхНаХранение,
		|НомерГТД,
		|ОрганизацияОтгрузки,
		|ОрганизацияОстатка,
		|ДатаПоступления,
		|ДокументПередачи,
		|АналитикаУчетаНоменклатурыОтгрузки,
		|ВидЗапасовОтгрузки,
		|КорВидЗапасов";
	
	Запрос = ЗапросРаспределенияСУчетомПриоритетовТаблицыТоваровНаТаблицуОстатков(МенеджерВременныхТаблиц,
																					ДополнительныеСвойства);
	
	МассивРезультатов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	// В УТ и КА часть запросов вырезается, поэтому корректируем номера пакетов.
	ИндексНеУТКА = 1;
	
	ВыборкаДанныеДокумента	= МассивРезультатов[2 - ИндексНеУТКА].Выбрать();
	ВыборкаТаблицаТоваров	= МассивРезультатов[3 - ИндексНеУТКА].Выбрать();
	ТаблицаОстатков			= МассивРезультатов[5 - ИндексНеУТКА].Выгрузить(); // ТаблицаЗначений -
	ВыборкаОстаткиПоСтрокам	= МассивРезультатов[6 - ИндексНеУТКА].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Запрос.Текст = "УНИЧТОЖИТЬ ВтОстатки";
	Запрос.Выполнить();
	
	ВыборкаДанныеДокумента.Следующий();
	ЗаполнитьЗначенияСвойств(СтруктураВидаЗапасовПоУмолчанию, ВыборкаДанныеДокумента);
	
	Организация             = ВыборкаДанныеДокумента.Организация;
	ХозяйственнаяОперация   = ВыборкаДанныеДокумента.ХозяйственнаяОперация;
	ПередачаПодДеятельность = ВыборкаДанныеДокумента.НалогообложениеНДС;
	
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов Тогда
			
		ТекстИсключения = НСтр("ru = 'Функция %Функция% не предназначена для вызова с хозяйственной операцией %ХозяйственнаяОперация%'");
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%Функция%", "ЗаполнитьВидыЗапасовПоТаблицеОстатковСформироватьВТНовыеРезервы");
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ХозяйственнаяОперация%", ХозяйственнаяОперация);
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
	ОрганизацииВидовЗапасов = ТаблицаОстатков.ВыгрузитьКолонку("ОрганизацияВидаЗапасов");
	
	ТаблицаОстатков.Колонки.Добавить("ОрганизацияОстатка", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаОстатков.ЗагрузитьКолонку(ОрганизацииВидовЗапасов, "ОрганизацияОстатка");
	ТаблицаОстатков.Колонки.Удалить("ОрганизацияВидаЗапасов");
	ТаблицаОстатков.Индексы.Добавить(КлючПоискаОстатков);
	
	ВидыЗапасовПоУмолчанию = Новый ТаблицаЗначений;
	ВидыЗапасовПоУмолчанию.Колонки.Добавить("ВидЗапасов",
											Новый ОписаниеТипов("СправочникСсылка.ВидыЗапасов"));
	ВидыЗапасовПоУмолчанию.Колонки.Добавить("ВидЦены",
											Новый ОписаниеТипов("СправочникСсылка.ВидыЦенПоставщиков"));
	ВидыЗапасовПоУмолчанию.Колонки.Добавить("ГруппаФинансовогоУчета",
											Новый ОписаниеТипов("СправочникСсылка.ГруппыФинансовогоУчетаНоменклатуры"));
	
	ПроводитьБезКонтроляОстатковТоваровОрганизаций = ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций
														Или Не Константы.КонтролироватьОстаткиТоваровОрганизаций.Получить();
	
	РазрешитьОформлениеВыпускаЗаднимЧислом = ПраваПользователяПовтИсп.РазрешитьОформлениеВыпускаЗаднимЧислом();
	
	Пока ВыборкаОстаткиПоСтрокам.Следующий() Цикл
		
		#Удаление
		КоличествоТовара			= ВыборкаОстаткиПоСтрокам.Количество;
		#КонецУдаления
		#Вставка
		//**Изменено Максимов												
		Если ВыборкаОстаткиПоСтрокам.Количество >= ВыборкаОстаткиПоСтрокам.КоличествоОстаток 
			И НЕ ВыборкаОстаткиПоСтрокам.КоличествоОстаток = 0 Тогда
			КоличествоТовара		= ВыборкаОстаткиПоСтрокам.КоличествоОстаток;
		Иначе	
			КоличествоТовара		= ВыборкаОстаткиПоСтрокам.Количество;
		КонецЕсли;	
		//*******************		
		#КонецВставки
		КоличествоТовараПоРНПТ		= ВыборкаОстаткиПоСтрокам.КоличествоПоРНПТ;
		СуммаТовараСНДС				= ВыборкаОстаткиПоСтрокам.СуммаСНДС;
		СуммаНДСТовара				= ВыборкаОстаткиПоСтрокам.СуммаНДС;
		СуммаВознагражденияВсего	= ВыборкаОстаткиПоСтрокам.СуммаВознаграждения;
		СуммаНДСВознагражденияВсего	= ВыборкаОстаткиПоСтрокам.СуммаНДСВознаграждения;
		
		ЕстьКоличествоПоРНПТ = КоличествоТовараПоРНПТ <> 0;
		
		// Детальные записи
		Выборка = ВыборкаОстаткиПоСтрокам.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ПродажаНаЭкспортКомиссионногоТовара = Ложь;
			
			ЗаполнитьСтруктуруПоСтрокеТоваров(СтруктураВидаЗапасовПоУмолчанию, Выборка, ВыборкаДанныеДокумента);
			
			Если ЗначениеЗаполнено(Выборка.ВидЗапасов) Тогда
				
				ПодбиратьВТЧТоварыПринятыеНаОтветственноеХранение =
					ПодбиратьВТЧТоварыПринятыеНаОтветственноеХранение(
						ПараметрыЗаполненияВидовЗапасов,
						Выборка);
				
				Если (Выборка.ОрганизацияОстатка = Организация
						Или Ложь)
					И (ПодбиратьВТЧТоварыПринятыеНаОтветственноеХранение = Неопределено
						Или (ВРег(ПодбиратьВТЧТоварыПринятыеНаОтветственноеХранение) = ВРег("ПоНастройкамДоговора")
									И Выборка.ПорядокОформленияСписанияНедостачТоваровПринятыхНаХранение =
										Перечисления.ПорядокОформленияСписанияТоваровПринятыхНаХранение.ОформлятьСписание)
							Или ВРег(ПодбиратьВТЧТоварыПринятыеНаОтветственноеХранение) = ВРег("Всегда")) Тогда
					
					ВидЗапасов = Выборка.ВидЗапасов;
					
				ИначеЕсли Выборка.НастройкаПередачи = Перечисления.СпособыПередачиТоваров.ПередачаНаКомиссию
					И ПередачаПодДеятельность <> Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт
					И ПередачаПодДеятельность <> Перечисления.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров
					И ПередачаПодДеятельность <> Перечисления.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг Тогда
					
					// Должен быть сгенерирован комиссионный товар,
					// остатки по которому позже будут закрыты документом передачи на комиссию.
					Если Выборка.НовыйВидЗапасовЭтоСубкомиссия Тогда
						// сохраняется исходное налогообложение, под которое был принят товар на комиссию
						НалогообложениеКомиссионногоВидаЗапасов = Выборка.НовыйВидЗапасовНалогообложениеКомитента;
					Иначе
						
						// налогообложение определяется по организации-комитенту.
						ПараметрыУчетаПоОрганизации = УчетНДСУП.ПараметрыУчетаПоОрганизации(
														Выборка.НовыйВидЗапасовВладелецТовара,
														ДокументОбъект.Дата);
						
						НалогообложениеКомиссионногоВидаЗапасов = ПараметрыУчетаПоОрганизации.ОсновноеНалогообложениеНДСПродажи;
						
					КонецЕсли;
					
					СтруктураВидаЗапасовПоУмолчанию.НалогообложениеНДС = НалогообложениеКомиссионногоВидаЗапасов;
					
					ВидЗапасов = Справочники.ВидыЗапасов.ВидЗапасовДокумента(
									Организация,
									Перечисления.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию,
									СтруктураВидаЗапасовПоУмолчанию);
					
				ИначеЕсли Выборка.НастройкаПередачи = Перечисления.СпособыПередачиТоваров.Продажа Тогда
					
					ВидЗапасов = Справочники.ВидыЗапасов.ВидЗапасовДокумента(
									Организация,
									Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию,
									СтруктураВидаЗапасовПоУмолчанию);
					
				ИначеЕсли Выборка.ОрганизацияОстатка = Организация
					И ЗначениеЗаполнено(Выборка.ВладелецТовара) Тогда
					
					ВидЗапасов = Справочники.ВидыЗапасов.ВидЗапасовДокумента(
									Организация,
									Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию,
									СтруктураВидаЗапасовПоУмолчанию);
					
				Иначе // при настройках интеркампани - передача на комиссию, нельзя продавать на экспорт.
					ВидЗапасов = Справочники.ВидыЗапасов.ПустаяСсылка();
					ПродажаНаЭкспортКомиссионногоТовара = Истина;
				КонецЕсли;
				
			Иначе
				ВидЗапасов = Справочники.ВидыЗапасов.ПустаяСсылка();
			КонецЕсли;
			
			КоличествоОстаток				= Выборка.КоличествоОстаток;
			КоличествоОстатокВсего			= Выборка.КоличествоОстатокВсего;
			КоличествоПоРНПТОстатокВсего	= Выборка.КоличествоПоРНПТОстатокВсего;
			СуммаОстаток					= Выборка.СуммаОстаток;
			НеУказанНомерГТД				= Ложь;
			ПрослеживаемыйТовар				= Ложь;
			
			ОтборОстатков = Новый Структура(КлючПоискаОстатков);
			ЗаполнитьЗначенияСвойств(ОтборОстатков, Выборка);
			
			Для Каждого КлючИЗначение Из ОтборОстатков Цикл
				Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
					ОтборОстатков[КлючИЗначение.Ключ] = ТаблицаОстатков.Колонки[КлючИЗначение.Ключ].ТипЗначения.ПривестиЗначение();
				КонецЕсли;
			КонецЦикла;
			
			СтрокиОстатков			= ТаблицаОстатков.НайтиСтроки(ОтборОстатков);
			ТекущаяСтрокаОстатков	= Неопределено;
			
			Если СтрокиОстатков.Количество() > 0 Тогда
				
				НайденМинимальныйОстаток = Ложь;
				
				Для Каждого СтрокаОстатков Из СтрокиОстатков Цикл
					Если (КоличествоОстаток > 0
							И СтрокаОстатков.КоличествоОстаток > 0)
						Или (КоличествоОстаток < 0
							И СтрокаОстатков.КоличествоОстаток < 0) Тогда
						
						Если КоличествоОстаток > 0 Тогда
							КоличествоОстаток = Мин(СтрокаОстатков.КоличествоОстаток, КоличествоОстаток);
						Иначе
							КоличествоОстаток = Макс(СтрокаОстатков.КоличествоОстаток, КоличествоОстаток);
						КонецЕсли;
						
						НайденМинимальныйОстаток	= Истина;
						ТекущаяСтрокаОстатков		= СтрокаОстатков;
						
						Прервать;
						
					КонецЕсли;
				КонецЦикла;
				
				Если Не НайденМинимальныйОстаток Тогда
					КоличествоОстаток = 0;
				КонецЕсли;
				
			КонецЕсли;
			
			Если (ЗначениеЗаполнено(ВидЗапасов)
					И Выборка.ВидЗапасов <> ВидЗапасов
					И СтруктураВидаЗапасовПоУмолчанию.ТипЗапасов = Перечисления.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
				// По ТоварНаХраненииСПравомПродажи не может быть прихода резерва
				Или Выборка.НеУказанНомерГТД
				Или ПродажаНаЭкспортКомиссионногоТовара Тогда
				
				КоличествоОстаток				= 0;
				КоличествоОстатокВсего			= 0;
				КоличествоПоРНПТОстатокВсего	= 0;
				СуммаОстаток					= 0;
				НеУказанНомерГТД				= Выборка.НеУказанНомерГТД;
				ПрослеживаемыйТовар				= Выборка.ПрослеживаемыйТовар;
				
			ИначеЕсли (КоличествоТовара > 0
					И КоличествоОстаток > 0)
				Или (КоличествоТовара < 0
					И КоличествоОстаток < 0) Тогда
				
				НоваяСтрока = ТаблицаВидыЗапасов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				
				Если ЗначениеЗаполнено(ВидЗапасов) Тогда
					НоваяСтрока.ВидЗапасов = ВидЗапасов;
				Иначе
					ТекстИсключения = НСтр("ru = 'Ненулевое количество при пустом виде запасов.'");
					
					ВызватьИсключение ТекстИсключения;
				КонецЕсли;
				
				Если КоличествоТовара > 0 Тогда
					
					Количество = Мин(КоличествоТовара, КоличествоОстаток);
					
					Если СуммаОстаток <> 0 Тогда
						СуммаОстаток	= Макс(СуммаОстаток, 0);
						СуммаСНДС		= ?(КоличествоОстаток = Количество,
											СуммаОстаток,
											Мин(СуммаТовараСНДС, СуммаОстаток));
					Иначе
						СуммаСНДС = ?(КоличествоТовара <> 0,
										Окр(Количество * СуммаТовараСНДС / КоличествоТовара, 2, 1),
										0);
					КонецЕсли;
					
				Иначе
					
					Количество = Макс(КоличествоТовара, КоличествоОстаток);
					
					Если СуммаОстаток <> 0 Тогда
						СуммаОстаток = Мин(СуммаОстаток, 0);
						СуммаСНДС = ?(КоличествоОстаток = Количество,
										СуммаОстаток,
										Макс(СуммаТовараСНДС, СуммаОстаток));
					Иначе
						СуммаСНДС = ?(КоличествоТовара <> 0,
										Окр(Количество * СуммаТовараСНДС / КоличествоТовара, 2, 1),
										0);
					КонецЕсли;
					
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(СтруктураДанныхСтроки, Выборка);
				
				СтруктураДанныхСтроки.Количество				= Количество;
				СтруктураДанныхСтроки.КоличествоПоРНПТ			= ?(КоличествоОстатокВсего <> 0,
																	?(КоличествоОстатокВсего - Количество = 0,
																		КоличествоПоРНПТОстатокВсего,
																		Количество * КоличествоПоРНПТОстатокВсего / КоличествоОстатокВсего),
																	0);
				СтруктураДанныхСтроки.СуммаСНДС					= СуммаСНДС;
				СтруктураДанныхСтроки.СуммаНДС					= ?(СуммаТовараСНДС <> 0,
																	Окр(СуммаСНДС * СуммаНДСТовара / СуммаТовараСНДС, 2, 1),
																	0);
				СтруктураДанныхСтроки.СуммаВознаграждения		= ?(КоличествоТовара <> 0,
																	Окр(Количество * СуммаВознагражденияВсего / КоличествоТовара, 2, 1),
																	0);
				СтруктураДанныхСтроки.СуммаНДСВознаграждения	= ?(КоличествоТовара <> 0,
																	Окр(Количество * СуммаНДСВознагражденияВсего / КоличествоТовара, 2, 1),
																	0);
				СтруктураДанныхСтроки.НедостаточноОстатковТоваровОрганизаций = Ложь;
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанныхСтроки);
				
				// Для товаров, выкупаемых по интеркампани, формируются движения по Резервам.
				Если Выборка.ВидЗапасов <> ВидЗапасов Тогда
					
					ДвижениеРезерваПродавца = ТаблицаНовыеРезервы.Добавить();
					ЗаполнитьЗначенияСвойств(ДвижениеРезерваПродавца, НоваяСтрока);
					
					ДвижениеРезерваПродавца.ВидДвижения		= ВидДвиженияНакопления.Приход;
					ДвижениеРезерваПродавца.Период			= КонецМесяца(ВыборкаДанныеДокумента.Период);
						ДвижениеРезерваПродавца.Организация		= Организация;
					ДвижениеРезерваПродавца.КорОрганизация	= Выборка.ОрганизацияОстатка;
					ДвижениеРезерваПродавца.КорВидЗапасов	= Выборка.ВидЗапасов;
					
					РегистрыНакопления.РезервыТоваровОрганизаций.ДобавитьВНаборРезерваКорЗапись(ТаблицаНовыеРезервы,
																								ДвижениеРезерваПродавца);
					
				КонецЕсли;
				
				КоличествоТовара			= КоличествоТовара				- СтруктураДанныхСтроки.Количество;
				Если ЕстьКоличествоПоРНПТ Тогда
					КоличествоТовараПоРНПТ = КоличествоТовараПоРНПТ - СтруктураДанныхСтроки.КоличествоПоРНПТ;
				КонецЕсли;
				СуммаТовараСНДС				= СуммаТовараСНДС				- СтруктураДанныхСтроки.СуммаСНДС;
				СуммаНДСТовара				= СуммаНДСТовара				- СтруктураДанныхСтроки.СуммаНДС;
				СуммаВознагражденияВсего	= СуммаВознагражденияВсего		- СтруктураДанныхСтроки.СуммаВознаграждения;
				СуммаНДСВознагражденияВсего	= СуммаНДСВознагражденияВсего	- СтруктураДанныхСтроки.СуммаНДСВознаграждения;
				
				Если ТекущаяСтрокаОстатков <> Неопределено Тогда
					ТекущаяСтрокаОстатков.КоличествоОстаток = ТекущаяСтрокаОстатков.КоличествоОстаток - СтруктураДанныхСтроки.Количество;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла; // Выборка по остаткам
		
		Если КоличествоТовара <> 0
			Или СуммаТовараСНДС <> 0 Тогда
			
			Если ПриНехваткеТоваровОрганизацииЗаполнятьВидамиЗапасовПоУмолчанию
					Или (ПроводитьБезКонтроляОстатковТоваровОрганизаций
						И Не ИгнорироватьКонтрольТоваровОрганизацийПриЗапретеЗаполненияПоУмолчанию)
					// Если у пользователя есть соответствующая роль, то потребление работ не контролируется
					Или (РазрешитьОформлениеВыпускаЗаднимЧислом
						И ВыборкаОстаткиПоСтрокам.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа) Тогда
				
				Если Не ПараметрыЗаполненияВидовЗапасов.ВладелецТовараВШапке
					И ПараметрыЗаполненияВидовЗапасов.ТаблицаРеквизитовВидовЗапасовПоУмолчанию.Количество() = 0 Тогда
					
					ТекстИсключения = НСтр("ru = 'Установлен флаг получения владельца товаров из таблицы
												|реквизитов видов запасов по умолчанию, но таблица не передана.'");
					
					ВызватьИсключение ТекстИсключения;
					
				КонецЕсли;
				
				ВыборкаТаблицаТоваров.Сбросить();
				ВидыЗапасовПоУмолчанию.Очистить();
				
				ОтборСтрок = Новый Структура("НомерСтроки", ВыборкаОстаткиПоСтрокам.НомерСтроки);
				
				Если ВыборкаТаблицаТоваров.НайтиСледующий(ОтборСтрок) Тогда
					
					ВидЦены = ВыборкаТаблицаТоваров.ВидЦены;
					ГруппаФинансовогоУчета = ВыборкаТаблицаТоваров.ГруппаФинансовогоУчета;
					
					Если ПараметрыЗаполненияВидовЗапасов.ВладелецТовараВШапке Тогда
						
						Отбор = Новый Структура("ВидЦены, ГруппаФинансовогоУчета", ВидЦены, ГруппаФинансовогоУчета);
						СтрокиВидовЗапасовПоУмолчанию = ВидыЗапасовПоУмолчанию.НайтиСтроки(Отбор);
						
						Если СтрокиВидовЗапасовПоУмолчанию.Количество() = 0 Тогда
							
							ЗаполнитьЗначенияСвойств(СтруктураВидаЗапасовПоУмолчанию, Отбор);
							
							Если ВыборкаТаблицаТоваров.ТипЗапасов = Перечисления.ТипыЗапасов.Работа Тогда
								СтруктураВидаЗапасовПоУмолчанию.ТипЗапасов = ВыборкаТаблицаТоваров.ТипЗапасов
							КонецЕсли;
							
							ВидЗапасовПоУмолчанию = Справочники.ВидыЗапасов.ВидЗапасовДокумента(
														Организация,
														ХозяйственнаяОперация,
														СтруктураВидаЗапасовПоУмолчанию);
							
							НоваяСтрока = ВидыЗапасовПоУмолчанию.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Отбор);
							НоваяСтрока.ВидЗапасов = ВидЗапасовПоУмолчанию;
							
						КонецЕсли;
						
					Иначе
						
						СтруктураВидаЗапасовПоУмолчанию.ВидЦены					= ВидЦены;
						СтруктураВидаЗапасовПоУмолчанию.ГруппаФинансовогоУчета	= ГруппаФинансовогоУчета;
						СтруктураВидаЗапасовПоУмолчанию.ВладелецТовара			= ВыборкаТаблицаТоваров.ВладелецТовара;
						СтруктураВидаЗапасовПоУмолчанию.Контрагент				= ВыборкаТаблицаТоваров.Контрагент;
						СтруктураВидаЗапасовПоУмолчанию.Договор					= ВыборкаТаблицаТоваров.Договор;
						СтруктураВидаЗапасовПоУмолчанию.ТипЗапасов				= ВыборкаТаблицаТоваров.ТипЗапасов;
						
						ВидЗапасовПоУмолчанию = Справочники.ВидыЗапасов.ВидЗапасовДокумента(
													Организация,
													ХозяйственнаяОперация,
													СтруктураВидаЗапасовПоУмолчанию);
						
					КонецЕсли;
					
					НоваяСтрока = ТаблицаВидыЗапасов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаТаблицаТоваров);
					НоваяСтрока.ВидЗапасов = ВидЗапасовПоУмолчанию;
					
					ЗаполнитьЗначенияСвойств(СтруктураДанныхСтроки, ВыборкаТаблицаТоваров);
					
					СтруктураДанныхСтроки.Количество				= КоличествоТовара;
					СтруктураДанныхСтроки.КоличествоПоРНПТ			= КоличествоТовараПоРНПТ;
					СтруктураДанныхСтроки.СуммаСНДС					= СуммаТовараСНДС;
					СтруктураДанныхСтроки.СуммаНДС					= СуммаНДСТовара;
					СтруктураДанныхСтроки.СуммаВознаграждения		= 0;
					СтруктураДанныхСтроки.СуммаНДСВознаграждения	= 0;
					СтруктураДанныхСтроки.ЗаказКлиента				= Неопределено;
					СтруктураДанныхСтроки.ДокументПередачи			= Неопределено;
					СтруктураДанныхСтроки.НедостаточноОстатковТоваровОрганизаций = Истина;
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанныхСтроки);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если Не ПриНехваткеТоваровОрганизацииЗаполнятьВидамиЗапасовПоУмолчанию Тогда
				
				Если ПараметрыЗаполненияВидовЗапасов.СообщатьОбОшибкахЗаполнения Тогда
					Выборка = ВыборкаОстаткиПоСтрокам.Выбрать();
					Выборка.Следующий();
					
					НоваяСтрокаОшибок = ТаблицаОшибок.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаОшибок, ВыборкаТаблицаТоваров);
					
					НоваяСтрокаОшибок.Количество			= КоличествоТовара;
					НоваяСтрокаОшибок.ТипНоменклатуры		= Выборка.ТипНоменклатуры;
					НоваяСтрокаОшибок.ЕдиницаИзмерения		= Выборка.ЕдиницаИзмерения;
					НоваяСтрокаОшибок.НеУказанНомерГТД		= НеУказанНомерГТД;
					НоваяСтрокаОшибок.ПрослеживаемыйТовар	= ПрослеживаемыйТовар;
					НоваяСтрокаОшибок.Номенклатура			= Выборка.Номенклатура;
					НоваяСтрокаОшибок.Характеристика		= Выборка.Характеристика;
					НоваяСтрокаОшибок.Серия					= Выборка.Серия;
					НоваяСтрокаОшибок.Склад					= Выборка.Склад;
					НоваяСтрокаОшибок.Назначение			= Выборка.Назначение;
				КонецЕсли;
				
				Если (Не ПроводитьБезКонтроляОстатковТоваровОрганизаций
						Или ИгнорироватьКонтрольТоваровОрганизацийПриЗапретеЗаполненияПоУмолчанию)
					// Если у пользователя есть соответствующая роль, то потребление работ не контролируется
					И (Не РазрешитьОформлениеВыпускаЗаднимЧислом
						Или Не ВыборкаОстаткиПоСтрокам.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа) Тогда
					
					Отказ = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла; // Выборка по строкам документа
	
	Если ТаблицаОшибок.Количество() > 0
		И ПроводитьБезКонтроляОстатковТоваровОрганизаций Тогда
		
		ТекстСообщения = НСтр( "ru = 'Документ %Ссылка% проведен с выключенным контролем остатков товаров организаций.'", Метаданные.ОсновнойЯзык.КодЯзыка);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", ДокументОбъект.Ссылка);
		
		ЗаписьЖурналаРегистрации(ИмяСобытияВыключенКонтрольОстатков(),
									УровеньЖурналаРегистрации.Предупреждение,
									,
									ДокументОбъект.Ссылка,
									ТекстСообщения);
		
	КонецЕсли;
	
	Если ПараметрыЗаполненияВидовЗапасов.ТаблицаВидыЗапасов = Неопределено
		И Не Отказ Тогда
		
		ДокументОбъект[ПараметрыЗаполненияВидовЗапасов.ИмяТЧВидыЗапасов].Загрузить(ТаблицаВидыЗапасов);
		
	КонецЕсли;
	
	Если КонтролироватьИзменениеНомеровГТД Тогда
		
		ТаблицаНомеровГТД.Колонки.Добавить("НовоеКоличество");
		
		Для Каждого СтрокаТаблицы Из ТаблицаВидыЗапасов Цикл
			
			НоваяСтрока = ТаблицаНомеровГТД.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.Количество = 0;
			НоваяСтрока.НовоеКоличество = СтрокаТаблицы.Количество;
			
		КонецЦикла;
		
		ТаблицаНомеровГТД.Свернуть("АналитикаУчетаНоменклатуры, НомерГТД", "Количество, НовоеКоличество");
		
		Для Каждого СтрокаТаблицы Из ТаблицаНомеровГТД Цикл
			Если СтрокаТаблицы.Количество <> СтрокаТаблицы.НовоеКоличество Тогда
				ДополнительныеСвойства.Вставить("ИзменилисьНомераГТД", Истина);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	СообщитьОбОшибкахКонтроляТоваровОрганизаций(ДокументОбъект, ТаблицаОшибок, ПараметрыЗаполненияВидовЗапасов);
	
	Если ПараметрыЗаполненияВидовЗапасов.ТаблицаНовыеРезервы <> Неопределено Тогда
		// Условие выполняется только в этапе производства. В этом документе распределение резервов по периодам при заполнении
		// видов запасов не делается - оно происходит при формировании резервов в обработке проведения.
		ПараметрыЗаполненияВидовЗапасов.Вставить("ТаблицаНовыеРезервы", ТаблицаНовыеРезервы);
	Иначе
		
		ТаблицаНовыеРезервы = РаспределитьРезервыТоваровОрганизацийПоПериодам(
								ПараметрыЗаполненияВидовЗапасов.КоличествоПериодовПриФормированииРезервовОрганизаций,
								ТаблицаНовыеРезервы,
								МенеджерВременныхТаблиц);
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НовыеРезервы.ВидДвижения,
		|	НовыеРезервы.Период,
		|	НовыеРезервы.АналитикаУчетаНоменклатуры,
		|	НовыеРезервы.Организация,
		|	НовыеРезервы.ВидЗапасов,
		|	НовыеРезервы.НомерГТД,
		|	НовыеРезервы.Количество,
		|	ВЫРАЗИТЬ(НовыеРезервы.КоличествоПоРНПТ КАК ЧИСЛО(23, 11)) КАК КоличествоПоРНПТ,
		|	НовыеРезервы.КорОрганизация,
		|	НовыеРезервы.КорВидЗапасов
		|ПОМЕСТИТЬ ВТНовыеРезервы
		|ИЗ
		|	&ТаблицаНовыеРезервы КАК НовыеРезервы";
		
		Запрос.УстановитьПараметр("ТаблицаНовыеРезервы", ТаблицаНовыеРезервы);
		
		Запрос.Выполнить();
		
	КонецЕсли;
	
КонецПроцедуры
