
&После("ОбработкаПроведения")
Процедура Расш1_ОбработкаПроведения(Отказ, РежимПроведения)
	
	//**Изменено 23.09.19 Максимов
	Если ЭтотОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров Тогда
		ПолучитьОрдер(Ссылка);
	КонецЕсли;	
	//*****************************
	
КонецПроцедуры

//** Изменено 23.09.19 Максимов
#Область РасходныйОрдерНаТовары

Функция ПолучитьОрдер(Источник)
	
	    Результат  = Неопределено;
		//Результат2 = Неопределено;
	    ПолучитьСписокПодчиненныхДокументов(Источник, Результат);
		
		Для Каждого Стр из Результат Цикл			
			Если ТипЗнч(Стр.Ссылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") И
				Стр.Ссылка.Проведен = Истина Тогда
				Продолжить;
			КонецЕсли;		
		КонецЦикла;	
		
		//ПолучитьСписокПодчиненныхДокументов(Источник.ДокументОснование, Результат2);
		
		Если Результат.Количество() = 0 Тогда
			
			СвязанныйДокумент      = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();
			СвязанныйДокумент.Дата = Источник.Дата+1;
			ОбновитьНумерациюОбъектов(Метаданные.Документы.РасходныйОрдерНаТовары);
			СвязанныйДокумент.УстановитьНовыйНомер(); 				
			Если Источник.Проведен Тогда   
				ОбновитьРасходныйОрдер(СвязанныйДокумент, Источник);
				СвязанныйДокумент.Записать(РежимЗаписиДокумента.Запись);
				Сообщить("Был автоматически создан документ Расходный ордер на товары");
			ИначеЕсли Источник.ПометкаУдаления Тогда 	
				Если НЕ СвязанныйДокумент.ЭтоНовый() Тогда
					СвязанныйДокумент.УстановитьПометкуУдаления(Истина);	
				КонецЕсли;
			Иначе  
				Если СвязанныйДокумент.ЭтоНовый() Тогда
					ОбновитьРасходныйОрдер(СвязанныйДокумент, Источник);
					СвязанныйДокумент.Записать(РежимЗаписиДокумента.Запись);	
				ИначеЕсли СвязанныйДокумент.Проведен Тогда
					СвязанныйДокумент.Записать(РежимЗаписиДокумента.ОтменаПроведения);	
				Иначе
					СвязанныйДокумент.УстановитьПометкуУдаления(Ложь);	
				КонецЕсли;
			КонецЕсли
		КонецЕсли;	
		
КонецФункции	

Процедура ОбновитьРасходныйОрдер(ДокументРасхода, Источник)
	
	ЗаполнитьЗначенияСвойств(ДокументРасхода, Источник, , "Номер");
	ДокументРасхода.Дата				= Источник.Дата + 1;
	ДокументРасхода.Статус 				= Перечисления.СтатусыРасходныхОрдеров.КОтбору;
	ДокументРасхода.ДатаОтгрузки 		= ТекущаяДата() + 1;
	ДокументРасхода.Приоритет 			= Справочники.Приоритеты.НайтиПоНаименованию("Средний");
	ДокументРасхода.Получатель 			= Источник.Склад;
	ДокументРасхода.СкладскаяОперация   = Перечисления.СкладскиеОперации.ОтгрузкаКомплектующихДляСборки;
	ДокументРасхода.ОтгружаемыеТовары.Очистить();
	Для Каждого Стр Из Источник.Товары Цикл
		СтрокаТовары = ДокументРасхода.ОтгружаемыеТовары.Добавить();
		СтрокаТовары2 = ДокументРасхода.ТоварыПоРаспоряжениям.Добавить();
		СтрокаТовары.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отобрать;
		СтрокаТовары2.Распоряжение = Источник.Ссылка;
		ЗаполнитьЗначенияСвойств(СтрокаТовары,Стр);
		ЗаполнитьЗначенияСвойств(СтрокаТовары2,Стр);
		СтрокаТовары.Назначение = Источник.Назначение;
		СтрокаТовары2.Назначение = Источник.Назначение;		
	КонецЦикла;	

КонецПроцедуры

Функция ПолучитьСписокПодчиненныхДокументов(ЗначениеКритерияОтбора, Результат)
    
   Если Метаданные.КритерииОтбора.СвязанныеДокументы.Тип.СодержитТип(ТипЗнч(ЗначениеКритерияОтбора))  Тогда
        
        УстановитьПривилегированныйРежим(Истина);
        
        Запрос = Новый Запрос;
        Запрос.Текст = "ВЫБРАТЬ
        |    СвязанныеДокументы.Ссылка
        |ИЗ
        |    КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СвязанныеДокументы";
        
        Запрос.УстановитьПараметр("ЗначениеКритерияОтбора",ЗначениеКритерияОтбора);
		Результат = Запрос.Выполнить().Выгрузить(); 
		
		Возврат Результат;
        
    Иначе
        
        Возврат Неопределено;
        
	КонецЕсли;
	
	        
КонецФункции

#КонецОбласти

//*****************************