
&НаКлиентеНаСервереБезКонтекста
&ИзменениеИКонтроль("УправлениеФормой")
Процедура Кт_УправлениеФормой(Форма)

	ВыводитьТолькоНомераНакладных = Истина;
    #Удаление
	Если Форма.Объект.ДокументыОснования.Количество() = 1 Тогда
	#КонецУдаления
		ВыводитьТолькоНомераНакладных = Ложь;	
	#Удаление	
	КонецЕсли;
    #КонецУдаления
	Форма.Элементы.ВыводДанныхОТоварномСоставе.Доступность = Не ВыводитьТолькоНомераНакладных;

	Если ВыводитьТолькоНомераНакладных Тогда 																
		Форма.Объект.ВыводДанныхОТоварномСоставе = ПредопределенноеЗначение("Перечисление.ВариантыВыводаДанныхОТоварномСоставе.НомераНакладных");
	КонецЕсли;

КонецПроцедуры
