
&ИзменениеИКонтроль("ПересчитатьЦенуЗаказаЗаУпаковкуВСтрокеТЧ")
Процедура Кт_ПересчитатьЦенуЗаказаЗаУпаковкуВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)

	Перем КоличествоЕдиницДоПересчета;

	#Вставка
	//************************************************************************
	//ИЗМЕНЕНО Сухарев Б.В. 04.07.2018
	//Преренести в обновление
	Если СтруктураДействий.Свойство("ПересчитатьУпаковокиЕдиницы") Тогда
		Возврат;
	КонецЕсли;
	//************************************************************************
	#КонецВставки
	Если СтруктураДействий.Свойство("ПересчитатьЦенуЗаказаЗаУпаковку", КоличествоЕдиницДоПересчета)
		И КоличествоЕдиницДоПересчета <> 0 Тогда
		ТекущаяСтрока.ЦенаЗаказа = Окр(ТекущаяСтрока.ЦенаЗаказа
		/ КоличествоЕдиницДоПересчета
		* ТекущаяСтрока.Количество, 2, РежимОкругления.Окр15как20);
	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ПересчитатьЦенуЗаУпаковкуВСтрокеТЧ")
Процедура Кт_ПересчитатьЦенуЗаУпаковкуВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)

	Перем КоличествоЕдиницДоПересчета;

	#Вставка
	//************************************************************************
	//ИЗМЕНЕНО Сухарев Б.В. 04.07.2018
	//Преренести в обновление
	Если СтруктураДействий.Свойство("ПересчитатьУпаковокиЕдиницы") Тогда
		Возврат;
	КонецЕсли;
	//************************************************************************
	#КонецВставки
	Если СтруктураДействий.Свойство("ПересчитатьЦенуЗаУпаковку", КоличествоЕдиницДоПересчета)
		И КоличествоЕдиницДоПересчета <> 0 Тогда
		ТекущаяСтрока.Цена = Окр(ТекущаяСтрока.Цена
		/ КоличествоЕдиницДоПересчета
		* ТекущаяСтрока.Количество, 2, РежимОкругления.Окр15как20);
	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ПересчитатьКоличествоЕдиницВСтрокеТЧ")
Процедура Кт_ПересчитатьКоличествоЕдиницВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)

	Перем УпаковкаНоменклатура;

	#Вставка
	//************************************************************************
	//ИЗМЕНЕНО Сухарев Б.В. 04.07.2018
	//Преренести в обновление
	Если СтруктураДействий.Свойство("ПересчитатьУпаковокиЕдиницы") Тогда
		ПересчитатьКоличествоЕдиницВСтрокеТЧДоп(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) ;
		Возврат;
	КонецЕсли;
	//************************************************************************
	#КонецВставки
	Если СтруктураДействий.Свойство("ПересчитатьКоличествоЕдиниц", УпаковкаНоменклатура) Тогда
		ПараметрыПересчета = НормализоватьПараметрыПересчетаЕдиниц(ТекущаяСтрока, УпаковкаНоменклатура);
		Если ЗначениеЗаполнено(ПараметрыПересчета.Номенклатура) Тогда
			ДанныеУпаковки = ПолучитьКоэффициентУпаковки(ПараметрыПересчета.Упаковка, КэшированныеЗначения, ПараметрыПересчета.Номенклатура);
			Количество = ТекущаяСтрока.КоличествоУпаковок * ДанныеУпаковки.Коэффициент;

			Если ДанныеУпаковки.НужноОкруглятьКоличество
				И ПараметрыПересчета.НужноОкруглять Тогда
				ТекущаяСтрока.Количество = Окр(Количество, 0 ,РежимОкругления.Окр15как20);
			Иначе
				ТекущаяСтрока.Количество = Количество;
			КонецЕсли;
		ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "КоличествоУпаковок") Тогда
			ТекущаяСтрока.Количество = ТекущаяСтрока.КоличествоУпаковок;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ПересчитатьКоличествоУпаковокВСтрокеТЧ")
Процедура Кт_ПересчитатьКоличествоУпаковокВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)

	Если СтруктураДействий.Свойство("ПересчитатьКоличествоУпаковок") Тогда
		Если ТекущаяСтрока.Количество = 0 Тогда
			ТекущаяСтрока.КоличествоУпаковок = 0;
		Иначе
			Коэффициент = ПолучитьКоэффициентУпаковки(ТекущаяСтрока.Упаковка, КэшированныеЗначения, ТекущаяСтрока.Номенклатура).Коэффициент;
			Если Коэффициент <> 0 Тогда
				#Удаление
				ТекущаяСтрока.КоличествоУпаковок = ТекущаяСтрока.Количество / Коэффициент;
				#КонецУдаления
				#Вставка
				//************************************************************************
				//ИЗМЕНЕНО Сухарев Б.В. 04.07.2018
				//Преренести в обновление
				Если НЕ СтруктураДействий.Свойство("ПересчитатьУпаковокиЕдиницы") Тогда
					ТекущаяСтрока.КоличествоУпаковок = ТекущаяСтрока.Количество / Коэффициент;
				КонецЕсли;
				//************************************************************************
				#КонецВставки
			Иначе
				ТекстИсключения = НСтр("ru = 'При попытке пересчета количества в %ЕдИзмерения% превышена допустимая разрядность.'");
				ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ЕдИзмерения%", ТекущаяСтрока.Упаковка);

				ТекущаяСтрока.Количество = 0;
				ТекущаяСтрока.КоличествоУпаковок = 0;
				ТекущаяСтрока.Упаковка = ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");

				ВызватьИсключение ТекстИсключения;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ПересчитатьКоличествоУпаковокСуффиксВСтрокеТЧ")
Процедура Кт_ПересчитатьКоличествоУпаковокСуффиксВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)

	Перем ПараметрыПересчетаСуффикс;

	Если СтруктураДействий.Свойство("ПересчитатьКоличествоУпаковокСуффикс",ПараметрыПересчетаСуффикс) Тогда
		ПараметрыПересчета = НормализоватьПараметрыПересчетаЕдиницСуффикс(ТекущаяСтрока, ПараметрыПересчетаСуффикс);
		КоличествоССуффиксом = КоличествоССуффиксом(ПараметрыПересчета.Суффикс);
		Если ТекущаяСтрока[КоличествоССуффиксом.Количество] = 0 Тогда
			ТекущаяСтрока[КоличествоССуффиксом.КоличествоУпаковок] = 0;
		Иначе
			Коэффициент = ПолучитьКоэффициентУпаковки(ТекущаяСтрока.Упаковка, КэшированныеЗначения, ТекущаяСтрока.Номенклатура).Коэффициент;
			Если Коэффициент <> 0 Тогда
				ТекущаяСтрока[КоличествоССуффиксом.КоличествоУпаковок] = ТекущаяСтрока[КоличествоССуффиксом.Количество] / Коэффициент;
				#Вставка
				//************************************************************************
				//ИЗМЕНЕНО Сухарев Б.В. 04.07.2018
				//Преренести в обновление
				Если НЕ СтруктураДействий.Свойство("ПересчитатьУпаковокиЕдиницы") Тогда
					ТекущаяСтрока["КоличествоУпаковок" + ПараметрыПересчета.Суффикс] = ТекущаяСтрока["Количество" + ПараметрыПересчета.Суффикс] / Коэффициент;
				КонецЕсли;
				//************************************************************************				
				#КонецВставки
			Иначе
				ТекстИсключения = НСтр("ru = 'При попытке пересчета количества в %ЕдИзмерения% превышена допустимая разрядность.'");
				ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ЕдИзмерения%", ТекущаяСтрока.Упаковка);

				ТекущаяСтрока[КоличествоССуффиксом.Количество] = 0;
				ТекущаяСтрока[КоличествоССуффиксом.КоличествоУпаковок] = 0;
				ТекущаяСтрока.Упаковка = ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");

				ВызватьИсключение ТекстИсключения;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

//************************************************************************
//ИЗМЕНЕНО Сухарев Б.В. 04.07.2018
//Преренести в обновление
// Пересчитывает количество товара (в единицах хранения) в текущей строке табличной части документа.
//
// Параметры:
//	ТекущаяСтрока - Структура - структура со свойствами строки документа.
//	СтруктураДействий - Структура - структура с действиями, которые нужно произвести.
//	КэшированныеЗначения - Структура - кэшированные значения.
//
Процедура ПересчитатьКоличествоЕдиницВСтрокеТЧДоп(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт 
	
	Перем УпаковкаНоменклатура;
	
	Если СтруктураДействий.Свойство("ПересчитатьКоличествоЕдиниц", УпаковкаНоменклатура) Тогда
		
		ПараметрыПересчета = НормализоватьПараметрыПересчетаЕдиниц(ТекущаяСтрока, УпаковкаНоменклатура);
		ДанныеУпаковки = ПолучитьКоэффициентУпаковки(ПараметрыПересчета.Упаковка, КэшированныеЗначения, ПараметрыПересчета.Номенклатура);
		
		Если Строка(ТипЗнч(СтруктураДействий.СтараяУпаковка)) = "Номенклатура" Тогда
			СтараяУпаковка	= СтруктураДействий.СтараяУпаковка.ЕдиницаИзмерения;
			мКоличество		= ТекущаяСтрока.КоличествоУпаковок;
		Иначе	
			СтараяУпаковка = СтруктураДействий.СтараяУпаковка;
			мКоличество		= ТекущаяСтрока.Количество;
		КонецЕсли;	
		
		Если Строка(ТипЗнч(СтруктураДействий.НоваяУпаковка)) = "Номенклатура" Тогда
			НоваяУпаковка = СтруктураДействий.НоваяУпаковка.ЕдиницаИзмерения;	
		Иначе	
			НоваяУпаковка = СтруктураДействий.НоваяУпаковка;	
		КонецЕсли;	
		
		Если НоваяУпаковка  = СтараяУпаковка Тогда
			Возврат;
		КонецЕсли;
		
		СтароеЗначениеКоэффициента = СтараяУпаковка.Числитель;
		НовоеЗначениеКоэффициента  = НоваяУпаковка.Числитель;
		
		Если  НовоеЗначениеКоэффициента <> СтароеЗначениеКоэффициента Тогда 
			ЕстьИзменения = Ложь;
			Если  СтароеЗначениеКоэффициента <> 0 
				И НовоеЗначениеКоэффициента <> 0 Тогда
				
				Количество	  = ТекущаяСтрока.КоличествоУпаковок * СтароеЗначениеКоэффициента / НовоеЗначениеКоэффициента;
				Цена 		  = ТекущаяСтрока.Цена * НовоеЗначениеКоэффициента / СтароеЗначениеКоэффициента;
				ЕстьИзменения = Истина;
				
			ИначеЕсли НЕ НоваяУпаковка.Числитель = 0 И НЕ НоваяУпаковка.Знаменатель = 0 Тогда
				
				Количество	= ТекущаяСтрока.КоличествоУпаковок * НоваяУпаковка.Знаменатель / НоваяУпаковка.Числитель;
				Цена 		= ТекущаяСтрока.Цена * НоваяУпаковка.Числитель / НоваяУпаковка.Знаменатель;
				ЕстьИзменения = Истина;
				
			ИначеЕсли ( НоваяУпаковка.Числитель = 0 И НоваяУпаковка.Знаменатель = 0 ) И 
				( НЕ СтараяУпаковка.Числитель = 0 И НЕ СтараяУпаковка.Знаменатель = 0 ) Тогда
				
				Количество	  = ТекущаяСтрока.КоличествоУпаковок * СтараяУпаковка.Числитель / СтараяУпаковка.Знаменатель;
				Цена 		  = ТекущаяСтрока.Цена * СтараяУпаковка.Знаменатель / СтараяУпаковка.Числитель;
				ЕстьИзменения = Истина;
				
			КонецЕсли;
			
			Если ЕстьИзменения Тогда
				Если ДанныеУпаковки.НужноОкруглятьКоличество  И ПараметрыПересчета.НужноОкруглять Тогда
//					ТекущаяСтрока.Количество 			 	 = Окр(мКоличество, 0 ,РежимОкругления.Окр15как20);
					ТекущаяСтрока.КоличествоУпаковок = Окр(Количество, 0 ,РежимОкругления.Окр15как20);
					ТекущаяСтрока.Цена 				 = Окр(Цена, 2 ,РежимОкругления.Окр15как20);
				Иначе
					ТекущаяСтрока.Количество 		 = мКоличество;
					ТекущаяСтрока.КоличествоУпаковок = Количество;
					ТекущаяСтрока.Цена 				 = Цена;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
