
&ИзменениеИКонтроль("ВыполнитьОбработкуОповещенияПослеПроверкиПроведенностиДокумента")
Процедура Кт_ВыполнитьОбработкуОповещенияПослеПроверкиПроведенностиДокумента(Форма, Оповещение)

	Если Не ЗначениеЗаполнено(Форма.Объект.Ссылка)
		#Удаление
		Или Не Форма.Объект.Проведен
		#КонецУдаления
		Или Форма.Модифицированность Тогда

		ДополнительныеПараметры = Новый Структура("Оповещение, Форма", Оповещение, Форма);
		ОповещениеВопроса = Новый ОписаниеОповещения(
		"ВыполнитьОбработкуОповещенияПослеПроверкиПроведенностиДокументаЗавершение",
		ЭтотОбъект, ДополнительныеПараметры);

		ТекстВопроса = НСтр("ru = 'Для продолжения необходимо провести документ. Провести?'");
		ПоказатьВопрос(ОповещениеВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;

	КонецЕсли;

	ВыполнитьОбработкуОповещения(Оповещение, Форма.Объект.Ссылка);

КонецПроцедуры

&ИзменениеИКонтроль("ОповеститьПользователяОбИзмененииОбъекта")
Процедура Кт_ОповеститьПользователяОбИзмененииОбъекта(СсылкаНаОбъект, ТекстЗаголовка)

	Если ПустаяСтрока(ТекстЗаголовка) Тогда	
		ТекстЗаголовка = НСтр("ru='Изменение:'");
	КонецЕсли;
	ТекстСообщения = Строка(СсылкаНаОбъект);
	НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(СсылкаНаОбъект);
	ПоказатьОповещениеПользователя(ТекстЗаголовка, НавигационнаяСсылка, ТекстСообщения, БиблиотекаКартинок.Информация32);

	#Удаление
	ИсторияРаботыПользователя.Добавить(НавигационнаяСсылка);
	#КонецУдаления

КонецПроцедуры
