
&После("УстановитьПрефикс")
Процедура Кт_УстановитьПрефикс(Источник, Префикс, УстановитьПрефиксИнформационнойБазы, УстановитьПрефиксОрганизации)
	//Дополним по старинке.. для всех документов, кроме указанных нами в регистре
	ПрефиксОрганизации        = "";
	
	Если УстановитьПрефиксОрганизации Тогда
		
		Если РеквизитОрганизацияДоступен(Источник) Тогда
			
			ПриОпределенииПрефиксаОрганизации(
				Источник[ИмяРеквизитаОрганизация(Источник.Метаданные())], ПрефиксОрганизации);
			// Если задана пустая ссылка на организацию.
			Если ПрефиксОрганизации = Ложь Тогда
				
				ПрефиксОрганизации = "";
				
			КонецЕсли;
			
		КонецЕсли;
		Префикс = ПрефиксОрганизации;
	КонецЕсли;
    //////////////////////////////////////////////////////////////////////////////
	
	
	Если Источник.ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

	СтруктураПрефикса=Неопределено;
	Если Не Источник.ДополнительныеСвойства.Свойство("СтруктураПрефикса", СтруктураПрефикса) Тогда
		СтруктураПрефикса=СтруктураПрефикса(Источник);
	КонецЕсли;
	
	Если СтруктураПрефикса=Неопределено Тогда
		Возврат;
	КонецЕсли; 

	стрПрефиксРИБ=?(СтруктураПрефикса.ПрефиксРИБ, ПолучитьФункциональнуюОпцию("ПрефиксИнформационнойБазы"), "");

	стрШаблон=?(ПустаяСтрока(СтруктураПрефикса.ПрефиксШаблон), "[РИБ][ПРЕФИКС][ПЕРИОД]-", СтруктураПрефикса.ПрефиксШаблон);
	стрШаблон=СтрЗаменить(стрШаблон, "[РИБ]", стрПрефиксРИБ);
	стрШаблон=СтрЗаменить(стрШаблон, "[ПЕРИОД]", СтруктураПрефикса.ПрефиксПериод);
	стрШаблон=СтрЗаменить(стрШаблон, "[ПРЕФИКС]", СтруктураПрефикса.Префикс);

	Префикс=стрШаблон;
КонецПроцедуры

&После("ПроверитьНомерДокументаПоДатеИОрганизации")
Процедура Кт_ПроверитьНомерДокументаПоДатеИОрганизации(Источник, Отказ, РежимЗаписи, РежимПроведения)
	Если Источник.ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	Если Источник.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;

	СтруктураПрефикса=СтруктураПрефикса(Источник);
	Если СтруктураПрефикса=Неопределено Тогда
		Возврат;
	КонецЕсли; 

	Источник.ДополнительныеСвойства.Вставить("СтруктураПрефикса", СтруктураПрефикса);
	Источник.Номер="";
КонецПроцедуры


#Область ДополнительныеПроцедурыФункции

Функция СтруктураПрефикса(Объект)
	ОбъектМетаданныхСсылка=Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", Объект.Метаданные().ПолноеИмя());
	Если ОбъектМетаданныхСсылка.Пустая() Тогда Возврат Неопределено; КонецЕсли; //Ошибка (такого быть не должно)

	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ИсточникДанных", ОбъектМетаданныхСсылка);
	Запрос.Текст="ВЫБРАТЬ
	             |	НастройкаПрефиксов.Правила КАК Правила,
	             |	НастройкаПрефиксов.Элементы КАК Элементы
	             |ИЗ
	             |	РегистрСведений.Кт_НастройкиПрефиксов КАК НастройкаПрефиксов
	             |ГДЕ
	             |	НастройкаПрефиксов.ИсточникДанных = &ИсточникДанных";
	Выборка=Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда Возврат Неопределено; КонецЕсли;
	
	тзПравила=Выборка.Правила.Получить();
	Если НЕ ТипЗнч(тзПравила)=Тип("ТаблицаЗначений") Тогда Возврат Неопределено; КонецЕсли;
	
	тзЭлементы=Выборка.Элементы.Получить();
	//Если НЕ ТипЗнч(тзЭлементы)=Тип("ТаблицаЗначений") Тогда Возврат Неопределено; КонецЕсли;

	тзСоответствия=ТаблицаСоответствий(Объект, тзЭлементы, тзПравила, Объект.ЭтоНовый());
	Если тзСоответствия.Количество()=0 Тогда Возврат Неопределено; КонецЕсли;

	СтруктураПрефикса=Новый Структура;
	СтруктураПрефикса.Вставить("Префикс", тзСоответствия[0].Префикс);
	СтруктураПрефикса.Вставить("ПрефиксРИБ", тзСоответствия[0].ПрефиксРИБ);
	СтруктураПрефикса.Вставить("ПрефиксПериод", тзСоответствия[0].ПрефиксПериод);
	СтруктураПрефикса.Вставить("ПрефиксШаблон", тзСоответствия[0].ПрефиксШаблон);
	Если ЗначениеЗаполнено(СтруктураПрефикса.ПрефиксПериод) Тогда
		СтруктураПрефикса.ПрефиксПериод=СформироватьПредставлениеПериода(СтруктураПрефикса.ПрефиксПериод, Объект.Дата);
	КонецЕсли;
	
	//++ Ниронов 10.03.26
	ПрефиксОрганизации = "";
	Если ( СтрНайти(СтруктураПрефикса.Префикс,"[ОРГ]" ) > 0 ) Тогда
		Если ( ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация",Объект.Метаданные()) ) Тогда
			//СтруктураПрефикса.Префикс = СокрЛП(Объект.Организация.Префикс);
			ПрефиксОрганизации = СокрЛП(Объект.Организация.Префикс);
		Иначе
			//СтруктураПрефикса.Префикс = "";
		КонецЕсли;	
	КонецЕсли;	
	
	СтруктураПрефикса.Префикс = СокрЛП(СтрЗаменить(СтруктураПрефикса.Префикс, "[ОРГ]", ПрефиксОрганизации));
	//-- Ниронов 
	
	Возврат СтруктураПрефикса;
КонецФункции

Функция ЗначениеРеквизитаПоСсылке(Ссылка, Путь)
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст="
	|ВЫБРАТЬ
	|	"+Путь+" Как Реквизит
	|ИЗ
	|	"+Ссылка.Метаданные().ПолноеИмя()+" КАК ИсточникДанных
	|ГДЕ
	|	ИсточникДанных.Ссылка = &Ссылка
	|";    
	Выборка=Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Реквизит, Неопределено); 
КонецФункции

Функция ЗначениеРеквизитаПоОбъекту(Объект, Путь)
	стрВыражение="Объект";
	Массив=СтрРазделить(Путь, ".");
	Для каждого ИмяРеквизита Из Массив Цикл
		стрВыражение=стрВыражение+"["""+ИмяРеквизита+"""]";
	КонецЦикла;	 
	Возврат Вычислить(стрВыражение);
КонецФункции

Функция СформироватьПредставлениеПериода(стрПрефикс, Дата)
	Если стрПрефикс="НомерДняГода" Тогда
		Возврат Формат(ДеньГода(Дата),"ЧЦ=3; ЧВН=");
	ИначеЕсли стрПрефикс="НомерДняМесяца" Тогда
		Возврат Формат(Месяц(Дата), "ЧЦ=2; ЧВН=")+"-"+Формат(День(Дата),"ЧЦ=2; ЧВН=");
	ИначеЕсли стрПрефикс="НомерНедели" Тогда
		Возврат Формат(ДеньНедели(Дата),"ЧЦ=2; ЧВН=");
	ИначеЕсли стрПрефикс="НомерМесяца" Тогда
		Возврат Формат(Месяц(Дата),"ЧЦ=2; ЧВН=");
	ИначеЕсли стрПрефикс="НомерКвартала" Тогда
		Возврат Формат(Цел((Месяц(Дата)-1)/3)+1,"ЧЦ=2; ЧВН=");
	ИначеЕсли стрПрефикс="НомерГода" Тогда
		Возврат Прав(Строка(Год(Дата)),2);
	ИначеЕсли стрПрефикс="НомерГодаМесяца" Тогда
		Возврат Прав(Строка(Год(Дата)),2)+Формат(Месяц(Дата),"ЧЦ=2; ЧВН=");
	ИначеЕсли стрПрефикс="НомерГодаМесяцаДня" Тогда
		Возврат Прав(Строка(Год(Дата)), 2)+Формат(Месяц(Дата),"ЧЦ=2; ЧВН=")+Формат(День(Дата),"ЧЦ=2; ЧВН=");
	КонецЕсли;
	
	Возврат "";
КонецФункции

Функция ТаблицаСоответствий(Объект, тзЭлементы, тзПравила, ЭтоНовыйОбъект)
	тзСоответствия=Новый ТаблицаЗначений;

	ПростойПрефикс = Истина;
	
	Если ( ТипЗнч(тзЭлементы) = Тип("ТаблицаЗначений") ) Тогда
		//Добавим колонки "измерения" в таблицу соответствий
		Для Каждого СтрокаКоллекции Из тзЭлементы Цикл
			стрКолонка=СтрЗаменить(СтрокаКоллекции.Идентификатор, ".", "_");
			тзСоответствия.Колонки.Добавить(стрКолонка, Новый ОписаниеТипов("Число"));
		КонецЦикла;
	Иначе
		ПростойПрефикс = Ложь;
	КонецЕсли;	

	//Добавим колонки "ресурсы" в таблицу соответствий
	тзСоответствия.Колонки.Добавить("Префикс", Новый ОписаниеТипов("Строка"));
	тзСоответствия.Колонки.Добавить("ПрефиксРИБ", Новый ОписаниеТипов("Булево"));
	тзСоответствия.Колонки.Добавить("ПрефиксПериод", Новый ОписаниеТипов("Строка"));
	тзСоответствия.Колонки.Добавить("ПрефиксШаблон", Новый ОписаниеТипов("Строка"));
	
	//Заполняем таблицу соответствий
	УровеньСоответствияПоУмолчанию=1000;
	Для Каждого СтрокаПравила Из тзПравила Цикл
		фСоответствие=0; //ОбъектСтрокаСоответствия=тзСоответствия.Добавить();
		ОбъектСтрокаСоответствия=Неопределено;

		Если НЕ ПустаяСтрока(СтрокаПравила.ПрефиксПериод) Тогда
			Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
				стрПериод1=СформироватьПредставлениеПериода(СтрокаПравила.ПрефиксПериод, Объект.Дата);
				стрПериод2=СформироватьПредставлениеПериода(СтрокаПравила.ПрефиксПериод, ЗначениеРеквизитаПоСсылке(Объект.Ссылка, "Дата"));
				Если НЕ стрПериод1=стрПериод2 Тогда
					ОбъектСтрокаСоответствия=тзСоответствия.Добавить();
				КонецЕсли;
			Иначе // Новый Документ
				ОбъектСтрокаСоответствия=тзСоответствия.Добавить();
			КонецЕсли;
		КонецЕсли; //**************

		
		Если ( ТипЗнч(тзЭлементы) = Тип("ТаблицаЗначений") ) Тогда
			Для Каждого СтрокаАтрибута Из тзЭлементы Цикл
				стрПуть=СокрЛП(СтрокаАтрибута.Идентификатор);
				ЗначениеИзмерения=ЗначениеРеквизитаПоОбъекту(Объект, стрПуть);
				Если НЕ ЭтоНовыйОбъект И ЗначениеИзмерения=ЗначениеРеквизитаПоСсылке(Объект.Ссылка, стрПуть) Тогда
					Продолжить; // Значения не изменились
				КонецЕсли;

				ЗначениеКолонки=СтрокаПравила[СтрЗаменить(стрПуть, ".", "_")];

				// TODO продумать для разных типов соответствий -
				//как они должны себя вести при пустых значениях измерений в правилах и/или пустых значений переданных измерений
				//пока использую правило: Если входное значение неопределено, то нет однозначных правил (кроме правила "для всех"):
				//Необходимо ввести понятие ЮНИВЕРСУМ

				Если Не ЗначениеЗаполнено(ЗначениеКолонки) Тогда //Подходит любое значение измерения
					Продолжить;
				ИначеЕсли Не ЗначениеЗаполнено(ЗначениеИзмерения) Тогда
					фСоответствие=-1; Прервать;
				КонецЕсли;

				Если ТипЗнч(ЗначениеКолонки)=Тип("Строка")Тогда ЗначениеКолонки=СокрЛП(ЗначениеКолонки); КонецЕсли;

				фСоответствие=?(ЗначениеИзмерения=ЗначениеКолонки, УровеньСоответствияПоУмолчанию, -1);
				Если фСоответствие=-1 Тогда
					стрТипВид=ТипОбъекта(ЗначениеКолонки, 1, Символы.ПС);
					стрТип=стрПолучитьСтроку(стрТипВид, 1);
					стрВид=стрПолучитьСтроку(стрТипВид, 2);
					Если стрТип="Справочник"  Тогда
						стрВидИерархии=Строка(Метаданные.Справочники[стрВид].ВидИерархии);
						Если стрВидИерархии="ИерархияЭлементов" Тогда
							фСоответствие=?(ЗначениеИзмерения.ПринадлежитЭлементу(ЗначениеКолонки)=1, ЗначениеКолонки.Уровень()+1, -1);
						ИначеЕсли стрВидИерархии="ИерархияГруппИЭлементов" Тогда
							Если ЗначениеКолонки.ЭтоГруппа Тогда //Если ЗначениеРеквизитаОбъекта(ЗначениеКолонки, "ЭтоГруппа") Тогда
								фСоответствие=?(ЗначениеИзмерения.ПринадлежитЭлементу(ЗначениеКолонки)=1, ЗначениеКолонки.Уровень()+1, -1);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если фСоответствие=-1 Тогда Прервать; КонецЕсли;

				Если ОбъектСтрокаСоответствия=Неопределено Тогда
					ОбъектСтрокаСоответствия=тзСоответствия.Добавить();
				КонецЕсли;			
				ОбъектСтрокаСоответствия[СтрЗаменить(стрПуть, ".", "_")]=фСоответствие;
			КонецЦикла;
		Иначе	
			////
		КонецЕсли;
		
		
		Если ОбъектСтрокаСоответствия=Неопределено Тогда Продолжить; КонецЕсли;

		Если фСоответствие=-1 Тогда
			тзСоответствия.Удалить(ОбъектСтрокаСоответствия);
			Продолжить;
		КонецЕсли;

		//Заполним ресурсы таблицы соответствия текущей строки
		ОбъектСтрокаСоответствия["Префикс"]=СтрокаПравила["Префикс"];
		ОбъектСтрокаСоответствия["ПрефиксРИБ"]=СтрокаПравила["ПрефиксРИБ"];
		ОбъектСтрокаСоответствия["ПрефиксПериод"]=СтрокаПравила["ПрефиксПериод"];
		ОбъектСтрокаСоответствия["ПрефиксШаблон"]=СтрокаПравила["ПрефиксШаблон"];
		
		Если ( ПростойПрефикс )  Тогда
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;

	Возврат тзСоответствия;
КонецФункции

Функция ТипОбъекта(Объект, Режим=0, Разделитель=".") Экспорт
	// Режим: 0 - тип объекта, 1 - тип+вид объекта
	Попытка мдОбъект=Объект.Метаданные();
	Исключение Возврат Строка(ТипЗнч(Объект));
	КонецПопытки;

	Если Режим=0 Тогда Возврат СтрЗаменить(мдОбъект.ПолноеИмя(), "."+мдОбъект.Имя, ""); КонецЕсли; 
	
	стрТипВид=мдОбъект.ПолноеИмя();
	Если Разделитель<>"." Тогда стрТипВид=стрЗаменить(стрТипВид, ".", Разделитель); КонецЕсли;

	Возврат стрТипВид;	
КонецФункции


#КонецОбласти

