
&После("ПередЗаписью")
Процедура Расш1_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//++ Сухарев Б.В. 07.12.2018
	ЗаполнитьУИД();
	//== Сухарев Б.В 
	//++ Ниронов 12.03.2026
	ЗаполнитьСклад();
	//-- Ниронов 12.03.2026
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура Расш1_ПриЗаписи(Отказ)

	//++ Сухарев Б.В. 07.12.2018
	ЗаполнитьУИД();
	//== Сухарев Б.В 
	
КонецПроцедуры

//++ Сухарев Б.В. 07.12.2018
&НаСервере
Процедура ЗаполнитьУИД()
	
	Для Каждого ТекСтрока Из Товары Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока._УИДЗаказ) Тогда
			ТекСтрока._УИДЗаказ = Новый УникальныйИдентификатор();
 		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока._УИДОтгрузка) Тогда
			ТекСтрока._УИДОтгрузка = Новый УникальныйИдентификатор();
		КонецЕсли;
		
	КонецЦикла;// ТекСтрока Из Объект.Товары
	
ПроверитьУИД();

КонецПроцедуры	// ЗаполнитьУИД()

Процедура ПроверитьУИД()
	
	Для Каждого ТекСтрока Из Товары Цикл
		СтрПоиска = Новый Структура("_УИДЗаказ", ТекСтрока._УИДЗаказ);
		МасСтрок  = Товары.НайтиСтроки(СтрПоиска); 
		Если МасСтрок.Количество() > 1 Тогда
			ЗаменитьУИД(МасСтрок);
		КонецЕсли; 
	КонецЦикла;		// ТекСтрока Из Объект.Товары
	
	Для Каждого ТекСтрока Из Товары Цикл
		СтрПоиска = Новый Структура("_УИДОтгрузка", ТекСтрока._УИДОтгрузка);
		МасСтрок  = Товары.НайтиСтроки(СтрПоиска); 
		Если МасСтрок.Количество() > 1 Тогда
			ЗаменитьУИДОтгрузки(МасСтрок);
		КонецЕсли; 
	КонецЦикла;		// ТекСтрока Из Объект.Товары
	
КонецПроцедуры	// ПроверитьУИД()

Процедура ЗаменитьУИД(МасСтрок)
	
	Для к = 1 По МасСтрок.Количество() - 1 Цикл
		Если Товары[МасСтрок[0].НомерСтроки - 1]._УИДЗаказ = Товары[МасСтрок[к].НомерСтроки - 1]._УИДЗаказ Тогда
			Товары[МасСтрок[к].НомерСтроки - 1]._УИДЗаказ = Новый УникальныйИдентификатор();     
		КонецЕсли;
	КонецЦикла;		// к = 1
	
КонецПроцедуры	// ЗаменитьУИД()

Процедура ЗаменитьУИДОтгрузки(МасСтрок)
	
	Для к = 1 По МасСтрок.Количество() - 1 Цикл
		Если Товары[МасСтрок[0].НомерСтроки - 1]._УИДОтгрузка = Товары[МасСтрок[к].НомерСтроки - 1]._УИДОтгрузка Тогда
			Товары[МасСтрок[к].НомерСтроки - 1]._УИДОтгрузка = Новый УникальныйИдентификатор();     
		КонецЕсли;
	КонецЦикла;		// к = 1
	
КонецПроцедуры	// ЗаменитьУИД()

//++ Ниронов 12.03.2026
Процедура ЗаполнитьСклад()
	
	Для Каждого ТекСтрока Из Товары Цикл
		ТекСтрока.Склад = Склад;
	КонецЦикла;// ТекСтрока Из Объект.Товары
	
КонецПроцедуры	// ЗаполнитьУИД()
//-- Ниронов 12.03.2026
