
#Область СистемаОповещенийПользователя

Процедура ВыводСообщенийПользователю() Экспорт
	
	//+++ Ниронов
	//Пользователь	= ПользователиКлиентСервер.ТекущийПользователь();
	Пользователь	= ПользователиКлиент.ТекущийПользователь();
	//---
	МассивСообщений = _РаботаСИнтерфейсомСервер.ПолучитьСписокСообщений(Пользователь);
	
	Для Каждого ТекСообщение Из МассивСообщений Цикл
		Оповещение		   = Новый ОписаниеОповещения("_ОбработатьНажатиеСообщенияКлиент", ЭтотОбъект, ТекСообщение);
		ПоказатьОповещениеПользователя(ТекСообщение.ТекстНовости, Оповещение, ,
										БиблиотекаКартинок.ИнформацияНовости16Анимированная,
										СтатусОповещенияПользователя.Важное,
										XMLСтрока(ТекСообщение.ИдентификаторНовости)); //  НовостиИнформация1_32
	КонецЦикла;		
	
КонецПроцедуры	// ()

Процедура _ОбработатьНажатиеСообщенияКлиент(Параметры) Экспорт
	
	ФормаВладелец = Неопределено;
	Уникальность = Ложь;
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ИнициаторОткрытияНовости", "Неизвестно");
	ПараметрыОткрытияФормы.Вставить("РежимОткрытияОкна"		  , "Независимое");
	ПараметрыОткрытияФормы.Вставить("ПоказыватьКнопкиЗакрытия", Ложь);
	ПараметрыОткрытияФормы.Вставить("ИдентификаторМеста"	  , "");
	
	
	Если ( Параметры.ИдентификаторНовости = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000") ) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ( ПустаяСтрока(Параметры.ДополнительныеЗначения) ) Тогда
		Ст = _РаботаСИнтерфейсомСервер.ПолучитьРасшифровкуДополнительныхЗначенийСообщения( Параметры.ДополнительныеЗначения );
		
		Если Ст.ИмяДокумента = "ЗаказПоставщику" Тогда
			ПолучитьОкноРабочегоСтолаЗакупки(Ст);
		ИначеЕсли Ст.ИмяДокумента = "ЗаказКлиента" Тогда
			ПолучитьОкноРабочегоСтолаПродаж(Ст);
		КонецЕсли;
	КонецЕсли;
	
	
	
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	_РаботаСИнтерфейсомСервер.ЗаписатьИзменениеСостоянияНовостиСервер(Параметры.ИдентификаторНовости, Истина, 0, Ложь, , ТекущийПользователь);
	
	
	
КонецПроцедуры	// Компит_ОбработатьНажатиеСообщения()

Процедура ПолучитьОкноРабочегоСтолаПродаж(Параметры)
	
	ОкнаПриложения = ПолучитьОкна();
	Для Каждого ТекОкно Из ОкнаПриложения Цикл
		Если НЕ Найти(ТекОкно.Заголовок, "(Компит) Рабочий стол менеджера по продажам") = 0 Тогда
			УникальныйИдентификаторОкнаПродаж = ТекОкно.Содержимое[0].УникальныйИдентификатор;
			НайденнаяФорма = ТекОкно.Содержимое[0];
			ПараметрыРабочегоСтола = Новый Структура("НомерЗаказа, ДатаЗаказа", Параметры.НомерДокумента, Параметры.ДатаДокумента);
			НайденнаяФорма.Объект.ПараметрыЗаказа = ПараметрыРабочегоСтола;
			УстановитьОтборПоНомеруЗаказаРабСтолПродажи(НайденнаяФорма, Параметры);
			
			
			ТекОкно.Активизировать();
			Возврат;
		КонецЕсли;
	КонецЦикла;		// ТекОкно Из ОкнаПриложения
	
	ПараметрыРабочегоСтола = Новый Структура("НомерЗаказа, ДатаЗаказа", Параметры.НомерДокумента, Параметры.ДатаДокумента);
	ОткрытьФорму("Обработка._РабочийСтолМенеджераПоПродажам.Форма", ПараметрыРабочегоСтола, , Новый УникальныйИдентификатор);
КонецПроцедуры // ПолучитьОкноРабочегоСтолаПродаж()

Процедура ПолучитьОкноРабочегоСтолаЗакупки(Параметры)
	
	ОкнаПриложения = ПолучитьОкна();
	Для Каждого ТекОкно Из ОкнаПриложения Цикл
		Если НЕ Найти(ТекОкно.Заголовок, "Рабочий стол  менеджера по закупкам") = 0 Тогда
			УстановитьОтборПоНомеруЗаказаРабСтолЗакупки = ТекОкно.Содержимое[0].УникальныйИдентификатор;
			НайденнаяФорма = ТекОкно.Содержимое[0];
			ПараметрыРабочегоСтола = Новый Структура("НомерЗаказа, ДатаЗаказа", Параметры.НомерДокумента, Параметры.ДатаДокумента);
			НайденнаяФорма.Объект.ПараметрыЗаказа = ПараметрыРабочегоСтола;
			УстановитьОтборПоНомеруЗаказаРабСтолЗакупки(НайденнаяФорма, Параметры);
			
			
			ТекОкно.Активизировать();
			Возврат;
		КонецЕсли;
	КонецЦикла;		// ТекОкно Из ОкнаПриложения
	
	ПараметрыРабочегоСтола = Новый Структура("НомерЗаказа, ДатаЗаказа", Параметры.НомерДокумента, Параметры.ДатаДокумента);
	ОткрытьФорму("Обработка._РабочийСтолМенеджераПоЗакупкамДинамическийСписок.Форма.Форма", ПараметрыРабочегоСтола, , Новый УникальныйИдентификатор);
	
КонецПроцедуры	

Процедура УстановитьОтборПоНомеруЗаказаРабСтолПродажи(НайденнаяФорма, Параметры)
	
			ЭлементДобавлен = Ложь;
			Для Каждого ЭлементНастройки Из НайденнаяФорма.ЗаказыКлиентовСписок.Отбор.Элементы Цикл
				Если Строка(ЭлементНастройки.ЛевоеЗначение) = "Номер" Тогда
					ЭлементДобавлен                      = Истина;
					ЭлементНастройки.ВидСравнения        = ВидСравненияКомпоновкиДанных.Равно;
					Номер       			             = Параметры.НомерДокумента;
					ЭлементНастройки.ПравоеЗначение      = Номер;
					ЭлементНастройки.Использование       = Истина;
				КонецЕсли;
			КонецЦикла;		// ЭлементНастройки Из ЗаказыКлиентовСписок.Отбор.Элементы 
			
			Если НЕ ЭлементДобавлен Тогда
				НовЭлементОтбора                         = НайденнаяФорма.ЗаказыКлиентовСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовЭлементОтбора.ЛевоеЗначение           = Новый ПолеКомпоновкиДанных("Номер"); 
				НовЭлементОтбора.ВидСравнения			 = ВидСравненияКомпоновкиДанных.Равно;
				Номер       			         	     = Параметры.НомерДокумента;
				НовЭлементОтбора.ПравоеЗначение 	     = Номер;
				НовЭлементОтбора.Использование           = Истина;
			КонецЕсли;
	
КонецПроцедуры	// УстановитьОтборПоНомеруЗаказаРабстолПродажи()

Процедура УстановитьОтборПоНомеруЗаказаРабСтолЗакупки(НайденнаяФорма, Параметры)
	
			ЭлементДобавлен = Ложь;
			Для Каждого ЭлементНастройки Из НайденнаяФорма.ЗаказыПоставщикамСписок.Отбор.Элементы Цикл
				Если Строка(ЭлементНастройки.ЛевоеЗначение) = "Номер" Тогда
					ЭлементДобавлен                      = Истина;
					ЭлементНастройки.ВидСравнения        = ВидСравненияКомпоновкиДанных.Равно;
					Номер       			             = Параметры.НомерДокумента;
					ЭлементНастройки.ПравоеЗначение      = Номер;
					ЭлементНастройки.Использование       = Истина;
				КонецЕсли;
			КонецЦикла;		// ЭлементНастройки Из ЗаказыКлиентовСписок.Отбор.Элементы 
			
			Если НЕ ЭлементДобавлен Тогда
				НовЭлементОтбора                         = НайденнаяФорма.ЗаказыПоставщикамСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовЭлементОтбора.ЛевоеЗначение           = Новый ПолеКомпоновкиДанных("Номер"); 
				НовЭлементОтбора.ВидСравнения			 = ВидСравненияКомпоновкиДанных.Равно;
				Номер       			         	     = Параметры.НомерДокумента;
				НовЭлементОтбора.ПравоеЗначение 	     = Номер;
				НовЭлементОтбора.Использование           = Истина;
			КонецЕсли;
	
КонецПроцедуры	// УстановитьОтборПоНомеруЗаказаРабстолПродажи()

#КонецОбласти