////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

#Область ОбработчикиСобытий

Процедура ПередУдалением(Отказ)
	РегистрыСведений.Кт_ОбработкаЗаявкиНаДоставку.УдалитьКлючОбработкиЗаказа( ЭтотОбъект.Ссылка );
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	
	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
	
КонецПроцедуры	//ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)()


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	
	//Если ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
	//	
	//ИначеЕсли ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЗаказКлиента") Тогда	

	//	Если НЕ ДанныеЗаполнения.Основание = Неопределено И ДанныеЗаполнения.Основание.Закрыт Тогда
	//		Возврат;
	//	КонецЕсли; 
	//Иначе
	//    Возврат;
	//КонецЕсли;	
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 
		ДокументОснование = ДанныеЗаполнения.Основание;
		ТипДанныхЗаполнения = ТипЗнч(ДокументОснование); 
	Иначе 
		ДокументОснование = ДанныеЗаполнения;
		ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	КонецЕсли;	
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		_ВидЗаявки = Перечисления._ВидыЗаявки.ДоКлиента;
		ЗаполнитьДокументНаОснованииЗаказа(ДокументОснование); 
		СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента;
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказПоставщику") Тогда	
		_ВидЗаявки = Перечисления._ВидыЗаявки.ОтПоставщика;	
		ЗаполнитьДокументНаОснованииЗаказаПоставщику(ДокументОснование);
		СпособДоставки = Перечисления.СпособыДоставки.НашимиСиламиСАдресаОтправителя;
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда	
		_ВидЗаявки = Перечисления._ВидыЗаявки.ОтПоставщика;	
		ЗаполнитьДокументНаОснованииВнутреннегоЗаказа(ДокументОснование);
		СпособДоставки = Перечисления.СпособыДоставки.НашимиСиламиСАдресаОтправителя;
	//ИначеЕсли ТипДанныхЗаполнения = Тип("Массив") Тогда	
	//	ЗаполнитьДокументНаОснованииЗаказов(ДанныеЗаполнения);
	Иначе
		ВызватьИсключение НСтр("ru='Документ может быть создан только на основании заказа клиента, внутреннего заказа или заказа поставщику.'");
        Возврат;
	КонецЕсли;  	
	
	КлючУникальности = Новый УникальныйИдентификатор;
КонецПроцедуры	//ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

&НаСервере
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ( РегистрыСведений.Кт_ОбработкаЗаявкиНаДоставку.ПолучитьКлючОбработкиЗаказа( ЭтотОбъект.Ссылка ) ) Тогда
		Возврат
	КонецЕсли;
	
	//**ДОБАВЛЕНО Максимов В.А.
	
	Если ЭтотОбъект.СпособДоставки <> Перечисления.СпособыДоставки.Самовывоз Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ЗонаДоставки) Тогда
	 		Сообщить("Не заполнено поле Зона доставки");
		   	Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;	                              
	
	//*************************
	
	Если НЕ ЭтотОбъект.ВеземДокументы Тогда
		_ОбработкаДоставкиТоваровСервер.СформироватьЗаписиРегистра_ЗаказЗаявка(ЭтотОбъект, ЭтотОбъект.КлючУникальности,,Истина);
		
		_ОбработкаДоставкиТоваровСервер.ОбработкаЗаказов(ЭтотОбъект, ЭтотОбъект.КлючУникальности);  
		РегистрыСведений.Кт_ОбработкаЗаявкиНаДоставку.УстановитьКлючОбработкиЗаказа( ЭтотОбъект.Ссылка );
		ЗаписатьЗаказы();
		СоздатьОрдераСервер(Отказ);
	Иначе
		//СоздатьПоручениеЭкспедитору(Отказ);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если НЕ РегистрыСведений.Кт_ОбработкаЗаявкиНаДоставку.ПолучитьКлючОбработкиЗаказа( ЭтотОбъект.Ссылка ) Тогда
		Возврат
	КонецЕсли; 
	
	КлючУникальности = ЭтотОбъект.КлючУникальности;
	_ОбработкаДоставкиТоваровСервер.ОбработкаЗаказов(ЭтотОбъект, КлючУникальности, Истина);
	_ОбработкаДоставкиТоваровСервер.СформироватьЗаписиРегистра_ЗаказЗаявка(ЭтотОбъект, КлючУникальности, Истина);
	
	//Просто удалим запись об обработке
	РегистрыСведений.Кт_ОбработкаЗаявкиНаДоставку.УдалитьКлючОбработкиЗаказа( ЭтотОбъект.Ссылка );

	
  	УдалитьОрдераСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗаказы()
	Для каждого ТекЗаказ Из ЭтотОбъект.Заказы Цикл
		ТекЗаказ = ТекЗаказ.ЗаказКлиента.ПолучитьОбъект();
		_ДоработкиСлужебный.ЗаписатьДокументКлиента(ТекЗаказ, Истина);
	КонецЦикла;
КонецПроцедуры

Функция ОснованиеЗаказНаВнутреннееПотребление() Экспорт
	
	ТипВнутреннегоЗаказа = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление");
	
	Если ЗначениеЗаполнено(ДокументОснование)
		И ТипЗнч(ДокументОснование) = ТипВнутреннегоЗаказа Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Каждого СтрокаЗаказа Из Заказы Цикл
		Если ЗначениеЗаполнено(СтрокаЗаказа.ЗаказКлиента)
			И ТипЗнч(СтрокаЗаказа.ЗаказКлиента) = ТипВнутреннегоЗаказа Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОснованиеЗаказНаВнутреннееПотребление() Тогда
		МассивНепроверяемыхРеквизитов = Новый Массив;
		МассивНепроверяемыхРеквизитов.Добавить("Партнер");
		МассивНепроверяемыхРеквизитов.Добавить("Контрагент");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.ВеземДокументы Тогда
		
		Если ЭтотОбъект.Товары.Количество() = 0 Тогда
		 	Отказ = Истина;
			
			ТекстСообщения = НСтр("ru='Не заполнена табличная часть ""Товары""'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				ЭтотОбъект.Ссылка,
				,
				"Объект",
				Истина);
			КонецЕсли;
		
	 КонецЕсли;	
	 
КонецПроцедуры	// ОбработкаПроверкиЗаполнения()

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА ЗАПОЛОНЕНИЯ

#Область ОбработкаЗаполнение

&НаСервере
Процедура ЗаполнитьПартнера()
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(ЭтотОбъект.Партнер, ЭтотОбъект.Контрагент,  Истина);
	Если ЗначениеЗаполнено(Контрагент) Тогда
		_ОбработкаДоставкиТоваровСервер.ЗаполнитьПодчиненныеСвойстваПартнера( ЭтотОбъект);
	КонецЕсли; 
	ПартнерыИКонтрагенты.ЗаполнитьКонтактноеЛицоПартнераПоУмолчанию(ЭтотОбъект.Партнер, ЭтотОбъект.КонтактноеЛицо);
КонецПроцедуры	//ЗаполнитьПартнера()

&НаСервере
Функция ПроверитьДату(ДатаПроверки, ГодПроверки )
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
	               |	ДанныеПроизводственногоКалендаря.ВидДня КАК ВидДня
	               |ИЗ
	               |	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	               |ГДЕ
	               |	ДанныеПроизводственногоКалендаря.Дата = &ДатаПроверки
	               |	И ДанныеПроизводственногоКалендаря.Год = &ГодПроверки
				   |";
	
	Запрос.УстановитьПараметр("ДатаПроверки",НачалоДня(ДатаПроверки));
	Запрос.УстановитьПараметр("ГодПроверки" ,ГодПроверки);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Если Выборка.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		 	
КонецФункции // ПроверитьДату()

#КонецОбласти

#Область ЗаполнениеНаОснованииЗаказаКлиента

&НаСервере
Процедура ЗаполнитьДокументНаОснованииЗаказа(Знач ЗаказКлиента)
	
	НужныДокументы	= Истина;
	
	//Если ПроверкаЗаполненостиТЧТовары Тогда
	НоваяСтрока					= Заказы.Добавить();
	НоваяСтрока.НомерЗаказа		= ЗаказКлиента.Номер;
	НоваяСтрока.ДатаЗаказа		= ЗаказКлиента.Дата;
	НоваяСтрока.ЗаказКлиента	= ЗаказКлиента.Ссылка;
	НоваяСтрока.НужныДокументы	= Истина;
	//КонецЕсли;		//ПроаеркаЗаполненостиТЧТовары 	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаВыбораЗаказа();
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	МассивДопустимыхСтатусов = Новый Массив();
	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаказовКлиентов.КОбеспечению);
	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаказовКлиентов.КОтгрузке);
	
	//++ Обновление
	//ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(
	//	Выборка.ДокументОснование,
	//	Выборка.СтатусДокумента,
	//	Выборка.ЕстьОшибкиПроведен,
	//	Выборка.ЕстьОшибкиСтатус,
	//	МассивДопустимыхСтатусов);
	ПараметрыПроверки = ОбщегоНазначенияУТ.ПараметрыПроверкиВозможностиВводаНаОсновании();
	ПараметрыПроверки.Вставить("Статус", Выборка.СтатусДокумента);
	ПараметрыПроверки.Вставить("ЕстьОшибкиПроведен", Выборка.ЕстьОшибкиПроведен);
	ПараметрыПроверки.Вставить("ЕстьОшибкиСтатус", Выборка.ЕстьОшибкиСтатус);
	ПараметрыПроверки.Вставить("МассивДопустимыхСтатусов", МассивДопустимыхСтатусов);
	ПараметрыПроверки.Вставить("СоглашениеДоступноВнешнемуПользователю", Неопределено);
	ПараметрыПроверки.Вставить("ПрерыватьВыполнение", Истина);
	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОснованииСПараметрами(ЗаказКлиента, ПараметрыПроверки);
	//--
	//Заполнение шапки
	ЗаполнитьШапкуЗаказа(Выборка.Ссылка);
	
	//Заполнение табличных частей
	ЗаполнитьТЧТовары(Выборка.Ссылка);
	
КонецПроцедуры	//ЗаполнитьДокументНаОснованииЗаказа(ДанныеЗаполнения)

&НаСервере
Процедура ЗаполнитьДокументНаОснованииВнутреннегоЗаказа(Знач ЗаказКлиента)
	
	НужныДокументы	= Истина;

	//Если ПроверкаЗаполненостиТЧТовары Тогда
	НоваяСтрока					= Заказы.Добавить();
	НоваяСтрока.НомерЗаказа		= ЗаказКлиента.Номер;
	НоваяСтрока.ДатаЗаказа		= ЗаказКлиента.Дата;
	НоваяСтрока.ЗаказКлиента	= ЗаказКлиента.Ссылка;
	НоваяСтрока.НужныДокументы	= Истина;
	//КонецЕсли;		//ПроаеркаЗаполненостиТЧТовары 	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаВыбораВнутреннегоЗаказа();
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	МассивДопустимыхСтатусов = Новый Массив();
	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыВнутреннихЗаказов.КВыполнению);
	
	//++ Обновление
	//ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(
	//	Выборка.ДокументОснование,
	//	Выборка.СтатусДокумента,
	//	Выборка.ЕстьОшибкиПроведен,
	//	Выборка.ЕстьОшибкиСтатус,
	//	МассивДопустимыхСтатусов);
	ПараметрыПроверки = ОбщегоНазначенияУТ.ПараметрыПроверкиВозможностиВводаНаОсновании();
	ПараметрыПроверки.Вставить("Статус", Выборка.СтатусДокумента);
	ПараметрыПроверки.Вставить("ЕстьОшибкиПроведен", Выборка.ЕстьОшибкиПроведен);
	ПараметрыПроверки.Вставить("ЕстьОшибкиСтатус", Выборка.ЕстьОшибкиСтатус);
	ПараметрыПроверки.Вставить("МассивДопустимыхСтатусов", МассивДопустимыхСтатусов);
	ПараметрыПроверки.Вставить("СоглашениеДоступноВнешнемуПользователю", Неопределено);
	ПараметрыПроверки.Вставить("ПрерыватьВыполнение", Истина);
	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОснованииСПараметрами(ЗаказКлиента, ПараметрыПроверки);
	//--
	//Заполнение шапки
	Статус					= Перечисления._СтатусыЗаявокНаДоставку.КВыполнению;
	Организация     		= ЗаказКлиента.Организация;
	Склад					= ЗаказКлиента.Склад;
	НаправлениеДеятельности	= ЗаказКлиента.НаправлениеДеятельности;
	ДокументОснование		= ЗаказКлиента.Ссылка;
	
	ЖелаемаяДатаОтгрузки	= _ДоработкиСлужебный.ПолучитьСледующийДень(Дата); 

	Для каждого СтрТоварыЗаказ Из ЗаказКлиента.Товары Цикл
	    Если ЗначениеЗаполнено(СтрТоварыЗаказ.АналитикаРасходов) и ТипЗнч(СтрТоварыЗаказ.АналитикаРасходов) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		     Партнер    = СтрТоварыЗаказ.АналитикаРасходов.Партнер;
		     Контрагент = СтрТоварыЗаказ.АналитикаРасходов.Контрагент;
		     Прервать;
		КонецЕсли;
	КонецЦикла;
	//Заполнение табличных частей
	ЗаполнитьТЧТоварыВнутреннегоЗаказа(Выборка.Ссылка);
	
КонецПроцедуры	//ЗаполнитьДокументНаОснованииЗаказа(ДанныеЗаполнения)


&НаСервере
Процедура ЗаполнитьШапкуЗаказа(ТекЗаказ, ЗаполнитьОснование = Истина)
	Статус					= Перечисления._СтатусыЗаявокНаДоставку.КВыполнению;
	Организация     		= ТекЗаказ.Организация;
	Склад					= ТекЗаказ.Склад;
	Партнер					= ТекЗаказ.Ссылка.Партнер;
	НаправлениеДеятельности	= ТекЗаказ.НаправлениеДеятельности;
	
	Если ЗаполнитьОснование Тогда
		ДокументОснование		= ТекЗаказ.Ссылка;
	КонецЕсли;
	
	//	ЖелаемаяДатаОтгрузки	= ?(ЗначениеЗаполнено(ТекЗаказ.ЖелаемаяДатаОтгрузки), ТекЗаказ.ЖелаемаяДатаОтгрузки, ?(ЗначениеЗаполнено(ТекЗаказ.ДатаОтгрузки),  ТекЗаказ.ДатаОтгрузки, Дата(1,1,1)));
	//ЖелаемаяДатаОтгрузки	= _ДоработкиСлужебный.ПолучитьСледующийДень(ДокументОснование.Дата); 
	ЖелаемаяДатаОтгрузки	= _ДоработкиСлужебный.ПолучитьСледующийДень(Дата); 
	
	ЗаполнитьПартнера();
КонецПроцедуры	// ЗаполнитьШапкуЗаказа()

&НаСервере
Функция ТекстЗапросаВыбораЗаказа(ПоискПоССылке = Истина)
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ЗаказКлиента.Ссылка,
					|	ЗаказКлиента.Номер,
					|	ЗаказКлиента.Дата,
					|	ЗаказКлиента.Организация КАК Организация,
					|	ЗаказКлиента.Партнер КАК  Партнер,
					|	ЗаказКлиента.Статус КАК СтатусДокумента,
					|	ЗаказКлиента.Приоритет КАК Приоритет,
					|	ЗаказКлиента.Проведен КАК Проведен,
					|	ЗаказКлиента.Склад КАК СкладДокумента,
					|	ЗаказКлиента.Склад.ЭтоГруппа КАК ЭтоГруппа,
					|	ЗаказКлиента.НаправлениеДеятельности КАК НаправлениеДеятельности,
					|	ЗаказКлиента.ДокументОснование,
					|	ЗаказКлиента.ДатаОтгрузки,
					|	ЗаказКлиента.АдресДоставки,
					|	НЕ ЗаказКлиента.Проведен КАК ЕстьОшибкиПроведен,
					|	ЗаказКлиента.ПометкаУдаления КАК ЕстьОшибкиУдален,
					|";
	
		Если ПоискПоССылке Тогда
			ТекстЗапроса = ТекстЗапроса + "
					|	ВЫБОР
					|		КОГДА ( ЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОбеспечению) )
					|			ТОГДА ЛОЖЬ
					|		ИНАЧЕ ИСТИНА
					|	КОНЕЦ КАК ЕстьОшибкиСтатус
					|";
		Иначе
			ТекстЗапроса = ТекстЗапроса + "
					|	ВЫБОР
					|		КОГДА ( ЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОбеспечению) ) ИЛИ
					|			  ( ЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОтгрузке) )	
					|			ТОГДА ЛОЖЬ
					|		ИНАЧЕ ИСТИНА
					|	КОНЕЦ КАК ЕстьОшибкиСтатус
					|";
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + "
					|ИЗ
					|	Документ.ЗаказКлиента КАК ЗаказКлиента
					|";
		Если ПоискПоССылке Тогда
			ТекстЗапроса = ТекстЗапроса + "
					|ГДЕ
					|	ЗаказКлиента.Ссылка = &ЗаказКлиента
					|"
		Иначе
			ТекстЗапроса = ТекстЗапроса + "
					|ГДЕ
					|	ЗаказКлиента.Номер = &Номер
					|	И ЗаказКлиента.Дата = &Дата
					|	И ЗаказКлиента.Организация = &Организация
					|	И ЗаказКлиента.Партнер = &Партнер
					|"
		КонецЕсли;
				
		ТекстЗапроса = ТекстЗапроса + "
					|";
	
	Возврат ТекстЗапроса;
КонецФункции	// ТекстЗапросаЗаказа()

&НаСервере
Функция ТекстЗапросаВыбораВнутреннегоЗаказа(ПоискПоССылке = Истина)
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ЗаказКлиента.Ссылка,
					|	ЗаказКлиента.Номер,
					|	ЗаказКлиента.Дата,
					|	ЗаказКлиента.Организация КАК Организация,
					|	ЗаказКлиента.Статус КАК СтатусДокумента,
					|	ЗаказКлиента.Приоритет КАК Приоритет,
					|	ЗаказКлиента.Проведен КАК Проведен,
					|	ЗаказКлиента.Склад КАК СкладДокумента,
					|	ЗаказКлиента.Склад.ЭтоГруппа КАК ЭтоГруппа,
					|	ЗаказКлиента.НаправлениеДеятельности КАК НаправлениеДеятельности,
					|	ЗаказКлиента.ДокументОснование,
					|	ЗаказКлиента.ДатаОтгрузки,
					|	ЗаказКлиента.Комментарий КАК АдресДоставки,
					|	НЕ ЗаказКлиента.Проведен КАК ЕстьОшибкиПроведен,
					|	ЗаказКлиента.ПометкаУдаления КАК ЕстьОшибкиУдален,
					|";
	
		Если ПоискПоССылке Тогда
			ТекстЗапроса = ТекстЗапроса + "
					|	ВЫБОР
					|		КОГДА ( ЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВнутреннихЗаказов.КВыполнению) )
					|			ТОГДА ЛОЖЬ
					|		ИНАЧЕ ИСТИНА
					|	КОНЕЦ КАК ЕстьОшибкиСтатус
					|";
		Иначе
			ТекстЗапроса = ТекстЗапроса + "
					|	ВЫБОР
					|		КОГДА ( ЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВнутреннихЗаказов.КВыполнению) ) ИЛИ
					|			  ( ЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВнутреннихЗаказов.НаСогласовании) )	
					|			ТОГДА ЛОЖЬ
					|		ИНАЧЕ ИСТИНА
					|	КОНЕЦ КАК ЕстьОшибкиСтатус
					|";
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + "
					|ИЗ
					|	Документ.ЗаказНаВнутреннееПотребление КАК ЗаказКлиента
					|";
		Если ПоискПоССылке Тогда
			ТекстЗапроса = ТекстЗапроса + "
					|ГДЕ
					|	ЗаказКлиента.Ссылка = &ЗаказКлиента
					|"
		Иначе
			ТекстЗапроса = ТекстЗапроса + "
					|ГДЕ
					|	ЗаказКлиента.Номер = &Номер
					|	И ЗаказКлиента.Дата = &Дата
					|	И ЗаказКлиента.Организация = &Организация
					|"
		КонецЕсли;
				
		ТекстЗапроса = ТекстЗапроса + "
					|";
	
	Возврат ТекстЗапроса;
КонецФункции	// ТекстЗапросаЗаказа()

&НаСервере
Функция ЗаполнитьТЧТовары(ВыбранныйЗаказ) Экспорт
	
	ПроверкаЗаполненостиТЧТовары = Ложь;
	
	Выборка = ПолучитьЗаказ(ВыбранныйЗаказ,ТекущаяДата());
	
	Для Каждого ТекСтрока Из ВыбранныйЗаказ.Товары Цикл
		
		Если ТекСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется
			ИЛИ ТекСтрока._Отгрузка Тогда
			
			Продолжить;
		КонецЕсли;
		
		Отбор				  = Новый Структура("Номенклатура, Характеристика, Склад", ТекСтрока.Номенклатура, ТекСтрока.Характеристика, ТекСтрока.Склад);
		ОтборЗак			  = Новый Структура("Номенклатура, Характеристика, Серия, Склад, ВариантОбеспечения", ТекСтрока.Номенклатура, ТекСтрока.Характеристика, ТекСтрока.Серия, ТекСтрока.Склад, Перечисления.ВариантыОбеспечения.НеТребуется);
		ОтборТек			  = Новый Структура("Номенклатура, Характеристика, Серия, Склад, ВариантОбеспечения, _Отгрузка", ТекСтрока.Номенклатура, ТекСтрока.Характеристика, ТекСтрока.Серия, ВыбранныйЗаказ.Склад, Перечисления.ВариантыОбеспечения.КОбеспечению, Ложь);
		ОтборЗаказано		  = Новый Структура("Номенклатура, Характеристика, Серия, Склад, ВариантОбеспечения, _Отгрузка", ТекСтрока.Номенклатура, ТекСтрока.Характеристика, ТекСтрока.Серия, ВыбранныйЗаказ.Склад, Перечисления.ВариантыОбеспечения.Отгрузить, Истина);
		
		ПараметрыОтбора		  = Новый Структура();
		Назначение			  = Справочники.Назначения.НайтиПоРеквизиту("Заказ", ВыбранныйЗаказ); 
		ПараметрыОтбора.Вставить("Заказ",			ВыбранныйЗаказ);
		ПараметрыОтбора.Вставить("Назначение",		Назначение);
		ПараметрыОтбора.Вставить("Номенклатура",	ТекСтрока.Номенклатура);
		ПараметрыОтбора.Вставить("Характеристика",	ТекСтрока.Характеристика);
		ПараметрыОтбора.Вставить("Серия",			ТекСтрока.Серия);
		ПараметрыОтбора.Вставить("Склад",			ВыбранныйЗаказ.Склад);
		
		ОстатокНаСкладе		 = ОстатокНаСкладе(ПараметрыОтбора);
		ОстатокПоОтгузке	 = ОстатокПоОтгузке(ПараметрыОтбора);
		Если ОстатокНаСкладе - ОстатокПоОтгузке <= 0 Тогда
			ОстатокНаСкладе = 0;
		Иначе
			ОстатокНаСкладе = ОстатокНаСкладе - ОстатокПоОтгузке;
		КонецЕсли;
		
		МассивНайденныхСтрок = Выборка.НайтиСтроки(Отбор);
		Если МассивНайденныхСтрок.Количество() > 0 Тогда
			МассивЗаказано	 = ЭтотОбъект.Товары.НайтиСтроки(Отбор);
			КолЗаказано		 = 0;
			ЗаказаноПоЗаказу = ЗаказаноПоЗаказу(ВыбранныйЗаказ, ТекСтрока.Номенклатура, ТекСтрока.Характеристика, ТекСтрока.Серия);
			КоличествоОст	 = 0;
			//МассивЗаказа	 = ВыбранныйЗаказ.Товары.НайтиСтроки(ОтборЗак);
			МассивЗаказа	 = ВыбранныйЗаказ.Товары.НайтиСтроки(ОтборТек);
			Для Каждого тСтр Из МассивЗаказа Цикл
				КоличествоОст = КоличествоОст + тСтр.КоличествоУпаковок;
			КонецЦикла;		// тСтр Из 
			
			Если МассивЗаказано.Количество() > 0 Тогда
				Для Каждого ТекСтрЗаказано Из МассивЗаказано Цикл
 					КолЗаказано = КолЗаказано + ТекСтрЗаказано.Количество - ЗаказаноПоЗаказу;		//- КоличествоОст 
				КонецЦикла;
			КонецЕсли;
			//**** 2025-04-18
			ОстатокНаСкладе = ОстатокНаСкладе - КолЗаказано;
			//****
			
			мОстатокПоЗаказу = 0;
			Для Каждого тСтр Из МассивНайденныхСтрок Цикл
				мОстатокПоЗаказу = мОстатокПоЗаказу + тСтр.ОстатокПоЗаказу;
			КонецЦикла;		// тСтр Из МассивНайденныхСтрок
//			НайденнаяСтрока = МассивНайденныхСтрок[0];
			ОстатокПоЗаказу = ОстаткиПоЗаказу(ВыбранныйЗаказ, ТекСтрока, ТекущаяДата());			//** 
//			ОстатокПоЗаказу = НайденнаяСтрока.ОстатокПоЗаказу - ЗаказаноПоЗаказу;					
//			ОстатокПоЗаказу = мОстатокПоЗаказу - ЗаказаноПоЗаказу;									//** 
			Если ОстатокПоЗаказу < 0 Тогда
				Продолжить;
			КонецЕсли;
			
//**  			ОстатокНаСкладе = ПроверкаКоличестваНаСкладе(ТекСтрока,  ТекущаяДата()) - КолЗаказано;
			
			Если ОстатокНаСкладе > 0 Тогда
				Если ОстатокПоЗаказу > ОстатокНаСкладе Тогда
					КолВОтгрузку = ОстатокНаСкладе;
					Если КолВОтгрузку > ТекСтрока.КоличествоУпаковок Тогда
						КолВОтгрузку = ТекСтрока.КоличествоУпаковок;
					КонецЕсли; 
				Иначе
					КолВОтгрузку = ОстатокПоЗаказу;
					Если КолВОтгрузку > ТекСтрока.КоличествоУпаковок Тогда
						КолВОтгрузку = ТекСтрока.КоличествоУпаковок;
					КонецЕсли; 
				КонецЕсли;
				
				НоваяСтрока	= Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
				НоваяСтрока.Количество = КолВОтгрузку;
				Если ТекСтрока.Упаковка.Числитель = 0 Тогда
					Числитель = 1;
				Иначе
					Числитель = ТекСтрока.Упаковка.Числитель;
				КонецЕсли;
				НоваяСтрока.КоличествоУпаковок = КолВОтгрузку / Числитель;
				НоваяСтрока._УИДОтгрузка = ТекСтрока._УИДОтгрузка;
			КонецЕсли;		//ОстатокНаСкладе > 0
		КонецЕсли; 	//МассивНайденныхСтрок > 0
	КонецЦикла;
	
	Если (НЕ Товары.Количество() = 0) ИЛИ
		 (НЕ Товары.Итог("Количество") = 0) Тогда
		ПроверкаЗаполненостиТЧТовары = Истина;
	КонецЕсли;		// 		
	Возврат ПроверкаЗаполненостиТЧТовары;
	
КонецФункции	//ЗаполнитьТЧТовары()

&НаСервере
Функция ЗаполнитьТЧТоварыВнутреннегоЗаказа(ВыбранныйЗаказ) Экспорт
	
	ПроверкаЗаполненостиТЧТовары = Ложь;
	
//	ТекстЗапроса = 
//	"ВЫБРАТЬ
//	|	ЗаказыНаВнутреннееПотреблениеОбороты.КодСтроки КАК КодСтроки,
//	|	ЗаказыНаВнутреннееПотреблениеОбороты.Склад КАК Склад,
//	|	ЗаказыНаВнутреннееПотреблениеОбороты.Номенклатура КАК Номенклатура,
//	|	ЗаказыНаВнутреннееПотреблениеОбороты.Характеристика КАК Характеристика,
//	|	ЗаказыНаВнутреннееПотреблениеОбороты.Серия КАК Серия,
//	|	СУММА(ЗаказыНаВнутреннееПотреблениеОбороты.ЗаказаноОборот) КАК ЗаказаноОстаток,
//	|	СУММА(ЗаказыНаВнутреннееПотреблениеОбороты.КОформлениюОборот) КАК КОформлениюОстаток,
//	//|	СУММА(ЗаказыНаВнутреннееПотреблениеОбороты.ЗаказаноОборот - ЗаказыНаВнутреннееПотреблениеОбороты.КОформлениюОборот) КАК ОстатокПоЗаказу,
//	|	СУММА(ЗаказыНаВнутреннееПотреблениеОбороты.ЗаказаноОборот) КАК ОстатокПоЗаказу,
//	|	ЗаказыНаВнутреннееПотреблениеОбороты.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление
//	|ИЗ
//	|	РегистрНакопления.ЗаказыНаВнутреннееПотребление.Обороты(
//	|			,
//	|			&ДатаКон,
//	|			,
//	|			ЗаказНаВнутреннееПотребление = &ЗаказНаВнутреннееПотребление
//	|				И Склад = &Склад) КАК ЗаказыНаВнутреннееПотреблениеОбороты
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ЗаказыНаВнутреннееПотреблениеОбороты.Характеристика,
//	|	ЗаказыНаВнутреннееПотреблениеОбороты.Серия,
//	|	ЗаказыНаВнутреннееПотреблениеОбороты.Склад,
//	|	ЗаказыНаВнутреннееПотреблениеОбороты.Номенклатура,
//	|	ЗаказыНаВнутреннееПотреблениеОбороты.КодСтроки,
//	|	ЗаказыНаВнутреннееПотреблениеОбороты.ЗаказНаВнутреннееПотребление
//	|
//	|ИМЕЮЩИЕ
//	//|	СУММА(ЗаказыНаВнутреннееПотреблениеОбороты.ЗаказаноОборот - ЗаказыНаВнутреннееПотреблениеОбороты.КОформлениюОборот) > 0";
// 	|	СУММА(ЗаказыНаВнутреннееПотреблениеОбороты.ЗаказаноОборот) > 0";

//	Запрос = Новый Запрос;
//	Запрос.Текст = ТекстЗапроса;
//	
//	Запрос.УстановитьПараметр("ДатаКон",		КонецДня(ТекущаяДата()));
//	Запрос.УстановитьПараметр("ЗаказНаВнутреннееПотребление",	ВыбранныйЗаказ);
//	Запрос.УстановитьПараметр("Склад",			ВыбранныйЗаказ.Склад);
//	
//	Результат = Запрос.Выполнить();
//	
//	Если Результат.Пустой() Тогда
//	    Возврат ПроверкаЗаполненостиТЧТовары;
//	КонецЕсли;
//	
//	Выборка = Результат.Выгрузить(); 
//	
//	
	Для Каждого ТекСтрока Из ВыбранныйЗаказ.Товары Цикл
//		
//		Если ТекСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется
//			ИЛИ ТекСтрока._Отгрузка Тогда
//			
//			Продолжить;
//		КонецЕсли;
//		
//		Отбор				  = Новый Структура("Номенклатура, Характеристика, Склад", ТекСтрока.Номенклатура, ТекСтрока.Характеристика, ВыбранныйЗаказ.Склад);
//		ОтборЗак			  = Новый Структура("Номенклатура, Характеристика, Серия, Склад, ВариантОбеспечения", ТекСтрока.Номенклатура, ТекСтрока.Характеристика, ТекСтрока.Серия, ВыбранныйЗаказ.Склад, Перечисления.ВариантыОбеспечения.НеТребуется);
//		ОтборТек			  = Новый Структура("Номенклатура, Характеристика, Серия, Склад, ВариантОбеспечения, _Отгрузка", ТекСтрока.Номенклатура, ТекСтрока.Характеристика, ТекСтрока.Серия, ТекСтрока.Склад, Перечисления.ВариантыОбеспечения.КОбеспечению, Ложь);
//		ОтборЗаказано		  = Новый Структура("Номенклатура, Характеристика, Серия, Склад, ВариантОбеспечения, _Отгрузка", ТекСтрока.Номенклатура, ТекСтрока.Характеристика, ТекСтрока.Серия, ТекСтрока.Склад, Перечисления.ВариантыОбеспечения.Отгрузить, Истина);
//		
//		ПараметрыОтбора		  = Новый Структура();
//		Назначение			  = Справочники.Назначения.НайтиПоРеквизиту("Заказ", ВыбранныйЗаказ); 
//		ПараметрыОтбора.Вставить("Заказ",			ВыбранныйЗаказ);
//		ПараметрыОтбора.Вставить("Назначение",		Назначение);
//		ПараметрыОтбора.Вставить("Номенклатура",	ТекСтрока.Номенклатура);
//		ПараметрыОтбора.Вставить("Характеристика",	ТекСтрока.Характеристика);
//		ПараметрыОтбора.Вставить("Серия",			ТекСтрока.Серия);
//		ПараметрыОтбора.Вставить("Склад",			ТекСтрока.Склад);
//		
//		ОстатокНаСкладе		 = ОстатокНаСкладе(ПараметрыОтбора);
//		ОстатокПоОтгузке	 = ОстатокПоОтгузке(ПараметрыОтбора);
//		Если ОстатокНаСкладе - ОстатокПоОтгузке <= 0 Тогда
//			ОстатокНаСкладе = 0;
//		Иначе
//			ОстатокНаСкладе = ОстатокНаСкладе - ОстатокПоОтгузке;
//		КонецЕсли;
//		
//		МассивНайденныхСтрок = Выборка.НайтиСтроки(Отбор);
//		Если МассивНайденныхСтрок.Количество() > 0 Тогда
//			МассивЗаказано	 = ЭтотОбъект.Товары.НайтиСтроки(Отбор);
//			КолЗаказано		 = 0;
//			ЗаказаноПоЗаказу = ЗаказаноПоЗаказу(ВыбранныйЗаказ, ТекСтрока.Номенклатура, ТекСтрока.Характеристика, ТекСтрока.Серия);
//			КоличествоОст	 = 0;
//			//МассивЗаказа	 = ВыбранныйЗаказ.Товары.НайтиСтроки(ОтборЗак);
//			МассивЗаказа	 = ВыбранныйЗаказ.Товары.НайтиСтроки(ОтборТек);
//			Для Каждого тСтр Из МассивЗаказа Цикл
//				КоличествоОст = КоличествоОст + тСтр.КоличествоУпаковок;
//			КонецЦикла;		// тСтр Из 
//			
//			Если МассивЗаказано.Количество() > 0 Тогда
//				Для Каждого ТекСтрЗаказано Из МассивЗаказано Цикл
// 					КолЗаказано = КолЗаказано + ТекСтрЗаказано.Количество - ЗаказаноПоЗаказу;		//- КоличествоОст 
//				КонецЦикла;
//			КонецЕсли;
//			//**** 2025-04-18
//			ОстатокНаСкладе = ОстатокНаСкладе - КолЗаказано;
//			//****
//			
//			мОстатокПоЗаказу = 0;
//			Для Каждого тСтр Из МассивНайденныхСтрок Цикл
//				мОстатокПоЗаказу = мОстатокПоЗаказу + тСтр.ОстатокПоЗаказу;
//			КонецЦикла;		// тСтр Из МассивНайденныхСтрок
////			НайденнаяСтрока = МассивНайденныхСтрок[0];
//			ОстатокПоЗаказу = ОстаткиПоЗаказу(ВыбранныйЗаказ, ТекСтрока, ТекущаяДата());			//** 
////			ОстатокПоЗаказу = НайденнаяСтрока.ОстатокПоЗаказу - ЗаказаноПоЗаказу;					
////			ОстатокПоЗаказу = мОстатокПоЗаказу - ЗаказаноПоЗаказу;									//** 
//			Если ОстатокПоЗаказу < 0 Тогда
//				Продолжить;
//			КонецЕсли;
//			
////**  			ОстатокНаСкладе = ПроверкаКоличестваНаСкладе(ТекСтрока,  ТекущаяДата()) - КолЗаказано;
//			
//			Если ОстатокНаСкладе > 0 Тогда
//				Если ОстатокПоЗаказу > ОстатокНаСкладе Тогда
//					КолВОтгрузку = ОстатокНаСкладе;
//					Если КолВОтгрузку > ТекСтрока.КоличествоУпаковок Тогда
//						КолВОтгрузку = ТекСтрока.КоличествоУпаковок;
//					КонецЕсли; 
//				Иначе
//					КолВОтгрузку = ОстатокПоЗаказу;
//					Если КолВОтгрузку > ТекСтрока.КоличествоУпаковок Тогда
//						КолВОтгрузку = ТекСтрока.КоличествоУпаковок;
//					КонецЕсли; 
//				КонецЕсли;
//				
				НоваяСтрока	= Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
				НоваяСтрока.СтавкаНДС = ТекСтрока.Номенклатура.СтавкаНДС;
				//НоваяСтрока.Количество = КолВОтгрузку;
				Если ТекСтрока.Упаковка.Числитель = 0 Тогда
					Числитель = 1;
				Иначе
					Числитель = ТекСтрока.Упаковка.Числитель;
				КонецЕсли;
				НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество / Числитель;
				НоваяСтрока._УИДОтгрузка = ТекСтрока._УИДОтгрузка;
				НоваяСтрока.Склад = ВыбранныйЗаказ.Склад;
//			КонецЕсли;		//ОстатокНаСкладе > 0
//		КонецЕсли; 	//МассивНайденныхСтрок > 0
	КонецЦикла;
	
	Если (НЕ Товары.Количество() = 0) ИЛИ
		 (НЕ Товары.Итог("Количество") = 0) Тогда
		ПроверкаЗаполненостиТЧТовары = Истина;
	КонецЕсли;		// 		
	Возврат ПроверкаЗаполненостиТЧТовары;
	
КонецФункции	//ЗаполнитьТЧТовары()

&НаСервере
Функция ПроверкаКоличестваНаСкладе(СтрокаЗаказа, ДатаПроверки) Экспорт
	
	ОстатокНаСкладе = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстаткиИОбороты.Характеристика КАК Характеристика,
	|	ТоварыНаСкладахОстаткиИОбороты.Серия КАК Серия,
	|	ТоварыНаСкладахОстаткиИОбороты.Склад КАК Склад,
	|	ТоварыНаСкладахОстаткиИОбороты.ВНаличииКонечныйОстаток КАК ВНаличииОстаток,
	|	ТоварыНаСкладахОстаткиИОбороты.КОтгрузкеКонечныйОстаток КАК КОтгрузкеКонечныйОстаток,
	|	ТоварыНаСкладахОстаткиИОбороты.ВНаличииКонечныйОстаток - ТоварыНаСкладахОстаткиИОбороты.КОтгрузкеКонечныйОстаток КАК ОстатокТовара
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	|			,
	|			&ДатаКон,
	|			Секунда,
	|			ДвиженияИГраницыПериода,
	|			Склад = &ВыбСклад
	|				И Номенклатура = &ВыбНоменклатура
	|				И Характеристика = &Характеристика
	|				И Серия = &Серия) КАК ТоварыНаСкладахОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	|	ТоварыНаСкладахОстаткиИОбороты.Характеристика,
	|	ТоварыНаСкладахОстаткиИОбороты.Серия,
	|	ТоварыНаСкладахОстаткиИОбороты.Склад,
	|	ТоварыНаСкладахОстаткиИОбороты.ВНаличииКонечныйОстаток,
	|	ТоварыНаСкладахОстаткиИОбороты.КОтгрузкеКонечныйОстаток";
	
	Запрос.УстановитьПараметр("ДатаКон", 		 КонецДня(ДатаПроверки));
	Запрос.УстановитьПараметр("ВыбНоменклатура", СтрокаЗаказа.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",  СтрокаЗаказа.Характеристика);
	Запрос.УстановитьПараметр("Серия", 			 СтрокаЗаказа.Серия);
	Запрос.УстановитьПараметр("ВыбСклад", 		 СтрокаЗаказа.Склад);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОстатокНаСкладе = ОстатокНаСкладе + Выборка.ОстатокТовара;
	КонецЦикла;
	
	Возврат ОстатокНаСкладе;
	
КонецФункции	//ПроверкаКоличестваНаСкладе()

&НаСервере
Функция ОстаткиПоЗаказу(ВыбранныйЗаказ, СтрокаЗаказа, ДатаПроверки) Экспорт
	
	ОстатокПоЗаказу = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаспоряженияНаОтгрузкуОбороты.Распоряжение КАК ЗаказКлиента,
	|	РаспоряженияНаОтгрузкуОбороты.Склад КАК Склад,
	|	РаспоряженияНаОтгрузкуОбороты.Номенклатура КАК Номенклатура,
	|	РаспоряженияНаОтгрузкуОбороты.Характеристика КАК Характеристика,
	|	РаспоряженияНаОтгрузкуОбороты.Серия КАК Серия,
	|	СУММА(РаспоряженияНаОтгрузкуОбороты.ЗаказаноОборот) КАК ЗаказаноОборот,
	|	СУММА(РаспоряженияНаОтгрузкуОбороты.КОформлениюОборот) КАК КОформлениюОборот,
	|	СУММА(РаспоряженияНаОтгрузкуОбороты.ЗаказаноОборот - РаспоряженияНаОтгрузкуОбороты.КОформлениюОборот) КАК ОстатокПоЗаказу
	|ИЗ
	|	РегистрНакопления.РаспоряженияНаОтгрузку.Обороты(
	|			,
	|			&ДатаКон,
	|			,
	|			Распоряжение = &ЗаказКлиента
	|				И Склад = &Склад
	|				И Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Серия = &Серия) КАК РаспоряженияНаОтгрузкуОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспоряженияНаОтгрузкуОбороты.Номенклатура,
	|	РаспоряженияНаОтгрузкуОбороты.Распоряжение,
	|	РаспоряженияНаОтгрузкуОбороты.Склад,
	|	РаспоряженияНаОтгрузкуОбороты.Характеристика,
	|	РаспоряженияНаОтгрузкуОбороты.Серия";
	Запрос.УстановитьПараметр("ДатаКон",		КонецДня(ДатаПроверки));
	Запрос.УстановитьПараметр("ЗаказКлиента",	ВыбранныйЗаказ);
	Запрос.УстановитьПараметр("Склад",			СтрокаЗаказа.Склад);
	Запрос.УстановитьПараметр("Номенклатура",	СтрокаЗаказа.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",	СтрокаЗаказа.Характеристика);
	Запрос.УстановитьПараметр("Серия",			СтрокаЗаказа.Серия);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОстатокПоЗаказу = ОстатокПоЗаказу + Выборка.ОстатокПоЗаказу;
	КонецЦикла;
	
	Возврат ОстатокПоЗаказу;
	
КонецФункции // ОстаткиПоЗаказу()

&НаСервере
Функция ОстатокНаСкладе(ПараметрыОтбора)
	
	ВыбранныйЗаказ	= ПараметрыОтбора.Заказ;
	Назначение		= ПараметрыОтбора.Назначение;
	Номенклатура	= ПараметрыОтбора.Номенклатура;
	Характеристика	= ПараметрыОтбора.Характеристика;
	
	Если ( ПараметрыОтбора.Свойство("Серия") ) Тогда
		Серия		= ПараметрыОтбора.Серия;
	Иначе	
		Серия 		= Справочники.СерииНоменклатуры.ПустаяСсылка();
	КонецЕсли;		
	//Склад			= ПараметрыОтбора.Склад;
	ДатаПроверки	= ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	0 КАК Индекс,
	               |	ТоварыНаСкладахОстатки.Назначение КАК Назначение,
	               |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	               |	ТоварыНаСкладахОстатки.Серия КАК Серия,
	               |	ТоварыНаСкладахОстатки.Склад КАК Склад,
	               |	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток,0) КАК ВНаличииОстаток
	               |ПОМЕСТИТЬ ВТ_Остатки
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	               |			&ДатаОтбора,
	               |			Назначение = &Назначение
	               |				И Номенклатура = &Номенклатура
	               |				И Характеристика = &Характеристика
	               |				И Серия = &Серия
	               |				И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	               |
				   //|ОБЪЕДИНИТЬ ВСЕ
				   //|
				   //|ВЫБРАТЬ
				   //|	1,
				   //|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
				   //|	ТоварыНаСкладахОстатки.Номенклатура,
				   //|	ТоварыНаСкладахОстатки.Характеристика,
				   //|	ТоварыНаСкладахОстатки.Серия,
				   //|	ТоварыНаСкладахОстатки.Склад,
				   //|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток,0)
				   //|ИЗ
				   //|	РегистрНакопления.ТоварыНаСкладах.Остатки(
				   //|			&ДатаОтбора,
				   //|			Номенклатура = &Номенклатура
				   //|				И Характеристика = &Характеристика
				   //|				И Серия = &Серия
				   //|				И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Остатки.Индекс КАК Индекс,
	               |	ВТ_Остатки.Назначение КАК Назначение,
	               |	ВТ_Остатки.Номенклатура КАК Номенклатура,
	               |	ВТ_Остатки.Характеристика КАК Характеристика,
	               |	ВТ_Остатки.Серия КАК Серия,
	               |	ВТ_Остатки.Склад КАК Склад,
	               |	СУММА(ВТ_Остатки.ВНаличииОстаток) КАК ВНаличииОстаток
	               |ИЗ
	               |	ВТ_Остатки КАК ВТ_Остатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Остатки.Индекс,
	               |	ВТ_Остатки.Назначение,
	               |	ВТ_Остатки.Номенклатура,
	               |	ВТ_Остатки.Характеристика,
	               |	ВТ_Остатки.Серия,
	               |	ВТ_Остатки.Склад
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Индекс";
	
	Запрос.УстановитьПараметр("ДатаОтбора", 	КонецДня(ДатаПроверки));
	Запрос.УстановитьПараметр("Назначение", 	Назначение);
	Запрос.УстановитьПараметр("Номенклатура", 	Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Серия", 			Серия);
	Запрос.УстановитьПараметр("Склад", 			ПараметрыОтбора.Склад);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Рез = 0;
	Выборка = Результат.Выбрать();
	Пока ( Выборка.Следующий() ) Цикл
		Если ( Выборка.ВНаличииОстаток <> 0 ) Тогда
			Рез = Выборка.ВНаличииОстаток;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	
	Возврат Рез;
	
КонецФункции // ПоступилоПоЗаказу()

&НаСервере
Функция ОстатокПоОтгузке(ПараметрыОтбора)
	
	ВыбранныйЗаказ	= ПараметрыОтбора.Заказ;
	Назначение		= ПараметрыОтбора.Назначение;
	Номенклатура	= ПараметрыОтбора.Номенклатура;
	Характеристика	= ПараметрыОтбора.Характеристика;
	Серия			= ПараметрыОтбора.Серия;
	//Склад			= ПараметрыОтбора.Склад;
	ДатаПроверки	= ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыКОтгрузкеОстатки.ДокументОтгрузки,
	               |	ТоварыКОтгрузкеОстатки.Назначение,
	               |	ТоварыКОтгрузкеОстатки.Номенклатура,
	               |	ТоварыКОтгрузкеОстатки.Характеристика,
	               |	ТоварыКОтгрузкеОстатки.Серия,
	               |	ТоварыКОтгрузкеОстатки.Склад,
	               |	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток
	               |ИЗ
	               |	РегистрНакопления.ТоварыКОтгрузке.Остатки(
	               |			,
	               |			ДокументОтгрузки = &ДокументОтгрузки
//	               |				И Назначение = &Назначение
	               |				И Номенклатура = &Номенклатура
	               |				И Характеристика = &Характеристика
	               |				И Серия = &Серия
	               |				И Склад = &Склад) КАК ТоварыКОтгрузкеОстатки";
					
//	Запрос.УстановитьПараметр("ДатаОтбора", 		КонецДня(ДатаПроверки));
	Запрос.УстановитьПараметр("ДокументОтгрузки", 	ВыбранныйЗаказ);
//	Запрос.УстановитьПараметр("Назначение", 		Назначение);
	Запрос.УстановитьПараметр("Номенклатура", 		Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", 	Характеристика);
	Запрос.УстановитьПараметр("Серия", 				Серия);
	Запрос.УстановитьПараметр("Склад", 				ПараметрыОтбора.Склад);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Остатки = Результат.Выгрузить();
	Остатки.Свернуть("Назначение, Номенклатура, Характеристика, Серия, Склад, ДокументОтгрузки","КОтгрузкеОстаток");
	
	Возврат Остатки[0].КОтгрузкеОстаток;
	
КонецФункции // ПоступилоПоЗаказу()

&НаСервере
Функция ТекстЗапросаВыбораЗаказаИзРегистра()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РаспоряженияНаОтгрузку.Распоряжение КАК ЗаказКлиента,
	|	РаспоряженияНаОтгрузку.КодСтроки КАК КодСтроки,
	|	РаспоряженияНаОтгрузку.Склад КАК Склад,
	|	РаспоряженияНаОтгрузку.Номенклатура КАК Номенклатура,
	|	РаспоряженияНаОтгрузку.Характеристика КАК Характеристика,
	|	РаспоряженияНаОтгрузку.Серия КАК Серия,
	|	СУММА(РаспоряженияНаОтгрузку.ЗаказаноОборот) КАК ЗаказаноОстаток,
	|	СУММА(РаспоряженияНаОтгрузку.КОформлениюОборот) КАК КОформлениюОстаток,
	|	СУММА(РаспоряженияНаОтгрузку.ЗаказаноОборот - РаспоряженияНаОтгрузку.КОформлениюОборот) КАК ОстатокПоЗаказу
	|ИЗ
	|	РегистрНакопления.РаспоряженияНаОтгрузку.Обороты(
	|			,
	|			&ДатаКон,
	|			,
	|			Распоряжение = &ЗаказКлиента
	|				И Склад = &Склад) КАК РаспоряженияНаОтгрузку
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспоряженияНаОтгрузку.Характеристика,
	|	РаспоряженияНаОтгрузку.Распоряжение,
	|	РаспоряженияНаОтгрузку.Серия,
	|	РаспоряженияНаОтгрузку.Склад,
	|	РаспоряженияНаОтгрузку.Номенклатура,
	|	РаспоряженияНаОтгрузку.КодСтроки
	|
	|ИМЕЮЩИЕ
	|	СУММА(РаспоряженияНаОтгрузку.ЗаказаноОборот - РаспоряженияНаОтгрузку.КОформлениюОборот) > 0";
	//ТекстЗапроса = 
	//"ВЫБРАТЬ
	//|	ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
	//|	ЗапасыИПотребностиОстатки.Характеристика КАК Характеристика,
	//|	ЗапасыИПотребностиОстатки.Склад КАК Склад,
	//|	ЗапасыИПотребностиОстатки.Назначение КАК Назначение,
	//|	ЗапасыИПотребностиОстатки.Заказ КАК ЗаказКлиента,
	//|	ЗапасыИПотребностиОстатки.КОбеспечениюОстаток КАК ОстатокПоЗаказу
	//|ИЗ
	//|	РегистрНакопления.ЗапасыИПотребности.Остатки(
	//|			&ДатаКон,
	//|			Назначение.Заказ = &ЗаказКлиента
	//|				И Склад = &Склад) КАК ЗапасыИПотребностиОстатки";
	Возврат ТекстЗапроса;
КонецФункции // ТекстЗапросаВыбораЗаказаИзРегистра()

&НаСервере
Функция ЗаказаноПоЗаказу(ВыбранныйЗаказ, Номенклатура, Характеристика, Серия )
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	_ЗаявкаНаДоставкуЗаказы.Ссылка,
	               |	_ЗаявкаНаДоставкуТовары.Номенклатура,
	               |	_ЗаявкаНаДоставкуТовары.Характеристика,
	               |	_ЗаявкаНаДоставкуТовары.Серия,
	               |	_ЗаявкаНаДоставкуТовары.КоличествоУпаковок
	               |ИЗ
	               |	Документ._ЗаявкаНаДоставку.Заказы КАК _ЗаявкаНаДоставкуЗаказы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ._ЗаявкаНаДоставку.Товары КАК _ЗаявкаНаДоставкуТовары
	               |		ПО _ЗаявкаНаДоставкуЗаказы.Ссылка = _ЗаявкаНаДоставкуТовары.Ссылка
	               |ГДЕ
	               |	_ЗаявкаНаДоставкуЗаказы.ЗаказКлиента = &ЗаказКлиента
	               |	И _ЗаявкаНаДоставкуТовары.Номенклатура = &Номенклатура
	               |	И _ЗаявкаНаДоставкуТовары.Характеристика = &Характеристика
	               |	И _ЗаявкаНаДоставкуТовары.Серия = &Серия
	               |	И _ЗаявкаНаДоставкуЗаказы.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И _ЗаявкаНаДоставкуЗаказы.Ссылка.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("ЗаказКлиента",   ВыбранныйЗаказ);
	Запрос.УстановитьПараметр("Номенклатура",   Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Серия",			Серия);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Количество = Результат.Итог("КоличествоУпаковок");
	
	Возврат Количество;
	
КонецФункции // ЗаказаноПоЗаказу()

&НаСервере
Функция ПолучитьЗаказ(ЗаказКлиента, ДатаПроверки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаВыбораЗаказаИзРегистра();
	
	Запрос.УстановитьПараметр("ДатаКон",		КонецДня(ДатаПроверки));
	Запрос.УстановитьПараметр("ЗаказКлиента",	ЗаказКлиента);
	Запрос.УстановитьПараметр("Склад",			ЗаказКлиента.Склад);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции // ПолучитьЗаказ()

#КонецОбласти

#Область ЗаполнениеНаОснованииЗаказаПоставщику

&НаСервере
Процедура ЗаполнитьДокументНаОснованииЗаказаПоставщику(Знач ЗаказПоставщику)
	//Заполнение шапки
	ЗаполнитьШапкуЗаказаПоставщика(ЗаказПоставщику);
	
	//Заполнение табличных частей
	ЗаполнитьТЧПоЗаказуПоставщика(ЗаказПоставщику);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШапкуЗаказаПоставщика(ТекЗаказ, ЗаполнитьОснование = Истина)
	Статус					= Перечисления._СтатусыЗаявокНаДоставку.КВыполнению;
	Организация     		= ТекЗаказ.Организация;
	Склад					= ТекЗаказ.Склад;
	Партнер					= ТекЗаказ.Ссылка.Партнер;
	НаправлениеДеятельности	= ТекЗаказ.НаправлениеДеятельности;
	
	Если ЗаполнитьОснование Тогда
		ДокументОснование		= ТекЗаказ.Ссылка;
	КонецЕсли;
	
	//	ЖелаемаяДатаОтгрузки	= ?(ЗначениеЗаполнено(ТекЗаказ.ЖелаемаяДатаОтгрузки), ТекЗаказ.ЖелаемаяДатаОтгрузки, ?(ЗначениеЗаполнено(ТекЗаказ.ДатаОтгрузки),  ТекЗаказ.ДатаОтгрузки, Дата(1,1,1)));
	//ЖелаемаяДатаОтгрузки	= _ДоработкиСлужебный.ПолучитьСледующийДень(ДокументОснование.Дата); 
	ЖелаемаяДатаОтгрузки	= _ДоработкиСлужебный.ПолучитьСледующийДень(Дата); 
	
	ЗаполнитьПартнера();
КонецПроцедуры	// ЗаполнитьШапкуЗаказа()

&НаСервере
Процедура ЗаполнитьТЧПоЗаказуПоставщика(ТекЗаказ) Экспорт 
	ПроверкаЗаполненостиТЧТовары = Ложь;
	
	//Выборка = ПолучитьЗаказ(ВыбранныйЗаказ,ТекущаяДата());
	
	Для Каждого ТекСтрока Из ТекЗаказ.Товары Цикл
		НоваяСтрока	= Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
	КонецЦикла;
	
	Если (НЕ Товары.Количество() = 0) ИЛИ
		 (НЕ Товары.Итог("Количество") = 0) Тогда
		ПроверкаЗаполненостиТЧТовары = Истина;
	КонецЕсли;		// 		
	
	Если ПроверкаЗаполненостиТЧТовары Тогда  

		НужныДокументы	= Истина;

		НоваяСтрока					= Заказы.Добавить();
		НоваяСтрока.НомерЗаказа		= ТекЗаказ.Номер;
		НоваяСтрока.ДатаЗаказа		= ТекЗаказ.Дата;
		НоваяСтрока.ЗаказКлиента	= ТекЗаказ.Ссылка;
		НоваяСтрока.НужныДокументы	= Истина;
	КонецЕсли;		//ПроаеркаЗаполненостиТЧТовары 		
КонецПроцедуры	// ЗаполнитьТЧ()



///////////////////////////////////////////////////////////////

&НаСервере
Функция Удалить_ТекстЗапросаВыбораЗаказаПоставщику(ПоискПоССылке = Истина)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПоставщику.Ссылка КАК Ссылка,
	|	ЗаказПоставщику.ВерсияДанных КАК ВерсияДанных,
	|	ЗаказПоставщику.ПометкаУдаления КАК ПометкаУдаления,
	|	ЗаказПоставщику.Номер КАК Номер,
	|	ЗаказПоставщику.Дата КАК Дата,
	|	ЗаказПоставщику.Проведен КАК Проведен,
	|	ЗаказПоставщику.Партнер КАК Партнер,
	|	ЗаказПоставщику.Контрагент КАК Контрагент,
	|	ЗаказПоставщику.Организация КАК Организация,
	|	ЗаказПоставщику.Соглашение КАК Соглашение,
	|	ЗаказПоставщику.Склад КАК Склад,
	|	ЗаказПоставщику.Валюта КАК Валюта,
	|	ЗаказПоставщику.Менеджер КАК Менеджер,
	|	ЗаказПоставщику.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ЗаказПоставщику.Статус КАК Статус,
	|	ЗаказПоставщику.СуммаДокумента КАК СуммаДокумента,
	|	ЗаказПоставщику.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	ЗаказПоставщику.ЖелаемаяДатаПоступления КАК ЖелаемаяДатаПоступления,
	|	ЗаказПоставщику.МаксимальныйКодСтроки КАК МаксимальныйКодСтроки,
	|	ЗаказПоставщику.Согласован КАК Согласован,
	|	ЗаказПоставщику.ФормаОплаты КАК ФормаОплаты,
	|	ЗаказПоставщику.Касса КАК Касса,
	|	ЗаказПоставщику.БанковскийСчет КАК БанковскийСчет,
	|	ЗаказПоставщику.СуммаАвансаДоПодтверждения КАК СуммаАвансаДоПодтверждения,
	|	ЗаказПоставщику.СуммаПредоплатыДоПоступления КАК СуммаПредоплатыДоПоступления,
	|	ЗаказПоставщику.ДатаПервогоПоступления КАК ДатаПервогоПоступления,
	|	ЗаказПоставщику.ДатаСогласования КАК ДатаСогласования,
	|	ЗаказПоставщику.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ЗаказПоставщику.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ЗаказПоставщику.Комментарий КАК Комментарий,
	|	ЗаказПоставщику.НомерПоДаннымПоставщика КАК НомерПоДаннымПоставщика,
	|	ЗаказПоставщику.ДатаПоДаннымПоставщика КАК ДатаПоДаннымПоставщика,
	|	ЗаказПоставщику.Сделка КАК Сделка,
	|	ЗаказПоставщику.Подразделение КАК Подразделение,
	|	ЗаказПоставщику.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ЗаказПоставщику.РегистрироватьЦеныПоставщика КАК РегистрироватьЦеныПоставщика,
	|	ЗаказПоставщику.Договор КАК Договор,
	|	ЗаказПоставщику.Автор КАК Автор,
	|	ЗаказПоставщику.ДокументОснование КАК ДокументОснование,
	|	ЗаказПоставщику.ПоступлениеОднойДатой КАК ПоступлениеОднойДатой,
	|	ЗаказПоставщику.ДатаПоступления КАК ДатаПоступления,
	|	ЗаказПоставщику.ПорядокРасчетов КАК ПорядокРасчетов,
	|	ЗаказПоставщику.АдресДоставкиДляПоставщика КАК АдресДоставкиДляПоставщика,
	|	ЗаказПоставщику.КонтактноеЛицо КАК КонтактноеЛицо,
	|	ЗаказПоставщику.ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
	|	ЗаказПоставщику.СрокВозвратаМногооборотнойТары КАК СрокВозвратаМногооборотнойТары,
	|	ЗаказПоставщику.СостояниеЗаполненияМногооборотнойТары КАК СостояниеЗаполненияМногооборотнойТары,
	|	ЗаказПоставщику.ЗакупкаПодДеятельность КАК ЗакупкаПодДеятельность,
	|	ЗаказПоставщику.ТребуетсяЗалогЗаТару КАК ТребуетсяЗалогЗаТару,
	|	ЗаказПоставщику.СуммаВозвратнойТары КАК СуммаВозвратнойТары,
	|	ЗаказПоставщику.Приоритет КАК Приоритет,
	|	ЗаказПоставщику.СпособДоставки КАК СпособДоставки,
	|	ЗаказПоставщику.ПеревозчикПартнер КАК ПеревозчикПартнер,
	|	ЗаказПоставщику.ЗонаДоставки КАК ЗонаДоставки,
	|	ЗаказПоставщику.ВремяДоставкиС КАК ВремяДоставкиС,
	|	ЗаказПоставщику.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	ЗаказПоставщику.АдресДоставки КАК АдресДоставки,
	|	ЗаказПоставщику.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	ЗаказПоставщику.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
	|	ЗаказПоставщику.АдресДоставкиПеревозчика КАК АдресДоставкиПеревозчика,
	|	ЗаказПоставщику.АдресДоставкиПеревозчикаЗначенияПолей КАК АдресДоставкиПеревозчикаЗначенияПолей,
	|	ЗаказПоставщику.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ЗаказПоставщику.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	ЗаказПоставщику.НаправлениеДеятельности КАК НаправлениеДеятельности,
	//++ обновление, порядокоплаты удален
	//|	ЗаказПоставщику.ПорядокОплаты КАК ПорядокОплаты,
	//--
	|	ЗаказПоставщику.ЕстьКиЗГИСМ КАК ЕстьКиЗГИСМ,
	|	ЗаказПоставщику.ВариантПриемкиТоваров КАК ВариантПриемкиТоваров,
	|	ЗаказПоставщику._ЗаявкаНаЗакупку КАК _ЗаявкаНаЗакупку,
	|	ЗаказПоставщику._ДокЗаявкаНаЗакупку КАК _ДокЗаявкаНаЗакупку
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику";
	
	Если ПоискПоССылке Тогда
		ТекстЗапроса = ТекстЗапроса + "
				|ГДЕ
				|	ЗаказПоставщику.Ссылка = &ЗаказПоставщику
				|	И ЗаказПоставщику.Проведен = ИСТИНА
				|	И ЗаказПоставщику.ПометкаУдаления = ЛОЖЬ				
				|";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
				|ГДЕ
				|	ЗаказПоставщику.Номер = &Номер
				|	И ЗаказПоставщику.Дата = &Дата
				|	И ЗаказПоставщику.Организация = &Организация
				|	И ЗаказПоставщику.Партнер = &Партнер
				|	И ЗаказПоставщику.Проведен = ИСТИНА
				|	И ЗаказПоставщику.ПометкаУдаления = ЛОЖЬ				
				|";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
				|";
	
	Возврат ТекстЗапроса;
	
КонецФункции	

&НаСервере
Функция Удалить_ОстатокНаСкладеПоЗаказуПоставщика(ПараметрыОтбора)
	
	ВыбранныйЗаказ	= ПараметрыОтбора.Заказ;
	Назначение		= ПараметрыОтбора.Назначение;
	Номенклатура	= ПараметрыОтбора.Номенклатура;
	Характеристика	= ПараметрыОтбора.Характеристика;
	Склад			= ПараметрыОтбора.Склад;
	ДатаПроверки	= ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	ТоварыНаСкладахОстатки.Назначение,
					|	ТоварыНаСкладахОстатки.Номенклатура,
					|	ТоварыНаСкладахОстатки.Характеристика,
					|	ТоварыНаСкладахОстатки.Серия,
					|	ТоварыНаСкладахОстатки.Склад,
					|	ТоварыНаСкладахОстатки.ВНаличииОстаток
					|ИЗ
					|	РегистрНакопления.ТоварыНаСкладах.Остатки(
					|			&ДатаОтбора,
					|			Назначение = &Назначение
					|				И Номенклатура = &Номенклатура
					|				И Характеристика = &Характеристика
					//|				И Серия = &Серия
					|				И Склад = &Склад) КАК ТоварыНаСкладахОстатки";
	
	Запрос.УстановитьПараметр("ДатаОтбора", 	КонецДня(ДатаПроверки));
	Запрос.УстановитьПараметр("Назначение", 	Назначение);
	Запрос.УстановитьПараметр("Номенклатура", 	Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Склад", 			Склад);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Остатки = Результат.Выгрузить();
	Остатки.Свернуть("Назначение, Номенклатура, Характеристика, Серия, Склад","ВНаличииОстаток");
	
	Возврат Остатки[0].ВНаличииОстаток;
	
КонецФункции // ПоступилоПоЗаказу()

&НаСервере
Функция Удалить_ОстатокПоОтгузкеПоЗаказуПоставщика(ПараметрыОтбора)
	
	ВыбранныйЗаказ	= ПараметрыОтбора.Заказ;
	Назначение		= ПараметрыОтбора.Назначение;
	Номенклатура	= ПараметрыОтбора.Номенклатура;
	Характеристика	= ПараметрыОтбора.Характеристика;
	Серия			= ПараметрыОтбора.Серия;
	Склад			= ПараметрыОтбора.Склад;
	ДатаПроверки	= ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыКОтгрузкеОстатки.ДокументОтгрузки,
	               |	ТоварыКОтгрузкеОстатки.Назначение,
	               |	ТоварыКОтгрузкеОстатки.Номенклатура,
	               |	ТоварыКОтгрузкеОстатки.Характеристика,
	               |	ТоварыКОтгрузкеОстатки.Серия,
	               |	ТоварыКОтгрузкеОстатки.Склад,
	               |	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток
	               |ИЗ
	               |	РегистрНакопления.ТоварыКОтгрузке.Остатки(
	               |			,
	               |			ДокументОтгрузки = &ДокументОтгрузки
//	               |				И Назначение = &Назначение
	               |				И Номенклатура = &Номенклатура
	               |				И Характеристика = &Характеристика
	               |				И Серия = &Серия
	               |				И Склад = &Склад) КАК ТоварыКОтгрузкеОстатки";
					
//	Запрос.УстановитьПараметр("ДатаОтбора", 		КонецДня(ДатаПроверки));
	Запрос.УстановитьПараметр("ДокументОтгрузки", 	ВыбранныйЗаказ);
//	Запрос.УстановитьПараметр("Назначение", 		Назначение);
	Запрос.УстановитьПараметр("Номенклатура", 		Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", 	Характеристика);
	Запрос.УстановитьПараметр("Серия", 				Серия);
	Запрос.УстановитьПараметр("Склад", 				Склад);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Остатки = Результат.Выгрузить();
	Остатки.Свернуть("Назначение, Номенклатура, Характеристика, Серия, Склад, ДокументОтгрузки","КОтгрузкеОстаток");
	
	Возврат Остатки[0].КОтгрузкеОстаток;
	
КонецФункции // ПоступилоПоЗаказу()

&НаСервере
Функция ______ОстатокПоОтгрузкеПоЗаказуПоставщика(ПараметрыОтбора)
	
	ВыбранныйЗаказ	= ПараметрыОтбора.Заказ;
	Назначение		= ПараметрыОтбора.Назначение;
	Номенклатура	= ПараметрыОтбора.Номенклатура;
	Характеристика	= ПараметрыОтбора.Характеристика;
	//Серия			= ПараметрыОтбора.Серия;
	Склад			= ПараметрыОтбора.Склад;
	ДатаПроверки	= ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыКОтгрузкеОстатки.ДокументОтгрузки,
	               |	ТоварыКОтгрузкеОстатки.Назначение,
	               |	ТоварыКОтгрузкеОстатки.Номенклатура,
	               |	ТоварыКОтгрузкеОстатки.Характеристика,
	               |	ТоварыКОтгрузкеОстатки.Серия,
	               |	ТоварыКОтгрузкеОстатки.Склад,
	               |	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток
	               |ИЗ
	               |	РегистрНакопления.ТоварыКОтгрузке.Остатки(
	               |			,
	               |			ДокументОтгрузки = &ДокументОтгрузки
//	               |				И Назначение = &Назначение
	               |				И Номенклатура = &Номенклатура
	               |				И Характеристика = &Характеристика
				   //|				И Серия = &Серия
	               |				И Склад = &Склад) КАК ТоварыКОтгрузкеОстатки";
					
//	Запрос.УстановитьПараметр("ДатаОтбора", 		КонецДня(ДатаПроверки));
	Запрос.УстановитьПараметр("ДокументОтгрузки", 	ВыбранныйЗаказ);
//	Запрос.УстановитьПараметр("Назначение", 		Назначение);
	Запрос.УстановитьПараметр("Номенклатура", 		Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", 	Характеристика);
	//Запрос.УстановитьПараметр("Серия", 				Серия);
	Запрос.УстановитьПараметр("Склад", 				Склад);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Остатки = Результат.Выгрузить();
	Остатки.Свернуть("Назначение, Номенклатура, Характеристика, Серия, Склад, ДокументОтгрузки","КОтгрузкеОстаток");
	
	Возврат Остатки[0].КОтгрузкеОстаток;
	
КонецФункции // ПоступилоПоЗаказу()

#КонецОбласти

#Область ЗаполнениеНаОснованииМассива

&НаСервере
Процедура ЗаполнитьДокументНаОснованииЗаказов(ДанныеЗаполнения)
	ТЗаказов = _ДоработкиСлужебный.ПреобразоватьМассивВТаблицуЗначений(ДанныеЗаполнения);
	
	ПервыйЗаказ = Истина;
	Для Каждого ТекСтрока Из ТЗаказов Цикл
		ТекЗаказ = ТекСтрока.Ссылка; // ВыборЗаказа(ТекСтрока);
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаВыбораЗаказа(Ложь);
		Запрос.УстановитьПараметр("Номер",		 ТекСтрока.Номер);
		Запрос.УстановитьПараметр("Дата", 		 ТекСтрока.Дата);
		Запрос.УстановитьПараметр("Организация", ТекСтрока.Организация);
		Запрос.УстановитьПараметр("Партнер",	 ТекСтрока.Партнер);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;
		КонецЕсли;
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Если Выборка.ЕстьОшибкиСтатус ИЛИ Выборка.ЕстьОшибкиУдален Тогда
			Продолжить;
		КонецЕсли;		// Выборка.ЕстьОшибкиСтатус ИЛИ Выборка.ЕстьОшибкиУдален 		
		
		//Заполнение шапки
		Если ПервыйЗаказ Тогда
			ЗаполнитьШапкуЗаказа(Выборка,  Ложь);
			ДокументОснование = Выборка.Ссылка;
			ПервыйЗаказ = Ложь;
		КонецЕсли;		// ПервыйЗаказ 		 
		
		//Заполнение табличных частей
		//ЗаполнитьТЧПоЗаказу_Клиента_Поставщика(Выборка);
		
	КонецЦикла;		// ТекСтрока
	
	
КонецПроцедуры	// ЗаполнитьДокументНаОснованииЗаказов()

#КонецОбласти





#Область РасходныеОрдераНаТовары

&НаСервере
Процедура СоздатьОрдераСервер(Отказ)
	
	МассивЗаказов = Заказы.ВыгрузитьКолонку("ЗаказКлиента");
	
	МассивСсылок = Новый Массив;
	
	Для Каждого Элемент Из МассивЗаказов Цикл
		//**Добавлено Максимов В.А.
		Если ТипЗнч(Элемент) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Если НЕ Элемент.Статус = Перечисления.СтатусыЗаказовПоставщикам.Закрыт Тогда
				МассивСсылок.Добавить(Элемент); 
			КонецЕсли;	
		Иначе
			Если НЕ Элемент.Закрыт Тогда
				МассивСсылок.Добавить(Элемент); 
			КонецЕсли;
		КонецЕсли;
		//*************************
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасходныйОрдерНаТовары.Ссылка КАК РасходныйОрдерНаТовары,
	               |	РасходныйОрдерНаТовары._ЗаявкаНаДоставку КАК ЗаявкаНаДоставку,
	               |	РасходныйОрдерНаТовары.ПометкаУдаления КАК ПометкаУдаления,
	               |	РасходныйОрдерНаТовары.Проведен КАК Проведен
	               |ИЗ
	               |	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	               |ГДЕ
	               |	РасходныйОрдерНаТовары._ЗаявкаНаДоставку = &_ЗаявкаНаДоставку
	               |	И РасходныйОрдерНаТовары.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("_ЗаявкаНаДоставку", Ссылка);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка  = Результат.Выгрузить()[0];
		ТекОрдер = Выборка.РасходныйОрдерНаТовары;
		Если ТекОрдер.Проведен Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru='По данной заявке уже создан расходный ордер №'") + ТекОрдер.Номер +  НСтр("ru=' от '") + ТекОрдер.Дата;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		ТекОрдерОбьект = ТекОрдер.ПолучитьОбъект();
		Если ТекОрдер.ПометкаУдаления Тогда
			ТекОрдерОбьект.ПометкаУдаления = Ложь;
		КонецЕсли;
		ТекОрдерОбьект.ТоварыПоРаспоряжениям.Очистить();
		ТекОрдерОбьект.ОтгружаемыеТовары.Очистить();
		ТекОрдерОбьект.ДополнительныеРеквизиты.Очистить();
		ТекОрдерОбьект.Записать(РежимЗаписиДокумента.Запись);
		
		_ОбработкаДоставкиТоваровСервер.ОформитьРасходныеОрдераПоДоставкеНаСервере(МассивСсылок, Ссылка);	//, Ложь
	Иначе 
		_ОбработкаДоставкиТоваровСервер.ОформитьРасходныеОрдераПоДоставкеНаСервере(МассивСсылок, Ссылка);
	КонецЕсли;

КонецПроцедуры	// СоздатьОрдераСервер()

&НаСервере
Функция НовыйОрдер()
	
	НовыйРасходныйОрдерНаТовары						= Документы.РасходныйОрдерНаТовары.СоздатьДокумент(); 
	НовыйРасходныйОрдерНаТовары.Дата				= ТекущаяДата();
	НовыйРасходныйОрдерНаТовары.ДатаОтгрузки		= ДатаОтгрузки;
	НовыйРасходныйОрдерНаТовары.Склад				= Склад;
	НовыйРасходныйОрдерНаТовары._СпособДоставки		= СпособДоставки;
	НовыйРасходныйОрдерНаТовары._ЗаявкаНаДоставку	= Ссылка;
	
	Возврат НовыйРасходныйОрдерНаТовары;
	
КонецФункции // НовыйОрдер()

&НаСервере
Процедура УдалитьОрдераСервер()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РасходныйОрдерНаТовары.Ссылка КАК РасходныйОрдерНаТоварыСсылка,
	|	РасходныйОрдерНаТовары._ЗаявкаНаДоставку КАК _ЗаявкаНаДоставку
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|ГДЕ
	|	НЕ РасходныйОрдерНаТовары.ПометкаУдаления
	|	И РасходныйОрдерНаТовары.Проведен
	|	И РасходныйОрдерНаТовары._ЗаявкаНаДоставку = &_ЗаявкаНаДоставку";
	
	Запрос.УстановитьПараметр("_ЗаявкаНаДоставку", Ссылка);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			РасходныйОрдерНаТоварыДокумент = Выборка.РасходныйОрдерНаТоварыСсылка.ПолучитьОбъект();
			Если НЕ РасходныйОрдерНаТоварыДокумент = Неопределено Тогда
				РасходныйОрдерНаТоварыДокумент.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				РасходныйОрдерНаТоварыДокумент.Удалить();
			КонецЕсли; 
		КонецЦикла;		// Результат.Следующий() 
	КонецЕсли;
КонецПроцедуры	// УдалитьОрдераСервер()

#КонецОбласти

#Область ПоручениеЭкспедитору

&НаСервере
Процедура СоздатьПоручениеЭкспедитору(Отказ)
	
	ЕстьПоручение = Ложь;
	Если ЗначениеЗаполнено(ЭтотОбъект.ПоручениеЭкспидитору) Тогда
		Если  ЭтотОбъект.ПоручениеЭкспидитору.Проведен  Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru='По данной заявке уже создано распоряжение экспедитору №'") + ЭтотОбъект.ПоручениеЭкспидитору.Номер +  НСтр("ru=' от '") + 
							 ЭтотОбъект.ПоручениеЭкспидитору.Дата + Символы.ПС + НСтр("ru='Если хотите внести изменения отмените проведение распоряжения экспедитора'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		Иначе
			Если ЭтотОбъект.ПоручениеЭкспидитору.ПометкаУдаления Тогда
				Отказ = Истина;
				ТекстСообщения = НСтр("ru='По данной заявке уже было создано распоряжение экспедитору №'") + ЭтотОбъект.ПоручениеЭкспидитору.Номер +  НСтр("ru=' от '") + 
								 ЭтотОбъект.ПоручениеЭкспидитору.Дата + Символы.ПС + НСтр("ru='Если хотите внести изменения отмените удаление распоряжения экспедитора'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Возврат;
			Иначе
				ЕстьПоручение = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	////говнокод
	//НовыйПоручениеЭкспедитору = НовоеПоручение(ЕстьПоручение);
	//НовыйПоручениеЭкспедитору._ЗаявкаНаДоставку = ЭтотОбъект.Ссылка;
	//НовыйПоручениеЭкспедитору.Записать(РежимЗаписиДокумента.Проведение);
	//ЭтотОбъект.ПоручениеЭкспидитору = НовыйПоручениеЭкспедитору.Ссылка;	
	//ЭтотОбъект.Записать();
	
КонецПроцедуры	// СоздатьПоручениеЭкспедитору()

&НаСервере
Процедура ОбработкаВеземДокументыМодуль() Экспорт
	
	Если ЭтотОбъект.ВеземДокументы Тогда
		ЭтотОбъект.Товары.Очистить();
	Иначе
		ЭтотОбъект.Товары.Очистить();
		ЭтотОбъект.Заказы.Очистить();
		ТекЗаказ  = ЭтотОбъект.ДокументОснование;	
		ЗаполнитьТЧПоЗаказуПоставщика(ТекЗаказ);
	КонецЕсли;
	
КонецПроцедуры	// ОбработкаВеземдокументыСервер()


#КонецОбласти
