#Область ПеременныеОбработки

&НаКлиенте
Перем МассивВыбранныхСсылок;

#КонецОбласти

#Область ОбработчикиОсновныхСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//**ДОБАВЛЕНО Максимов В.А.
	НомерЗаказа = "";                     
	ДатаЗаказа  = '00010101';
		
	ОбработкаЗадачПользователя();		
	УстановитьУсловноеОформление();
	
	//Новое Максимов
	Если Параметры.Свойство("НомерЗаказа", НомерЗаказа) И Параметры.Свойство("ДатаЗаказа", ДатаЗаказа) Тогда
		ПараметрыЗаказа		  = Новый Структура("НомерЗаказа, ДатаЗаказа", НомерЗаказа, ДатаЗаказа);
		Объект.ПараметрыЗаказа = ПараметрыЗаказа;
	КонецЕсли;	
	
	ТекущаяДатаМинусСемьДней = ТекущаяДата() - (86400 * 7);
	ТекДата = ТекущаяДата(); 
	ТекДатаПлюсОДинДень = ТекДата + 86400;
	ТекДатаПлюсШесть = ТекДата + (86400*7);
	//*************************
	
	НачалоПериода = НачалоГода(ТекущаяДата());
	КонецПериода = КонецДня(ТекущаяДата());	
	
	УстановитьОтборДинамическихСписков();
		
	//**************
	
	Элементы.ЗаказыПоставщикам.УправлениеПоиском.Видимость = Истина;
	Элементы.ЗаказыПоставщикам.УправлениеПоиском.Доступность = Истина;
	Элементы.ЗаказыПоставщикам.ОтображениеСтрокиПоиска.Видимость = Истина;
	Элементы.ЗаказыПоставщикам.ОтображениеСтрокиПоиска.Доступность = Истина;
	Элементы.ЗаказыПоставщикам.КоманднаяПанель.Видимость = Истина;
	Элементы.ЗаказыПоставщикам.КоманднаяПанель.Доступность = Истина;
	
	ИнициализироватьСписокОперацийОплаты();
	//***************************
	
	_РаботаСИнтерфейсомСервер.СистемаНапоминанийПриСозданииНаСервере( "ГруппаРазделыРабочегоСтола" , ЭтаФорма );
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники = Новый Массив;
	ПараметрыРазмещения.Источники.Добавить( Метаданные.Документы.ЗаказПоставщику );
	
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ЗаказыПоставщикам.КоманднаяПанель; 
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	//Хз по какой причине но не добавляется команда в подменю кнопок... сделал программно
	ДобавитьКомандуСозданияЗаявкиНаДоставку();
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МассивВыбранныхСсылок = Новый Массив;
	ркКоличествоВыбранных = 0;
	ПотребностьПоЗаказам.Параметры.УстановитьЗначениеПараметра("МассивВыбранныхСсылок",МассивВыбранныхСсылок);
	
	ВосстановитьНастройкиСервер();
	УстановкаОтбораПоМенеджеруКлиент();
	УстановкаОтбораПоДатеКлиент();
	ТекущаяСтрокаСписка = ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущаяСтрока;
	//**Изменено Максимов
	ЭтаФорма.Элементы.СоздатьПоручениеЭкспедитору.Видимость = Ложь;
	
	Если ТипЗнч(Объект.ПараметрыЗаказа) = Тип("Структура") Тогда
		ЭтаФорма.Элементы.ГруппаРазделыРабочегоСтола.ТекущаяСтраница = ЭтаФорма.Элементы.ГруппаРазделыРабочегоСтола.ПодчиненныеЭлементы.ГруппаЗаказыПоставщикам;	
		ОбработкаНомераЗаказаКлиент();
	КонецЕсли;	
	//*******************	
	
	//
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("ЗаписатьИЗакрытьОповещение", ЭтотОбъект);
	Если ЗавершениеРаботы Тогда
		//Возврат;
		ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, Ложь); 
	Иначе
		ЗаписатьИЗакрытьОповещение(); 
	КонецЕсли;    
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
КонецПроцедуры

#КонецОбласти


#Область ПроцедурыФункцииОбщегоНазначения

&НаСервере		//БезКонтекста
Процедура ЗаполнитьДокументНаСервере(ПараметрыЗаполнения, ТипДокумента)

	Если ТипДокумента = "ЗаявкаНаЗакупку" Тогда
		
		НовыйДокумент = Документы.ЗаявкаНаЗакупку.СоздатьДокумент();
		
	ИначеЕсли ТипДокумента = "ЗаказПоставщику" Тогда
		
		НовыйДокумент = Документы.ЗаказПоставщику.СоздатьДокумент();
		
	КонецЕсли;
	
	Если ТипДокумента = "ПоручениеЭкспедитору" Тогда
		
		НовыйДокумент = Документы.ПоручениеЭкспедитору.СоздатьДокумент();
		
	КонецЕсли;	
	
	Если НЕ ТипЗнч(ПараметрыЗаполнения) = Тип("Структура")
		ИЛИ НЕ ПараметрыЗаполнения.Свойство("ДокументОснование") Тогда
		
		ЗначениеВДанныеФормы(НовыйДокумент, ПараметрыЗаполнения.ДанныеФормы);
		Возврат;
		
	КонецЕсли;
	
	Если ( ПараметрыЗаполнения.СписокНоменклатуры = Неопределено ) И ( НЕ ПараметрыЗаполнения.ДокументОснование = ПолучитьПустуюСсылкуНаДокумент("ЗаявкаНаЗакупку") ) Тогда
		НовыйДокумент.Заполнить(ПараметрыЗаполнения.ДокументОснование);
	Иначе			// ПараметрыЗаполнения.СписокЗаявок = Неопределено
		НовыйДокумент.Заполнить(ПараметрыЗаполнения);
	КонецЕсли;		// ПараметрыЗаполнения.СписокЗаявок = Неопределено 
	
	ЗначениеВДанныеФормы(НовыйДокумент, ПараметрыЗаполнения.ДанныеФормы);

КонецПроцедуры

// Проверить проведен или нет
&НаСервереБезКонтекста
Функция ПроверитьДокументПроведен(СсылкаНаДокумент)
	Возврат СсылкаНаДокумент.Проведен;
КонецФункции

// Пустая ссылка на документ заявка на закупку
&НаСервереБезКонтекста
Функция ПолучитьПустуюСсылкуНаДокумент(ТипДокумента)
	
	Если ТипДокумента = "ЗаявкаНаЗакупку" Тогда
		Возврат Документы.ЗаявкаНаЗакупку.ПустаяСсылка();
	ИначеЕсли ТипДокумента = "ЗаказПоставщику" Тогда
		Возврат Документы.ЗаказПоставщику.ПустаяСсылка();
	КонецЕсли;

КонецФункции

&НаСервере
Функция ПолучитьПустогоПользователя()
	Возврат Справочники.Пользователи.ПустаяСсылка();
КонецФункции // ПолучитьПустогоПользователя()

&НаСервере
Функция ПолучитьТекущегоПользователя()
	Возврат Пользователи.ТекущийПользователь();
КонецФункции // ПолучитьТекущегоПользователя()

&НаСервере
Функция ОтметитьВсеНаСервере(МассивВыбранныхСсылок)
	
	ТекстЗапроса = ПолучитьТекстЗапросаСписка();
	СхемаКомпоновки = Новый СхемаКомпоновкиДанных();
	
	Источник = СхемаКомпоновки.ИсточникиДанных.Добавить();
	Источник.Имя = "Исток";
	Источник.СтрокаСоединения="";
	Источник.ТипИсточникаДанных = "local";
	
	НаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));    
	НаборДанных.Запрос = ТекстЗапроса;        
	НаборДанных.Имя = "Запрос";
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	НаборДанных.ИсточникДанных = "Исток";
	
	НастройкиКомпоновки = МобильныеПриложения.СкомпоноватьНастройки(СхемаКомпоновки);
	
	КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(НастройкиКомпоновки.Отбор, ПотребностьПоЗаказам.Отбор);
	КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(НастройкиКомпоновки.Порядок, ПотребностьПоЗаказам.Порядок);
	КомпоновкаДанныхКлиентСервер.ЗаполнитьЭлементы(НастройкиКомпоновки.ПараметрыДанных, ПотребностьПоЗаказам.Параметры);
	
	
	МакетКомпоновки = КомпоновкаДанныхСервер.ПолучитьМакетКомпоновки(СхемаКомпоновки, НастройкиКомпоновки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ТЗПотребностей = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТЗПотребностей);
	ПроцессорВывода.НачатьВывод();
	
	Пока Истина Цикл        
	    ЭлементРезультатаКомпоновкиДанных = ПроцессорКомпоновкиДанных.Следующий();        
	    Если ЭлементРезультатаКомпоновкиДанных = Неопределено Тогда 
	        Прервать;
	    КонецЕсли;        
	    ПроцессорВывода.ВывестиЭлемент(ЭлементРезультатаКомпоновкиДанных);        
	КонецЦикла;
	
	ПроцессорВывода.ЗакончитьВывод();
	//теперь по полученной копии списка пометим все
	
	Для каждого ТекСтрока из ТЗПотребностей Цикл
	//    УИДЗакупка = ТекСтрока._УИДЗакупка;
	//    ИндексСтрокиМассива = МассивВыбранныхСсылок.Найти(УИДЗакупка);
	//    Если ИндексСтрокиМассива = Неопределено Тогда
	//        МассивВыбранныхСсылок.Добавить(УИДЗакупка);       
	//    КонецЕсли;        
	КонецЦикла;
	
	ВыделенныеСтроки = Элементы.ПотребностьПоЗаказам.ВыделенныеСтроки;
	
	Для каждого ТекСтрока из ВыделенныеСтроки Цикл
	//    УИДЗакупка = ТекСтрока._УИДЗакупка;
	//    ИндексСтрокиМассива = МассивВыбранныхСсылок.Найти(УИДЗакупка);
	//    Если ИндексСтрокиМассива = Неопределено Тогда
	//        МассивВыбранныхСсылок.Добавить(УИДЗакупка);       
	//    КонецЕсли;        
	КонецЦикла;


    Возврат МассивВыбранныхСсылок;
	
КонецФункции

&НаСервере
Функция ПолучитьТекстЗапросаСписка()
    Возврат ПотребностьПоЗаказам.ТекстЗапроса;
КонецФункции

&НаКлиенте
Функция ПолучитьКонтлоьнуюДату()
	Возврат НачалоДня(ТекущаяДата()) + 15*60*60;
КонецФункции // ПолучитьКонтлоьнуюДату()
 
#КонецОбласти

#Область СтраницаОплат

&НаКлиенте
Процедура Оплатить(Команда)
	
	ДенежныеСредстваКлиент.ОплатитьСтрокиГрафика(Элементы.ЗаказыКОплате, "СписаниеБезналичныхДенежныхСредств");
	
КонецПроцедуры

Процедура УстановитьОтборДинамическихСписков()
	
	БанковскийСчетОтбор = Неопределено;
	
	Если ЗначениеЗаполнено(БанковскийСчетОтбор) Тогда
		КлючиРеестраДокументов = Справочники.КлючиРеестраДокументов.КлючиПоЗначениям(БанковскийСчетОтбор);
		Если КлючиРеестраДокументов.Количество() Тогда
			БанковскийСчетКлюч = КлючиРеестраДокументов[0];
		Иначе
			БанковскийСчетКлюч = Неопределено;
		КонецЕсли;
	Иначе
		БанковскийСчетКлюч = Неопределено;
	КонецЕсли;
	
	Организация = Неопределено;
	ВалютаСчета = Неопределено;
	
	// Общие отборы
	СписокОрганизаций = Новый СписокЗначений;
	СписокОрганизаций.Добавить(Организация);
	
	Если ЗначениеЗаполнено(Организация)
		И ПолучитьФункциональнуюОпцию("ИспользоватьОбособленныеПодразделенияВыделенныеНаБаланс") Тогда
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ОбособленноеПодразделение
		|	И Организации.ГоловнаяОрганизация = &Организация
		|	И Организации.ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию
		|");
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокОрганизаций.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	СписокСчетов = Новый СписокЗначений;
	СписокСчетов.Добавить(БанковскийСчетОтбор);
	СписокСчетов.Добавить(Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка());
	СписокСчетов.Добавить(Неопределено);
	
	МассивСписков = Новый Массив;
	МассивСписков.Добавить(СписокКОплате);
			
	// Заказы к оплате
	Граница = ?(ЗначениеЗаполнено(ДатаКОплате), КонецДня(ДатаКОплате), Дата('39990101'));
	ЗаказыКОплате.Параметры.УстановитьЗначениеПараметра("ДатаПлатежа", Граница);

	ОбластиПланирования = Новый Массив;
	Для каждого ЭлементСписка Из СписокОперацийОплаты Цикл
		Если ЭлементСписка.Пометка Тогда
			ОбластиПланирования.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ЗаказыКОплате,
		"ОбластьПланирования",
		ОбластиПланирования,
		ВидСравненияКомпоновкиДанных.ВСписке,,
		ОбластиПланирования.Количество());
		
	ОбновитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ВспомогательныйСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Ссылка = Элемент.ТекущиеДанные.Ссылка;
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ПоказатьЗначение(, Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДатаПлатежаЗаказыПриИзменении(Элемент)
	
	ДатаПлатежаПриИзмененииНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура ДатаПлатежаПриИзмененииНаСервере()
	
	УстановитьОтборДинамическихСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОбработкаОповещенияФрагмент(ИмяСобытия);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещенияФрагмент(Знач ИмяСобытия)
	
	ИменаСобытийОбновленияИтогов = Новый Массив;
	ИменаСобытийОбновленияИтогов.Добавить("Запись_СписаниеБезналичныхДенежныхСредств");
	ИменаСобытийОбновленияИтогов.Добавить("Запись_РасходныйКассовыйОрдер");
	ИменаСобытийОбновленияИтогов.Добавить("Запись_ПоступлениеБезналичныхДенежныхСредств");
	ИменаСобытийОбновленияИтогов.Добавить("Запись_ПриходныйКассовыйОрдер");
	ИменаСобытийОбновленияИтогов.Добавить("Запись_ОперацияПоПлатежнойКарте");
	ИменаСобытийОбновленияИтогов.Добавить("Запись_ЗаявкаНаРасходованиеДенежныхСредств");
	ИменаСобытийОбновленияИтогов.Добавить("Запись_РаспоряжениеНаПеремещениеДенежныхСредств");
	ИменаСобытийОбновленияИтогов.Добавить("Загрузка_ОбменСБанками");
	
	ИменаСобытийОбновленияСпискаКОплате = Новый Массив;
	ИменаСобытийОбновленияСпискаКОплате.Добавить("Запись_СписаниеБезналичныхДенежныхСредств");
	ИменаСобытийОбновленияСпискаКОплате.Добавить("Запись_РасходныйКассовыйОрдер");
	ИменаСобытийОбновленияСпискаКОплате.Добавить("Запись_ОперацияПоПлатежнойКарте");
	ИменаСобытийОбновленияСпискаКОплате.Добавить("Запись_ЗаявкаНаРасходованиеДенежныхСредств");
	ИменаСобытийОбновленияСпискаКОплате.Добавить("Запись_РаспоряжениеНаПеремещениеДенежныхСредств");
		
	Если ИменаСобытийОбновленияИтогов.Найти(ИмяСобытия) <> Неопределено Тогда
		ОбновитьИтоги();
	КонецЕсли;
	
	СписокКОплате = "ЗаказыКОплате";
	
	Если ИменаСобытийОбновленияСпискаКОплате.Найти(ИмяСобытия) <> Неопределено Тогда
		Элементы[СписокКОплате].Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСписокОперацийОплаты()
	
	СписокОпераций = Новый СписокЗначений;
		
	СписокОпераций.Добавить(Перечисления.ОбластиПланированияПлатежей.РасчетыСПоставщиками);
	СписокОпераций.Добавить(Перечисления.ОбластиПланированияПлатежей.ВозвратыКлиентам);
	СписокОпераций.Добавить(Перечисления.ОбластиПланированияПлатежей.КредитыИлиЗаймыПолученные);
	СписокОпераций.Добавить(Перечисления.ОбластиПланированияПлатежей.Депозиты);
	СписокОпераций.Добавить(Перечисления.ОбластиПланированияПлатежей.ЗаймыВыданные);

	Для каждого Операция Из СписокОперацийОплаты Цикл
		Если Операция.Пометка Тогда
			ОперацияСписка = СписокОпераций.НайтиПоЗначению(Операция.Значение);
			Если ОперацияСписка <> Неопределено Тогда
				ОперацияСписка.Пометка = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СписокОперацийОплаты = СписокОпераций;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИтоги()
	
	ОбновитьОстаткиДенежныхСредств();
	ОбновитьКОплате();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОстаткиДенежныхСредств()
	
	ТекущийОстаток = 0;
	КСписаниюВсего = 0;
	
	ДоступноВсего = ТекущийОстаток - КСписаниюВсего;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКОплате()
	
	//Если Не ЗначениеЗаполнено(БанковскийСчетОтбор) Тогда
		КОплатеВсего = 0;
		ДоступноМинусКОплате = 0;
		Возврат;
	//КонецЕсли;
	
	//СКД = Элементы[СписокКОплате].ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	//Настройки = Элементы[СписокКОплате].ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	//Настройки.Структура.Очистить();
	//
	//ДетальныеЗаписи = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	//ДетальныеЗаписи.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных")).Поле = Новый ПолеКомпоновкиДанных("СуммаКОплате");
	//ПолеИтога = ФинансоваяОтчетностьСервер.НовыйРесурс(СКД, "СуммаКОплате");
	//
	//РезультатСКД = ФинансоваяОтчетностьСервер.ВыгрузитьРезультатСКД(СКД, Настройки);
	//КОплатеВсего = РезультатСКД[0].СуммаКОплате;
	//
	//ДоступноМинусКОплате = ДоступноВсего - КОплатеВсего;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОперацийКОплатеОтборНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Перечисление.ХозяйственныеОперации.Форма.ФормаВыбораОперации",
		Новый Структура("СписокОпераций", СписокОперацийОплаты), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОперацийКОплатеОтборОчистка(Элемент, СтандартнаяОбработка)
	
	СписокОперацийОплаты.ЗаполнитьПометки(Ложь);
	
	УстановитьОтборДинамическихСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОперацийКОплатеОтборОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") Тогда
		
		СписокОперацийОплаты = ВыбранноеЗначение;
	Иначе
		
		Для Каждого ЭлементСписка Из СписокОперацийОплаты Цикл
			ЭлементСписка.Пометка = (ЭлементСписка.Значение = ВыбранноеЗначение);
		КонецЦикла;
	КонецЕсли;
	
	СписокОперацийОплатыПредставление = СписокОперацийПредставление(СписокОперацийОплаты);
	
	УстановитьОтборДинамическихСписков();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СписокОперацийПредставление(СписокОпераций)
	
	СписокОперацийПредставление = "";
	Для Каждого ЭлементСписка Из СписокОпераций Цикл
		Если ЭлементСписка.Пометка Тогда
			СписокОперацийПредставление = СписокОперацийПредставление
				+ ?(ЗначениеЗаполнено(СписокОперацийПредставление), ", ", "")
				+ ?(ЗначениеЗаполнено(ЭлементСписка.Представление), ЭлементСписка.Представление, ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокОперацийПредставление;
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтборПоМенеджеру(Команда)
	ПоказатьМанагера = НЕ ПоказатьМанагера;
	УстановкаОтбораПоМенеджеру();
	//СохранитьНастройкиСервер();
КонецПроцедуры

&НаКлиенте
Процедура УстановкаОтбораПоМенеджеру()
	ЭтаФорма.Элементы.ЗаказыКОплатеОтборы.ПодчиненныеЭлементы.УстановитьОтборПоМенеджеру.Заголовок = ?(ПоказатьМанагера,"Показать все заявки", "Только заявки менеджера");

	Если НЕ ПоказатьМанагера Тогда
		Менеджер = ПолучитьПустогоПользователя();
	Иначе	
		Менеджер = ПолучитьТекущегоПользователя();
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ЗаказыКОплате,
		"Менеджер",
		Менеджер,
		ВидСравненияКомпоновкиДанных.Равно,,
		);
	
	Если НЕ ПоказатьМанагера Тогда
		Для Каждого ЭлементНастройки Из ЗаказыКОплате.Отбор.Элементы Цикл
			
			Если Строка(ЭлементНастройки.ЛевоеЗначение) = "Менеджер" Тогда
				ЭлементНастройки.Использование       = Ложь;
			КонецЕсли;
		КонецЦикла;		// ЭлементНастройки Из ПотребностьПоЗаказам.Отбор.Элементы  
		
		ТолькоМоиЗаказы                              = Ложь;
		
	Иначе
		ЭлементДобавлен                              = Ложь;
		
		Для Каждого ЭлементНастройки Из ЗаказыКОплате.Отбор.Элементы Цикл
			Если Строка(ЭлементНастройки.ЛевоеЗначение) = "Менеджер" Тогда
				ЭлементДобавлен                      = Истина;
				ЭлементНастройки.ВидСравнения        = ВидСравненияКомпоновкиДанных.ВСписке;
				СписокМенеджеров                     = Новый СписокЗначений;
				//СписокМенеджеров.Добавить(ПолучитьПустогоПользователя());
				СписокМенеджеров.Добавить(ПолучитьТекущегоПользователя());
				ЭлементНастройки.ПравоеЗначение      = СписокМенеджеров;
				ЭлементНастройки.Использование       = Истина;
			КонецЕсли;
		КонецЦикла;		// ЭлементНастройки Из ПотребностьПоЗаказам.Отбор.Элементы  
		
		Если НЕ ЭлементДобавлен Тогда
			СписокМенеджеров                         = Новый СписокЗначений;
			СписокМенеджеров.Добавить(ПолучитьПустогоПользователя());
			СписокМенеджеров.Добавить(ПолучитьТекущегоПользователя());
			
			НовЭлементОтбора                         = ЗаказыКОплате.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовЭлементОтбора.ЛевоеЗначение           = Новый ПолеКомпоновкиДанных("Менеджер"); 
			НовЭлементОтбора.ВидСравнения			 = ВидСравненияКомпоновкиДанных.ВСписке;
			НовЭлементОтбора.ПравоеЗначение          = СписокМенеджеров;
			НовЭлементОтбора.Использование           = Истина;
		КонецЕсли;
		
	КонецЕсли;
	Элементы.ЗаказыКОплате.Обновить();
	
КонецПроцедуры	// УстановкаОтбораПоменеджеруКлиент()



#КонецОбласти

#Область ВспомогательныеПроцедурыФункции


// Получить заявку на закупку по данным списка документов
&НаКлиенте
Функция ПолучитьСсылкуНаДокументЗаявкаНаЗакупку()

	ТекущиеДанные = Элементы.ПотребностьПоЗаказам.ТекущиеДанные;		// Возвращает структуру с данными
	
	Если ТипЗнч(ТекущиеДанные) = Тип("ДанныеФормыСтруктура")
		И ТекущиеДанные.Свойство("Ссылка")
	Тогда
		СсылкаНаДокумент = ТекущиеДанные.Ссылка;
	Иначе
		СсылкаНаДокумент = ПолучитьПустуюСсылкуНаДокумент("ЗаявкаНаЗакупку");
	КонецЕсли;
	
	ТекущаяЗаявкаНаЗакупку = СсылкаНаДокумент;
	Возврат СсылкаНаДокумент;

КонецФункции // ПолучитьСсылкуНаДокументЗаявкаНаЗакупку()

&НаСервере
Функция ПолучитьТекстЗапросаЗаявки()

	ЗапросТекст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаЗакупкуТовары.КомментарийПродажа КАК КомментарийПродажа,
	|	ЗаявкаНаЗакупкуТовары.КомментарийЗакупка КАК КомментарийЗакупка,
	|	ЗаявкаНаЗакупкуТовары.Ссылка.Номер КАК НомерЗаявки,
	|	ЗаявкаНаЗакупкуТовары.Ссылка.Дата КАК ДатаЗаявки,
	|	ЗаявкаНаЗакупкуТовары.Назначение КАК Назначение,
	|	ЗаявкаНаЗакупкуТовары.Назначение.Заказ КАК ЗаказКлиента,
	|	ЗаявкаНаЗакупкуТовары.Назначение.Заказ.Номер КАК НомерЗаказаКлиента,
	|	ЗаявкаНаЗакупкуТовары.Номенклатура КАК Номенклатура,
	|	ЗаявкаНаЗакупкуТовары.Номенклатура.Артикул КАК Артикул,
	|	ЗаявкаНаЗакупкуТовары.Характеристика КАК Характеристика,
	|	ЗаявкаНаЗакупкуТовары.Упаковка КАК Упаковка,
	|	ЗаявкаНаЗакупкуТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ЗаявкаНаЗакупкуТовары.КоличествоУпаковок - ЗаявкаНаЗакупкуТовары.ЗаказаноКоличествоУпаковок КАК КоличествоУпаковокОстаток,
	|	ЗаявкаНаЗакупкуТовары.Количество - ЗаявкаНаЗакупкуТовары.ЗаказаноКоличество КАК Количество,
	|	ЗаявкаНаЗакупкуТовары.Отменено КАК Отменено,
	|	ЗаявкаНаЗакупкуТовары.Ссылка КАК Ссылка,
	|	ЗаявкаНаЗакупкуТовары.Ссылка.Приоритет КАК Приоритет,
	|	ЗаявкаНаЗакупкуТовары.НомерСтроки КАК СтрокаЗаказа,
	|	ЗаявкаНаЗакупкуТовары.Менеджер КАК Менеджер,
	|	ЗаявкаНаЗакупкуТовары.ЗаказаноКоличество КАК ЗаказаноКоличество,
	|	ЗаявкаНаЗакупкуТовары.ЗаказаноКоличествоУпаковок КАК ЗаказаноКоличествоУпаковок,
	|	ЗаявкаНаЗакупкуТовары.Заказано КАК Заказано,
	|	ЗаявкаНаЗакупкуТовары.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ЗаявкаНаЗакупкуТовары._УИДЗаказ КАК _УИДЗаказ,
	|	ЗаявкаНаЗакупкуТовары._УИДЗакупка КАК _УИДЗакупка,
	|	ЛОЖЬ КАК Отметка,
	|	ЗаявкаНаЗакупкуТовары.Номенклатура КАК НоменклатураТхт,
	|	ЗаявкаНаЗакупкуТовары.Номенклатура.Артикул КАК АртикулТхт,
	|	ЗаявкаНаЗакупкуТовары.Ссылка.Номер КАК НомерЗаявкиТхт,
	|	ЗаявкаНаЗакупкуТовары.Менеджер КАК МенеджерТхт,
	|	ЗаявкаНаЗакупкуТовары.Назначение.Заказ.Номер КАК НомерЗаказаТхт
	|ИЗ
	|	Документ.ЗаявкаНаЗакупку.Товары КАК ЗаявкаНаЗакупкуТовары
	|ГДЕ
	|	ЗаявкаНаЗакупкуТовары.Отменено = ЛОЖЬ
	|	И НЕ ЗаявкаНаЗакупкуТовары.Ссылка.Статус = &Статус
	|	И НЕ ЗаявкаНаЗакупкуТовары.КоличествоУпаковок = 0
	|	И НЕ ЗаявкаНаЗакупкуТовары.Количество = 0
	|	И ЗаявкаНаЗакупкуТовары.Ссылка.Проведен = ИСТИНА
	|	И ЗаявкаНаЗакупкуТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И &Манагер
	|	И ЗаявкаНаЗакупкуТовары.Заказано = ЛОЖЬ
	|	И &Поиск
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	Ссылка";
	
	Возврат ЗапросТекст;
	
КонецФункции

&НаСервере
Функция ВыбратьДаннынПоНоменклатуре(Знач СтруктураПараметров)

	ОстатокЗаказ = 0;
	ОстатокСклад = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ЗаказыПоставщикамОстатки.ЗаказаноОстаток, 0) КАК ОстатокЗаказ,
	|	0 КАК ОстатокСклад
	|ПОМЕСТИТЬ ТабОстатки
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|			&ДатаКон,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика) КАК ЗаказыПоставщикамОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура,
	|	0,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0)
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&ДатаКон,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика) КАК ТоварыНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ТабОстатки.ОстатокЗаказ) КАК ОстатокЗаказ,
	|	СУММА(ТабОстатки.ОстатокСклад) КАК ОстатокСклад
	|ИЗ
	|	ТабОстатки КАК ТабОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("ДатаКон", 		КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Номенклатура", 	СтруктураПараметров.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", СтруктураПараметров.Характеристика);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОстатокЗаказ = Выборка.ОстатокЗаказ;
		ОстатокСклад = Выборка.ОстатокСклад;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаЗакупкуТовары.Номенклатура КАК Номенклатура,
	|	ЗаявкаНаЗакупкуТовары.Характеристика КАК Характеристика,
	|	СУММА(ЗаявкаНаЗакупкуТовары.КоличествоУпаковок) КАК ОстатокЗаявка
	|ИЗ
	|	Документ.ЗаявкаНаЗакупку.Товары КАК ЗаявкаНаЗакупкуТовары
	|ГДЕ
	|	ЗаявкаНаЗакупкуТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ЗаявкаНаЗакупкуТовары.Ссылка.Проведен = ИСТИНА
	|	И ЗаявкаНаЗакупкуТовары.Заказано = ЛОЖЬ
	|	И ЗаявкаНаЗакупкуТовары.Отменено = ЛОЖЬ
	|	И ЗаявкаНаЗакупкуТовары.Номенклатура = &Номенклатура
	|	И ЗаявкаНаЗакупкуТовары.Характеристика = &Характеристика
	|	И ЗаявкаНаЗакупкуТовары.Ссылка.Статус В(&Статус)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаЗакупкуТовары.Номенклатура,
	|	ЗаявкаНаЗакупкуТовары.Характеристика";
	
	Запрос.УстановитьПараметр("Номенклатура", 	СтруктураПараметров.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", СтруктураПараметров.Характеристика);
	СписокСтатусов = Новый СписокЗначений;
	
	СписокСтатусов.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Согласован);
	СписокСтатусов.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Подтвержден);
	Запрос.УстановитьПараметр("Статус", 		СписокСтатусов);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОстатокЗаявка = Выборка.ОстатокЗаявка;
	КонецЦикла;
	
	
	
	СтруктураПараметров.Вставить("ОстатокЗаказ",  ОстатокЗаказ);
	СтруктураПараметров.Вставить("ОстатокСклад",  ОстатокСклад);
	СтруктураПараметров.Вставить("ОстатокЗаявка", ОстатокЗаявка);
	
	Возврат СтруктураПараметров;

КонецФункции	// ВыбратьДаннынПоНоменклатуре()

&НаСервере
Функция Получить_ТЗ_Из_ДинамическогоСписка()
 
	Схема               = Элементы.ПотребностьПоЗаказам.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки           = Элементы.ПотребностьПоЗаказам.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета   = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки     = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода     = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТЗ                  = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТЗ); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновки); 
	
	Возврат ТЗ;
 
КонецФункции

&НаСервере
Функция ПолучитьОтборПоТаблицеПотребности(Номенклатура = Неопределено)
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВыбраннаяНоменклатура.Номенклатура КАК Номенклатура,
	|	&Характеристика КАК Характеристика,
	|	ВыбраннаяНоменклатура.Назначение КАК Назначение,
	|	ВыбраннаяНоменклатура.Артикул КАК Артикул,
	|	ВыбраннаяНоменклатура.КоличествоУпаковок КАК Количество,
	|	ВыбраннаяНоменклатура.Упаковка КАК Упаковка,
	|	ВыбраннаяНоменклатура.Отметка КАК Отметка,
	|	ВыбраннаяНоменклатура.Ссылка КАК Заявка,
	|	ВыбраннаяНоменклатура._УИДЗаказ КАК _УИДЗаказ,
	|	ВыбраннаяНоменклатура._УИДЗакупка КАК _УИДЗакупка,
	|	ВыбраннаяНоменклатура.СтрокаЗаказа КАК СтрокаЗаказа
	|ПОМЕСТИТЬ СписокНоменклатуры
	|ИЗ
	|	&ТаблицаЗначений КАК ВыбраннаяНоменклатура
	|ГДЕ
	|	&Отбор";
	Если Номенклатура = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Отбор", "ВыбраннаяНоменклатура.Отметка = ИСТИНА");
	Иначе			// Номенклатура = Неопределено
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Отбор", "ВыбраннаяНоменклатура.Номенклатура = &Номенклатура");
	КонецЕсли;		// Номенклатура = Неопределено
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Текст = ТекстЗапроса;
	
	Если Не Номенклатура = Неопределено Тогда
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	КонецЕсли;		// Номенклатура = Неопределено
	
	//ТЗ = Объект.ПотребностьПоЗаказам.Выгрузить();
	ТЗ = Получить_ТЗ_Из_ДинамическогоСписка();
	Запрос.УстановитьПараметр("ТаблицаЗначений", ТЗ);
	
	Если ТЗ.Колонки.Найти("Характеристика") <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Характеристика КАК Характеристика,", "ВыбраннаяНоменклатура.Характеристика КАК Характеристика,");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Характеристика КАК Характеристика,", "");
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	ЗапросПоНоменклатуре = Новый Запрос;
	ЗапросПоНоменклатуре.МенеджерВременныхТаблиц = МенеджерВТ;
	
	ЗапросПоНоменклатуре.Текст = 
	"ВЫБРАТЬ
	|	СписокНоменклатуры.Номенклатура КАК Номенклатура,
	|	&Характеристика КАК Характеристика,
	|	СписокНоменклатуры.Назначение КАК Назначение,
	|	СписокНоменклатуры.Артикул КАК Артикул,
	|	СписокНоменклатуры.Количество КАК Количество,
	|	СписокНоменклатуры.Упаковка КАК Упаковка,
	|	СписокНоменклатуры.Отметка КАК Отметка,
	|	СписокНоменклатуры.Заявка КАК Заявка,
	|	СписокНоменклатуры.СтрокаЗаказа КАК СтрокаЗаказа,
	|	СписокНоменклатуры._УИДЗаказ КАК _УИДЗаказ,
	|	СписокНоменклатуры._УИДЗакупка КАК _УИДЗакупка
	|ИЗ
	|	СписокНоменклатуры КАК СписокНоменклатуры";
	
	

	Если ТЗ.Колонки.Найти("Характеристика") <> Неопределено Тогда
		ЗапросПоНоменклатуре.Текст = СтрЗаменить(ЗапросПоНоменклатуре.Текст, "&Характеристика КАК Характеристика,", "СписокНоменклатуры.Характеристика,");
	Иначе
		ЗапросПоНоменклатуре.Текст = СтрЗаменить(ЗапросПоНоменклатуре.Текст, "&Характеристика КАК Характеристика,", "");
	КонецЕсли;

	Результат = ЗапросПоНоменклатуре.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции // ПолучитьОтборПоТаблицеПотребности()

&НаСервере
Процедура ОбработатьПотребностьПоЗаказам(ВыбраннаяНоменклатура)
	
	СписокНоменклатуры	  = ВыбраннаяНоменклатура.СписокНоменклатуры;
	УдаляемыеСтроки		  = Новый ТаблицаЗначений;
	УдаляемыеСтроки.Колонки.Добавить("Строка");
	
	Для Каждого ТекСтрока Из СписокНоменклатуры Цикл
		СтрокаПотребности = Объект.ПотребностьПоЗаказам.Получить(ТекСтрока.НомерСтроки - 1);
		Если ТекСтрока.Количество < СтрокаПотребности.КоличествоУпаковокОстаток Тогда
			СтрокаПотребности.КоличествоУпаковок = СтрокаПотребности.КоличествоУпаковокОстаток - ТекСтрока.Количество;
			СтрокаПотребности.Отметка = Ложь;
		КонецЕсли 
	КонецЦикла;		// ТекСтрока
	
	СтруктураДляПоиска = Новый Структура("Отметка", Истина);
	МассивУдаляемыхСтрок = Объект.ПотребностьПоЗаказам.НайтиСтроки(СтруктураДляПоиска);
	Для Каждого Строка Из МассивУдаляемыхСтрок Цикл
		Объект.ПотребностьПоЗаказам.Удалить(Строка);
	КонецЦикла;		// Строка Из 
	
КонецПроцедуры	// ОбработатьПотребностьПоЗаказам(ВыбраннаяНоменклатура)()

&НаКлиенте
Процедура РазбитьСтрокуЗаявкиПослеВводаЧислаНаКлинете(Количество, ДополнительныеПараметры) Экспорт
	
	ЧислоВведено = Количество <> Неопределено;

	Если Не ЧислоВведено Тогда
		Возврат;
	ИначеЕсли Количество = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Количество в новой строке не может быть равно нулю.'");
//		Оповещение = Новый ОписаниеОповещения("РазбитьСтрокуЗаявкиЗавершение", ДополнительныеПараметры);
//		ПоказатьПредупреждение(Оповещение,ТекстСообщения);
		ПоказатьПредупреждение(,ТекстСообщения);
		Возврат;
	ИначеЕсли ДополнительныеПараметры.КоличествоПоиск >= 0  И Количество < 0 Тогда
		ТекстСообщения = НСтр("ru = 'Количество в новой строке не может быть отрицательным.'");
//		Оповещение = Новый ОписаниеОповещения("РазбитьСтрокуЗаявкиЗавершение", ДополнительныеПараметры);
//		ПоказатьПредупреждение(Оповещение,ТекстСообщения);
		ПоказатьПредупреждение(,ТекстСообщения);
		Возврат;
	ИначеЕсли ДополнительныеПараметры.КоличествоПоиск >= 0  И Количество >  ДополнительныеПараметры.КоличествоПоиск Тогда
		ТекстСообщения = НСтр("ru = 'Количество в новой строке не может быть больше количества в текущей.'");
//		Оповещение = Новый ОписаниеОповещения("РазбитьСтрокуЗаявкиЗавершение", ДополнительныеПараметры);
//		ПоказатьПредупреждение(Оповещение,ТекстСообщения);
		ПоказатьПредупреждение(,ТекстСообщения);
		Возврат;
	ИначеЕсли Количество =  ДополнительныеПараметры.КоличествоПоиск Тогда
		ТекстСообщения = НСтр("ru = 'Количество в новой строке должно отличаться от количества в текущей.'");
//		Оповещение = Новый ОписаниеОповещения("РазбитьСтрокуЗаявкиЗавершение", ДополнительныеПараметры);
//		ПоказатьПредупреждение(Оповещение,ТекстСообщения);
		ПоказатьПредупреждение(,ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	
	РазбитьСтрокуЗаявкиПослеВводаЧислаНаСервере(Количество, ДополнительныеПараметры);
	
	РазбитьСтрокуЗаявкиЗавершение(ДополнительныеПараметры);
	
КонецПроцедуры	// РазбитьСтрокуЗаявкиПослеВводаЧислаНаКлинете(Количество, ДополнительныеПараметры)
  
&НаСервере
Процедура РазбитьСтрокуЗаявкиПослеВводаЧислаНаСервере(Количество, ДополнительныеПараметры)
	
	
	Остаток	= ДополнительныеПараметры.КоличествоПоиск - Количество; 
	ДополнительныеПараметры.Вставить("Остаток", 		   Остаток);
	ДополнительныеПараметры.Вставить("ЗаказаноКоличество", Количество);
	
	_ОбработкаЗакупкиСервер.РазбитьСтрокиЗаявкиНаЗакупку(ДополнительныеПараметры);
	
	
КонецПроцедуры	// РазбитьСтрокуТЧПослеВводаЧисла(Количество, ДополнительныеПараметры)()

&НаКлиенте
Процедура РазбитьСтрокуЗаявкиЗавершение(ДополнительныеПараметры)
	
//	ЗаполнитьПотребностьЗаказов();
	ЭтаФорма.Элементы.ПотребностьПоЗаказам.Обновить();
	
КонецПроцедуры	// РазбитьСтрокуЗавершение()

&НаСервере
Процедура СохранитьНастройкиСервер()
	КлючОбъекта      = "РабочийСтолМенеджераПоЗакупкамДинамическийСписок.ru";
	КлючНастроек     = "РабочийСтолМенеджераПоЗакупкамДинамическийСписок.ru";
	ОписаниеНастроек = "РабочийСтолМенеджераПоЗакупкамДинамическийСписок.ru";
	ИмяПользователя  = ИмяПользователя();
	
	Настройки        = Новый Соответствие;
	Настройки.Вставить("ПоказатьМанагера", ПоказатьМанагера);

	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек, ИмяПользователя);
КонецПроцедуры	// СохранитьНастройкиСписка()

&НаСервере
Процедура ВосстановитьНастройкиСервер()
	КлючОбъекта                   = "РабочийСтолМенеджераПоЗакупкамДинамическийСписок.ru";
	КлючНастроек                  = "РабочийСтолМенеджераПоЗакупкамДинамическийСписок.ru";
	ОписаниеНастроек              = "РабочийСтолМенеджераПоЗакупкамДинамическийСписок.ru";
	ИмяПользователя               = ИмяПользователя();
	
	ЗначениеНастроек              = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, КлючНастроек, ОписаниеНастроек, ИмяПользователя);
	
	Если ТипЗнч(ЗначениеНастроек) = Тип("Соответствие") Тогда
		ПоказатьМанагера          = ЗначениеНастроек.Получить("ПоказатьМанагера");
	КонецЕсли;
КонецПроцедуры	// ВосстановитьНастройкиСписка()

&НаКлиенте
Процедура УстановкаОтбораПоМенеджеруКлиент()
	ЭтаФорма.Элементы.ПотребностьПоЗаказам.КоманднаяПанель.ПодчиненныеЭлементы.КнопкаПоказатьМенедра.Заголовок = ?(ПоказатьМанагера,"Показать все заявки", "Только заявки менеджера");
	
	Если НЕ ПоказатьМанагера Тогда
		Для Каждого ЭлементНастройки Из ПотребностьПоЗаказам.Отбор.Элементы Цикл
			
			Если Строка(ЭлементНастройки.ЛевоеЗначение) = "Менеджер" Тогда
				ЭлементНастройки.Использование       = Ложь;
			КонецЕсли;
		КонецЦикла;		// ЭлементНастройки Из ПотребностьПоЗаказам.Отбор.Элементы  
		
		ТолькоМоиЗаказы                              = Ложь;
		
	Иначе
		ЭлементДобавлен                              = Ложь;
		
		Для Каждого ЭлементНастройки Из ПотребностьПоЗаказам.Отбор.Элементы Цикл
			Если Строка(ЭлементНастройки.ЛевоеЗначение) = "Менеджер" Тогда
				ЭлементДобавлен                      = Истина;
				ЭлементНастройки.ВидСравнения        = ВидСравненияКомпоновкиДанных.ВСписке;
				СписокМенеджеров                     = Новый СписокЗначений;
				СписокМенеджеров.Добавить(ПолучитьПустогоПользователя());
				СписокМенеджеров.Добавить(ПолучитьТекущегоПользователя());
				ЭлементНастройки.ПравоеЗначение      = СписокМенеджеров;
				ЭлементНастройки.Использование       = Истина;
			КонецЕсли;
		КонецЦикла;		// ЭлементНастройки Из ПотребностьПоЗаказам.Отбор.Элементы  
		
		Если НЕ ЭлементДобавлен Тогда
			СписокМенеджеров                         = Новый СписокЗначений;
			СписокМенеджеров.Добавить(ПолучитьПустогоПользователя());
			СписокМенеджеров.Добавить(ПолучитьТекущегоПользователя());
			
			НовЭлементОтбора                         = ПотребностьПоЗаказам.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовЭлементОтбора.ЛевоеЗначение           = Новый ПолеКомпоновкиДанных("Менеджер"); 
			НовЭлементОтбора.ВидСравнения			 = ВидСравненияКомпоновкиДанных.ВСписке;
			НовЭлементОтбора.ПравоеЗначение          = СписокМенеджеров;
			НовЭлементОтбора.Использование           = Истина;
		КонецЕсли;
		
	КонецЕсли;
	Элементы.ПотребностьПоЗаказам.Обновить();
	
КонецПроцедуры	// УстановкаОтбораПоменеджеруКлиент()
 
&НаКлиенте
Процедура УстановкаОтбораПоДатеКлиент()
	ЭтаФорма.Элементы.ПотребностьПоЗаказам.КоманднаяПанель.ПодчиненныеЭлементы.КнопкаОтборПоДате.Заголовок = ?(ПоказатьДату,"Все заявки после 15.00", "Только заявки до 15.00");
	Если НЕ ПоказатьДату Тогда
		
		
		Для Каждого ЭлементНастройки Из ПотребностьПоЗаказам.Отбор.Элементы Цикл
			Если Строка(ЭлементНастройки.ЛевоеЗначение) = "ДатаЗаявки" Тогда
				ЭлементНастройки.Использование       = Ложь;
			КонецЕсли;
		КонецЦикла;		// ЭлементНастройки Из ПотребностьПоЗаказам.Отбор.Элементы  
		
	Иначе
		
		ЭлементДобавлен                              = Ложь;
		
		Для Каждого ЭлементНастройки Из ПотребностьПоЗаказам.Отбор.Элементы Цикл
			Если Строка(ЭлементНастройки.ЛевоеЗначение) = "ДатаЗаявки" Тогда
				ЭлементДобавлен                      = Истина;
				ЭлементНастройки.ВидСравнения        = ВидСравненияКомпоновкиДанных.Меньше;
				КонтрольнаяДатаЗаявки                = ПолучитьКонтлоьнуюДату();
				ЭлементНастройки.ПравоеЗначение      = КонтрольнаяДатаЗаявки;
				ЭлементНастройки.Использование       = Истина;
			КонецЕсли;
		КонецЦикла;		// ЭлементНастройки Из ПотребностьПоЗаказам.Отбор.Элементы  
		
		Если НЕ ЭлементДобавлен Тогда
			НовЭлементОтбора                         = ПотребностьПоЗаказам.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовЭлементОтбора.ЛевоеЗначение           = Новый ПолеКомпоновкиДанных("ДатаЗаявки"); НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
			КонтрольнаяДатаЗаявки	                 = ПолучитьКонтлоьнуюДату();
			НовЭлементОтбора.ПравоеЗначение          = КонтрольнаяДатаЗаявки;
			НовЭлементОтбора.Использование           = Истина;
		КонецЕсли;
		
	КонецЕсли;
	Элементы.ПотребностьПоЗаказам.Обновить();
КонецПроцедуры	// УстановкаОтбораПоДатеКлиент()
 
&НаСервере
Процедура ЗаписатьИЗакрытьОповещение() Экспорт
	СохранитьНастройкиСервер();
КонецПроцедуры	// ЗаписатьИЗакрытьОповещение()

&НаСервере
Функция ПолучиктьДанныеЗакзаПоставщику(ЗаказПоставщику)
	
	Возврат ?(ЗаказПоставщику = Неопределено, 0, ЗаказПоставщику.Товары.Итог("КоличествоУпаковок"));
	
КонецФункции // ПолучиктьДанныеЗакзаПоставщику()

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Условное оформление динамического списка "ПотребностьПоЗаказам"
	СписокУсловноеОформление = ПотребностьПоЗаказам.КомпоновщикНастроек.Настройки.УсловноеОформление;
	СписокУсловноеОформление.Элементы.Очистить();
	
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Менеджером является текцщий пользователь'");
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  =  Новый ПолеКомпоновкиДанных("Менеджер"); 
	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ПолучитьТекущегоПользователя();
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ДобавленныйРеквизитФон);

	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Менеджером является другой пользователь'");
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  =  Новый ПолеКомпоновкиДанных("Менеджер"); 
	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = ПолучитьТекущегоПользователя();
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ИтогиФон);
	//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ВыборСтандартногоПериодаФонКнопокСНачалаГода);
	
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Менеджером не назначен'");
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  =  Новый ПолеКомпоновкиДанных("Менеджер"); 
	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ПолучитьПустогоПользователя();
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Белый);
	
	//Элемент = УсловноеОформление.Элементы.Добавить();
	//
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаказыКОплатеДатаПлатежа.Имя);
	//
	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗаказыКОплате.ДатаПлатежа");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;                                                           ё
	//ОтборЭлемента.ПравоеЗначение = НачалоДня(ТекущаяДатаСеанса());
	//
	//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныеДанныеЦвет);
	//
	//ЗаказыКОплате.Порядок.Элементы.Очистить();
	//ЭлПорядка = ЗаказыКОплате.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	//ЭлПорядка.Поле = Новый ПолеКомпоновкиДанных("ДатаПлатежа");
	//ЭлПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	//ЭлПорядка.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	//ЭлПорядка.Использование = Истина;    
	//Элементы.ЗаказыКОплате.Обновить();
	
	//ОбщегоНазначенияУТ.УстановитьУсловноеОфорлениеПоляСКлючемРеестраДокументов(ЭтотОбъект,
	//	Элементы.СписокПлатежейБанковскийСчет.Имя,
	//	"СписокПлатежей.БанковскийСчет");
	//	
	//ОбщегоНазначенияУТ.УстановитьУсловноеОфорлениеПоляСКлючемРеестраДокументов(ЭтотОбъект,
	//	Элементы.СписокПлатежейКонтрагент.Имя,
	//	"СписокПлатежей.Контрагент");

	
КонецПроцедуры	// УстановитьУсловноеОформление()

&НаКлиенте
Процедура ОбработкаПолейПотреьностейПоЗаказам(Текст)
	
	СохраненнаяСтрока = Элементы.ПотребностьПоЗаказам.ТекущаяСтрока;

	Поле = Элементы.ПотребностьПоЗаказам.ТекущийЭлемент.Имя;
	
	ТекЗаявка			 = Элементы.ПотребностьПоЗаказам.ТекущиеДанные.Ссылка;
	СтрокаТовары		 = Элементы.ПотребностьПоЗаказам.ТекущиеДанные.СтрокаЗаказа;
	УИДЗакупка			 = Элементы.ПотребностьПоЗаказам.ТекущиеДанные._УИДЗакупка;
	Если Поле = "ПотребностьПоЗаказамКомментарийЗакупка" Тогда
		ПараметрыЗаполнения  = Новый Структура("ТекЗаявка, СтрокаТовары, Текст, УИДЗакупка", ТекЗаявка, СтрокаТовары, Текст, УИДЗакупка);
	ИначеЕсли Поле = "ПотребностьПоЗаказамМенеджер" Тогда
		Текст = _ДоработкиСлужебный.ПолучитьСсылкуМенеджера(Текст);
		ПараметрыЗаполнения = Новый Структура("ТекЗаявка, СтрокаТовары, Менеджер, УИДЗакупка", ТекЗаявка, СтрокаТовары, Текст, УИДЗакупка);
	Иначе
		Текст = Неопределено;
		Возврат;
	КонецЕсли;
	
	ПослеЗакрытияВопросаОИзмененииКоментария(Текст, ПараметрыЗаполнения);
	
	Элементы.ПотребностьПоЗаказам.ТекущаяСтрока = СохраненнаяСтрока;
КонецПроцедуры	// ОбработкаПолейПотреьностейПоЗаказам(Текст)

&НаСервере
Процедура ЗаполнитьЗаявкуНаЗакупку(Параметры)
	
	ТекЗаявка				 = Параметры.ТекЗаявка.ПолучитьОбъект();
	СтрокаТовары			 = Параметры.СтрокаТовары;
	
	Если Параметры.Свойство("Текст") Тогда
		ТекЗаявка.Товары[СтрокаТовары-1].КомментарийЗакупка = Параметры.Текст;
	КонецЕсли;  
	
	Если Параметры.Свойство("Менеджер") Тогда
		ТекЗаявка.Товары[СтрокаТовары-1].Менеджер = ?(Параметры.Менеджер = Неопределено, ПолучитьПустогоПользователя(), Параметры.Менеджер) ;
	КонецЕсли;
	
	ТекЗаявка.Записать();
	
	СохраненнаяСтрока = ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущаяСтрока;
	ЭтаФорма.Элементы.ПотребностьПоЗаказам.Обновить();
	ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущаяСтрока = СохраненнаяСтрока;
КонецПроцедуры	// ЗаполнитьЗаявкуНАЗакупку(Параметры)()
 
// Обработчики, вызываемый после закрытия вопроса пользователю
//
&НаКлиенте
Процедура ПослеЗакрытияВопросаОИзмененииКоментария(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Параметры.Свойство("Текст") Тогда
		Параметры.Текст = Результат;
	ИначеЕсли Параметры.Свойство("Менеджер") Тогда
		Параметры.Менеджер = Результат;
	КонецЕсли;
	ЗаполнитьЗаявкуНаЗакупку(Параметры);
	
	ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущаяСтрока = ТекущаяСтрокаСписка;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппуЗаявокНаЗакупку(Параметры)
	
	ВыделенныеСтроки = Элементы.ПотребностьПоЗаказам.ВыделенныеСтроки;
	
	Схема       = Элементы.ПотребностьПоЗаказам.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки   = Элементы.ПотребностьПоЗаказам.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
 
	КМ			= Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет	    = КМ.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
 
	ПК			= Новый ПроцессорКомпоновкиДанных;
	ПК.Инициализировать(Макет);
 
	ТЗ			= Новый ТаблицаЗначений;
	
	ПВ			= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПВ.УстановитьОбъект(ТЗ);
	ПВ.Вывести(ПК);
	
	Для Каждого ТекСтрока Из ВыделенныеСтроки Цикл
		СтрДанных    = ТЗ.Получить(ТекСтрока - 1);
		ТекЗаявка	 = СтрДанных.Ссылка.ПолучитьОбъект();
		СтрокаТовары = СтрДанных.СтрокаЗаказа;
		
		//**ИЗМЕНЕНО Максимов В.А.
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",Параметры.СтрокаТовары);
		Отбор.Вставить("_УИДЗакупка", Параметры.УИДЗакупка);
		НайденнаяСтрока = ТекЗаявка.Товары.НайтиСтроки(Отбор);
		
		Если Параметры.Свойство("Текст") Тогда
			//ТекЗаявка.Товары[НайденнаяСтрока[0].НомерСтроки -1].КомментарийЗакупка = Параметры.Текст;
			ТекЗаявка.Товары[СтрокаТовары-1].КомментарийЗакупка = Параметры.Текст;
		КонецЕсли;  
		
		Если Параметры.Свойство("Менеджер") Тогда
			//ТекЗаявка.Товары[НайденнаяСтрока[0].НомерСтроки -1].Менеджер = ?(Параметры.Менеджер = Неопределено, ПолучитьПустогоПользователя(), Параметры.Менеджер) ;
			ТекЗаявка.Товары[СтрокаТовары-1].Менеджер = ?(Параметры.Менеджер = Неопределено, ПолучитьПустогоПользователя(), Параметры.Менеджер) ;
		КонецЕсли;
		//************************
	
		ТекЗаявка.Записать();
		
	КонецЦикла;		// ТекСтрока Из ВыделенныеСтроки
	
	ЭтаФорма.Элементы.ПотребностьПоЗаказам.Обновить();
	
КонецПроцедуры	// ЗаполнитьГруппуЗаявокНаЗакупку()

&НаКлиенте
Процедура ПослеЗакрытияВопросаОГрупповомИзмененииКоментария(Результат, Параметры) Экспорт
	
	ВыделенныеСтроки = Элементы.ПотребностьПоЗаказам.ВыделенныеСтроки;
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Текст") Тогда
		Параметры.Текст = Результат;
	ИначеЕсли Параметры.Свойство("Менеджер") Тогда
		Параметры.Менеджер = Результат;
	КонецЕсли;
	
	ЗаполнитьГруппуЗаявокНаЗакупку(Параметры);
	
	ТекущаяСтрокаСписка = ВыделенныеСтроки[0];
	ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущаяСтрока = ТекущаяСтрокаСписка;
	
КонецПроцедуры	// ПослеЗакрытияВопросаОГрупповомИзмененииКоментария()

//**ДОБАВЛЕНО Максимов В.А	

&НаСервере
Функция ПолучитьКоличествоПоступившегоТовара(ЗаказПоставщику, Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриобретениеТоваровУслугТовары.Ссылка КАК Ссылка,
	|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Количество КАК Количество,
	|	ПриобретениеТоваровУслугТовары.Цена КАК Цена,
	|	ПриобретениеТоваровУслугТовары.Сумма КАК Сумма,
	|	ПриобретениеТоваровУслугТовары.Сделка КАК Сделка
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|ГДЕ
	|	ПриобретениеТоваровУслугТовары.Ссылка.ЗаказПоставщику = &ЗаказПоставщику
	|	И ПриобретениеТоваровУслугТовары.Номенклатура = &Номенклатура
	|	И ПриобретениеТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	|	И ПриобретениеТоваровУслугТовары.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Количество = 0;
	
	Если Результат.Количество() = 1 Тогда
		Для Каждого Стр Из Результат Цикл
			Количество = Стр.Количество;
			Прервать;
		КонецЦикла;
	Иначе
		Для Каждого Строка Из Результат Цикл 
			Количество = Количество + Строка.Количество;			
		КонецЦикла;			
	КонецЕсли;
	
	Возврат Количество;
	
КонецФункции	

//*************************

#КонецОбласти




#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПотребностьПоЗаказамПередНачаломИзменения(Элемент, Отказ)
	//ТекСтрока = Элемент.ТекущиеДанные.Ссылка;
	//ФЛ = Новый Структура("Ключ", ТекСтрока);
	//Форма = ПолучитьФорму("Документ.ЗаявкаНаЗакупку.ФормаОбъекта", ФЛ);
	//Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПоставщикамПередНачаломИзменения(Элемент, Отказ)

	ТекСтрока = Элемент.ТекущиеДанные.Ссылка;
	ФЛ = Новый Структура("Ключ", ТекСтрока);
	Форма = ПолучитьФорму("Документ.ЗаказПоставщику.ФормаОбъекта", ФЛ);
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПотребностьПоЗаказамПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		ЭтаФорма.СводнаяПотребность.Очистить();
		Возврат
	КонецЕсли;
	
	СтруктураПараметров 		= Новый Структура("Номенклатура, Характеристика", Элемент.ТекущиеДанные.Номенклатура, Элемент.ТекущиеДанные.Характеристика); 
	СтруктураПараметров 		= ВыбратьДаннынПоНоменклатуре(СтруктураПараметров);
	
	ЭтаФорма.СводнаяПотребность.Очистить();
	НоваяСтрока					= ЭтаФорма.СводнаяПотребность.Добавить();
	НоваяСтрока.Номенклатура    = СтруктураПараметров.Номенклатура;
	НоваяСтрока.ТекущийЗаказ	= СтруктураПараметров.ОстатокЗаявка;
	НоваяСтрока.КоличествоСклад	= СтруктураПараметров.ОстатокСклад;
	НоваяСтрока.КоличествоЗаказ = СтруктураПараметров.ОстатокЗаказ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПотребностьПоЗаказамВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущаяСтрокаСписка = ВыбраннаяСтрока;
	СтандартнаяОбработка	 = Ложь;
	Если ( Поле = Элементы.ПотребностьПоЗаказамНомерЗаявки ) ИЛИ ( Поле = Элементы.ПотребностьПоЗаказамДатаЗаявки ) Тогда
		
		ПоказатьЗначение(,Элементы.ПотребностьПоЗаказам.ТекущиеДанные.Ссылка);
		
	ИначеЕсли ( Поле = Элементы.ПотребностьПоЗаказамНоменклатура ) ИЛИ ( Поле = Элементы.ПотребностьПоЗаказамАртикул ) Тогда
		
		ПоказатьЗначение(,Элементы.ПотребностьПоЗаказам.ТекущиеДанные.Номенклатура);
		
	ИначеЕсли Поле = Элементы.ПотребностьПоЗаказамНазначение Тогда
		
		ПоказатьЗначение(,Элементы.ПотребностьПоЗаказам.ТекущиеДанные.Назначение);
		
	ИначеЕсли Поле = Элементы.ПотребностьПоЗаказамХарактеристика Тогда
	 	    
		ПоказатьЗначение(,Элементы.ПотребностьПоЗаказам.ТекущиеДанные.Характеристика);
		
	//ИначеЕсли Поле = Элементы.ПотребностьПоЗаказамНомерЗаказаКлиента Тогда
	// 	    
	//	ПоказатьЗначение(,Элементы.ПотребностьПоЗаказам.ТекущиеДанные.ЗаказКлиента);
		
	ИначеЕсли Поле = Элементы.ПотребностьПоЗаказамКомментарийЗакупка Тогда
	 	    
		ТекЗаявка			 = Элементы.ПотребностьПоЗаказам.ТекущиеДанные.Ссылка;
		СтрокаТовары		 = Элементы.ПотребностьПоЗаказам.ТекущиеДанные.СтрокаЗаказа;
		УИДЗакупка			 = Элементы.ПотребностьПоЗаказам.ТекущиеДанные._УИДЗакупка;
		Текст				 = Элементы.ПотребностьПоЗаказам.ТекущиеДанные.КомментарийЗакупка;
		ПараметрыЗаполнения  = Новый Структура("ТекЗаявка, СтрокаТовары, Текст, УИДЗакупка", ТекЗаявка, СтрокаТовары, Текст, УИДЗакупка);
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОИзмененииКоментария", ЭтотОбъект, ПараметрыЗаполнения);
		ПоказатьВводСтроки(Оповещение, Текст, "Введите коментарий", 150);
		
	ИначеЕсли Поле = Элементы.ПотребностьПоЗаказамМенеджер Тогда
		
		СтрокаТовары		= Элементы.ПотребностьПоЗаказам.ТекущиеДанные.СтрокаЗаказа;
		ТекЗаявка			= Элементы.ПотребностьПоЗаказам.ТекущиеДанные.Ссылка;
		УИДЗакупка			= Элементы.ПотребностьПоЗаказам.ТекущиеДанные._УИДЗакупка;
		Менеджер			= Элементы.ПотребностьПоЗаказам.ТекущиеДанные.Менеджер;
		ПараметрыЗаполнения = Новый Структура("ТекЗаявка, СтрокаТовары, Менеджер, УИДЗакупка", ТекЗаявка, СтрокаТовары, Менеджер, УИДЗакупка);
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОИзмененииКоментария", ЭтотОбъект, ПараметрыЗаполнения);
		ПоказатьВводЗначения(Оповещение, Менеджер, "Выбарите менеджера");
	 	    
	ИначеЕсли Поле = Элементы.ПотребностьПоЗаказамОтметка Тогда
	 	    
		мИндекс = МассивВыбранныхСсылок.Найти(Элементы.ПотребностьПоЗаказам.ТекущиеДанные._УИДЗакупка);
		Если мИндекс = Неопределено Тогда
			МассивВыбранныхСсылок.Добавить(Элементы.ПотребностьПоЗаказам.ТекущиеДанные._УИДЗакупка);       
		Иначе    
			МассивВыбранныхСсылок.Удалить(мИндекс);
		КонецЕсли;
		ркКоличествоВыбранных = МассивВыбранныхСсылок.Количество();
		ПотребностьПоЗаказам.Параметры.УстановитьЗначениеПараметра("МассивВыбранныхСсылок",МассивВыбранныхСсылок);
	
	ИначеЕсли Поле = Элементы.ПотребностьПоЗаказамКоличествоУпаковок Тогда
	 	    
		ПараметрыОбработки = РаботаСТабличнымиЧастямиКлиент.ПараметрыРазбиенияСтроки();
		 
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПараметрыОбработки",	ПараметрыОбработки);
		ДополнительныеПараметры.Вставить("ТекЗаявка",			ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущиеДанные.Ссылка);
		ДополнительныеПараметры.Вставить("СтрокаТовары",		ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущиеДанные.СтрокаЗаказа);
		ДополнительныеПараметры.Вставить("Номенклатура",		ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущиеДанные.Номенклатура);
		ДополнительныеПараметры.Вставить("Характеристика",		ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущиеДанные.Характеристика);
		ДополнительныеПараметры.Вставить("Характеристика",		ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущиеДанные.Характеристика);
		ДополнительныеПараметры.Вставить("Артикул",				ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущиеДанные.Артикул);
		ДополнительныеПараметры.Вставить("КоличествоПоиск",		ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущиеДанные.КоличествоУпаковок);
		ДополнительныеПараметры.Вставить("УИДЗаказ",			ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущиеДанные._УИДЗаказ);
		ДополнительныеПараметры.Вставить("УИДЗакупка",			ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущиеДанные._УИДЗакупка);
		ДополнительныеПараметры.Вставить("НоваяСтрока",			Ложь);
		
		Оповещение = Новый ОписаниеОповещения("РазбитьСтрокуЗаявкиПослеВводаЧислаНаКлинете", ЭтотОбъект, ДополнительныеПараметры);
		Количество = ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущиеДанные.КоличествоУпаковок;	
		ПоказатьВводЧисла(Оповещение, Количество, ПараметрыОбработки.Заголовок, 15, 3);
	
	ИначеЕсли Поле = Элементы.ПотребностьПоЗаказамКомментарийЗакупка  ИЛИ
			  Поле = Элементы.ПотребностьПоЗаказамКоличествоУпаковок ИЛИ 
			  Поле = Элементы.ПотребностьПоЗаказамМенеджер Тогда
		СтандартнаяОбработка	 = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметки(Команда)
	МассивВыбранныхСсылок.Очистить();
	ПотребностьПоЗаказам.Параметры.УстановитьЗначениеПараметра("МассивВыбранныхСсылок",МассивВыбранныхСсылок);
КонецПроцедуры

//+++ 2025-07-20 Ниронов
&НаКлиенте
Процедура СнятьОтметкиВыделенных(Команда)
	
	ВыделенныеСтроки = Элементы.ПотребностьПоЗаказам.ВыделенныеСтроки;
	
	Для каждого ТекСтрока из ВыделенныеСтроки Цикл
		ЭлементСписка = Элементы.ПотребностьПоЗаказам.ДанныеСтроки(ТекСтрока);
		
		мИндекс = МассивВыбранныхСсылок.Найти(ЭлементСписка._УИДЗакупка);
		Если мИндекс <> Неопределено Тогда
			МассивВыбранныхСсылок.Удалить(мИндекс);
		КонецЕсли;
		ркКоличествоВыбранных = МассивВыбранныхСсылок.Количество();
	КонецЦикла;
	
	ПотребностьПоЗаказам.Параметры.УстановитьЗначениеПараметра("МассивВыбранныхСсылок", МассивВыбранныхСсылок);
	
КонецПроцедуры
//---

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	ВыделенныеСтроки = Элементы.ПотребностьПоЗаказам.ВыделенныеСтроки;
	
	Для каждого ТекСтрока из ВыделенныеСтроки Цикл
		ЭлементСписка = Элементы.ПотребностьПоЗаказам.ДанныеСтроки(ТекСтрока);
		
		мИндекс = МассивВыбранныхСсылок.Найти(ЭлементСписка._УИДЗакупка);
		Если мИндекс = Неопределено Тогда
			МассивВыбранныхСсылок.Добавить(ЭлементСписка._УИДЗакупка);       
		КонецЕсли;
		ркКоличествоВыбранных = МассивВыбранныхСсылок.Количество();
	КонецЦикла;
	
	//МассивВыбранныхСсылок = ОтметитьВсеНаСервере(МассивВыбранныхСсылок);    
	ПотребностьПоЗаказам.Параметры.УстановитьЗначениеПараметра("МассивВыбранныхСсылок",МассивВыбранныхСсылок);    
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму(Команда)
	
	//ЗаполнитьПотребностьЗаказов();
	
	//**ДОБАВЛЕНО Максимов В.А.
	
	Объект.ПараметрыЗаказа = Неопределено;
	ОбработкаНомераЗаказаКлиент();

	//************************
	
	ЭтаФорма.Элементы.ПотребностьПоЗаказам.Обновить();
	ЭтаФорма.Элементы.ЗаказыПоставщикам.Обновить();
	ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущаяСтрока = ТекущаяСтрокаСписка;
КонецПроцедуры

&НаКлиенте
Процедура БуферСчитать(Команда)
	Текст = _ОбработкаДоставкиТоваровКлиент.ПолучитьТекстБуфераОбмена();
	ОбработкаПолейПотреьностейПоЗаказам(Текст);
КонецПроцедуры

&НаКлиенте
Процедура БуферПоместить(Команда)
	
	Поле = Элементы.ПотребностьПоЗаказам.ТекущийЭлемент.Имя;
	Если Поле = "ПотребностьПоЗаказамКомментарийЗакупка" Тогда
		Текст  = Элементы.ПотребностьПоЗаказам.ТекущиеДанные.КомментарийЗакупка
	ИначеЕсли Поле = "ПотребностьПоЗаказамМенеджер" Тогда
		Текст = Строка(_ДоработкиСлужебный.ПолучитьУИДМенеджера(Элементы.ПотребностьПоЗаказам.ТекущиеДанные.Менеджер));
	Иначе
		Текст = "";
		Возврат;
	КонецЕсли;

	_ОбработкаДоставкиТоваровКлиент.УстановитьТекстВБуферОбмена(Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтменитьОтборПоМенеджеру(Команда)
	ПоказатьМанагера = НЕ ПоказатьМанагера;
	УстановкаОтбораПоМенеджеруКлиент();
	СохранитьНастройкиСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПотребностьПоЗаказамМенеджерОчистка(Элемент, СтандартнаяОбработка)
	
	СтрокаТовары = Элементы.ПотребностьПоЗаказам.ТекущиеДанные.СтрокаЗаказа;
	ТекЗаявка	 = Элементы.ПотребностьПоЗаказам.ТекущиеДанные.Ссылка;
	ПараметрыМн	 = Новый Структура("ТекЗаявка, СтрокаТовары, Менеджер", ТекЗаявка,  СтрокаТовары, Неопределено);
	
	ЗаполнитьЗаявкуНаЗакупку(ПараметрыМн);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоДате(Команда)
	ПоказатьДату = НЕ ПоказатьДату;
	УстановкаОтбораПоДатеКлиент();
КонецПроцедуры

&НаКлиенте
Процедура РазбитьСтроку(Команда)
	
	ПараметрыОбработки = РаботаСТабличнымиЧастямиКлиент.ПараметрыРазбиенияСтроки();
	 
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыОбработки",	ПараметрыОбработки);
	ДополнительныеПараметры.Вставить("ТекЗаявка",			ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущиеДанные.Ссылка);
	ДополнительныеПараметры.Вставить("СтрокаТовары",		ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущиеДанные.СтрокаЗаказа);
	ДополнительныеПараметры.Вставить("Номенклатура",		ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущиеДанные.Номенклатура);
	ДополнительныеПараметры.Вставить("Характеристика",		ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущиеДанные.Характеристика);
	ДополнительныеПараметры.Вставить("Характеристика",		ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущиеДанные.Характеристика);
	ДополнительныеПараметры.Вставить("Артикул",				ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущиеДанные.Артикул);
	ДополнительныеПараметры.Вставить("КоличествоПоиск",		ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущиеДанные.КоличествоУпаковок);
	ДополнительныеПараметры.Вставить("УИДЗаказ",			ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущиеДанные._УИДЗаказ);
	ДополнительныеПараметры.Вставить("УИДЗакупка",			ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущиеДанные._УИДЗакупка);
	ДополнительныеПараметры.Вставить("НоваяСтрока",			Ложь);
	
	Оповещение = Новый ОписаниеОповещения(
		"РазбитьСтрокуЗаявкиПослеВводаЧислаНаКлинете", 
		ЭтотОбъект,
		ДополнительныеПараметры);
	Количество = ЭтаФорма.Элементы.ПотребностьПоЗаказам.ТекущиеДанные.КоличествоУпаковок;	
	ПоказатьВводЧисла(Оповещение, Количество, ПараметрыОбработки.Заголовок, 15, 3);
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоМоиЗаказыПриИзменении(Элемент)
	//ЗаполнитьПотребностьЗаказов();
	ЭтаФорма.Элементы.ПотребностьПоЗаказам.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ТолькоМоиЗаказы(Команда)
	ТолькоМоиЗаказы = ?(ТолькоМоиЗаказы, Ложь, Истина);
	//ЗаполнитьПотребностьЗаказов();
	ЭтаФорма.Элементы.ПотребностьПоЗаказам.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаРазделыРабочегоСтолаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	//**Изменено Максимов	
	Если ТекущаяСтраница.Имя = "ГруппаПотребностьПоЗаказам" Тогда
		//ЗаполнитьПотребностьЗаказов();
		ЭтаФорма.Элементы.ПотребностьПоЗаказам.Обновить();
		ЭтаФорма.Элементы.СоздатьПоручениеЭкспедитору.Видимость = Ложь;
	ИначеЕсли ТекущаяСтраница.Имя = "ГруппаЗаказыПоставщикам" Тогда
		ЭтаФорма.Элементы.ЗаказыПоставщикам.Обновить();
		ЭтаФорма.Элементы.ЗаказыПоставщикам.АвтоОбновление = Истина;
	    ЭтаФорма.Элементы.ЗаказыПоставщикам.ПериодАвтоОбновления = 5;			
		ЭтаФорма.Элементы.СоздатьПоручениеЭкспедитору.Видимость = Истина;	
	ИначеЕсли ТекущаяСтраница.Имя = "ГруппаЗадачиПльзователя" Тогда
		ОбновитьСписокЗадачНаСервере();	
		ЭтаФорма.Элементы.СоздатьПоручениеЭкспедитору.Видимость = Ложь;
	ИначеЕсли ТекущаяСтраница.Имя = "СтраницаЗаказыКОплате" Тогда
		ЭтаФорма.Элементы.ЗаказыКОплате.Обновить();
	КонецЕсли;
	//*******************
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПоставщикамПриАктивизацииСтроки(Элемент)
	
	ЭтаФорма._СуммаКоличествоЗаказано = ПолучиктьДанныеЗакзаПоставщику(Элемент.ТекущаяСтрока);
	
	ТекущийЗаказПоставщику = Элемент.ТекущаяСтрока;
	//**ДОБАВЛЕНО Максимов В.А.
	Попытка
		ТекДанные = ЭтаФорма.ПодчиненныеЭлементы.ГруппаРазделыРабочегоСтола.ПодчиненныеЭлементы.ГруппаЗаказыПоставщикам.ПодчиненныеЭлементы.ЗаказыПоставщикам.ТекущиеДанные.Товары;
		
		Если НЕ ( ТекДанные = Неопределено ) Тогда
			Для Каждого Стр Из ТекДанные Цикл
				КоличествоЗаказано = ПолучитьКоличествоПоступившегоТовара(Элемент.ТекущаяСтрока, Стр.Номенклатура);
				Если КоличествоЗаказано > Стр.КоличествоУпаковок Тогда 
					Стр._Поступило = Стр.КоличествоУпаковок;
				Иначе	
					Стр._Поступило = КоличествоЗаказано;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
	Исключение
		
	КонецПопытки;	
	//*************************
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМенеджера(Команда)
	
	//**ИЗМЕНЕНО Максимов В.А.
	Менеджер = ПолучитьТекущегоПользователя();
	ПараметрыЗаполнения = Новый Структура("ТекЗаявка, СтрокаТовары, Менеджер, УИДЗакупка");
	ПараметрыЗаполнения.СтрокаТовары = ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Номенклатура;
	ПараметрыЗаполнения.УИДЗакупка = ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные._УИДЗакупка;	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОГрупповомИзмененииКоментария", ЭтотОбъект, ПараметрыЗаполнения);
	ПоказатьВводЗначения(Оповещение, Менеджер, "Выбарите менеджера");
	//************************
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКомментарий(Команда)
	
	//**ИЗМЕНЕНО Максимов В.А.
	ПараметрыЗаполнения  = Новый Структура("ТекЗаявка, СтрокаТовары, Текст, УИДЗакупка");
	ПараметрыЗаполнения.СтрокаТовары = ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Номенклатура;
	ПараметрыЗаполнения.УИДЗакупка = ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные._УИДЗакупка;	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОГрупповомИзмененииКоментария", ЭтотОбъект, ПараметрыЗаполнения);
	Текст	   = "";
	ПоказатьВводСтроки(Оповещение, Текст, "Введите коментарий", 150);
	//************************
	
КонецПроцедуры

#КонецОбласти


#Область ОбработкаЗаявкиНаЗакупку

&НаКлиенте
Процедура СоздатьЗаявкуНаЗакупку(Команда)

	ФормаДокумента		= ПолучитьФорму("Документ.ЗаявкаНаЗакупку.ФормаОбъекта");
	ДанныеФормы			= ФормаДокумента.Объект; 										// Получаем объект формы в переменную
	
	// Заполняем документ на сервере
	ПараметрыЗаполнения = Новый Структура("ДанныеФормы", ДанныеФормы);
	ТипДокумента		= "ЗаявкаНаЗакупку";
	ЗаполнитьДокументНаСервере(ПараметрыЗаполнения, ТипДокумента);
	
	КопироватьДанныеФормы(ПараметрыЗаполнения.ДанныеФормы, ФормаДокумента.Объект);		// копируем наш объект в объект формы и далее открываем ее
	ФормаДокумента.Открыть();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработкаЗаказаПоставщику

&НаСервере
Функция ВыбранныеЗаявкиНаДоставку()
	
	СтрОшибок				= НСтр("ru = ''");
	
	СписокНоменклатуры		= ПолучитьОтборПоТаблицеПотребности();
	
	Если СписокНоменклатуры.Количество() > 0 Тогда
		мСписокНоменклатуры = _ДоработкиСлужебный.ПреобразоватьТаблицуЗначенийВМассив(СписокНоменклатуры);
		Возврат Новый Структура("СписокНоменклатуры", мСписокНоменклатуры);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ВыбранныеЗаявкиНаДоставку()

&НаКлиенте
Процедура СоздатьЗаказПоставщику(Команда)
	
	ФормаДокумента		  = ПолучитьФорму("Документ.ЗаказПоставщику.ФормаОбъекта");
	ДанныеФормы       	  = ФормаДокумента.Объект; 										// Получаем объект формы в переменную
	
	ДокументОснование	  = ПолучитьПустуюСсылкуНаДокумент("ЗаявкаНаЗакупку");			// ДокументОснование для заказа поставщику
   	ВыбраннаяНоменклатура = ВыбранныеЗаявкиНаДоставку();
	
	Если ВыбраннаяНоменклатура = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	// Заполняем документ на сервере
	ПараметрыЗаполнения  = Новый Структура("ДанныеФормы, ДокументОснование, СписокНоменклатуры, РабочийСтолЗакупок", ДанныеФормы, Неопределено, ВыбраннаяНоменклатура.СписокНоменклатуры, Истина);
	ЗаполнитьДокументНаСервере(ПараметрыЗаполнения, "ЗаказПоставщику");
	
  	КопироватьДанныеФормы(ПараметрыЗаполнения.ДанныеФормы, ФормаДокумента.Объект);	// копируем наш объект в объект формы и далее открываем ее
	Если ЗначениеЗаполнено(ПараметрыЗаполнения.ДанныеФормы.ДокументОснование) Тогда
		ФормаДокумента.Элементы.ГруппаОснование.Видимость = Истина;
	КонецЕсли;		//  		

	ФормаДокумента.Открыть();
	
//  	ОбработатьПотребностьПоЗаказам(ВыбраннаяНоменклатура);
	
	Элементы.ПотребностьПоЗаказам.Обновить();
	
КонецПроцедуры

#КонецОбласти


#Область НастройкиИнтерфейса

&НаКлиенте
Процедура НастройкаИнтерфейсаНачало()
	НастройкаИнтерфейсаСервер(Истина);
	ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
КонецПроцедуры	// НастройкаИнтерфейсаНачало()
 
&НаКлиенте 
Процедура НастройкаИнтерфейсаКонец()
	НастройкаИнтерфейсаСервер(Ложь);
	ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
КонецПроцедуры	// НастройкаИнтерфейсаКонец()

&НаСервере
Процедура НастройкаИнтерфейсаСервер(Минимальный)
	
	Настройки = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения");
	
	Если Минимальный Тогда
		Настройки = МинимальныйИнтерфейс(Настройки);
	Иначе
		Настройки = РабочийИнтерфейс();
	КонецЕсли;
	
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", , Настройки);
	
КонецПроцедуры	// НастройкаМинимальногоИнтерфейса()

&НаСервере
Функция МинимальныйИнтерфейс(Настройки)
	Настройки				 = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
	ГруппаНастроек			 = Новый ГруппаНастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	НастройкиСостава		 = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	ГруппаВерх				 = Новый ГруппаНастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	ГруппаВерх.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельИнструментов"));
	ГруппаВерх.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых"));
	НастройкиСостава.Верх.Добавить(ГруппаВерх);
	Настройки.УстановитьСостав(НастройкиСостава);
    Возврат Настройки;	
КонецФункции	// МинимальныйИнтерфейс()()
 
&НаСервере
Функция РабочийИнтерфейс()
	Настройки				 = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
	НастройкиСостава		 = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	ГруппаВерх				 = Новый ГруппаНастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	ГруппаВерх.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельИнструментов"));
	ГруппаВерх.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых"));
	НастройкиСостава.Верх.Добавить(ГруппаВерх);
	НастройкиСостава.Лево.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельРазделов"));
	Настройки.УстановитьСостав(НастройкиСостава);
    Возврат Настройки;	
КонецФункции	// РабочийИнтерфейс()()

&НаСервере
Процедура ОбработатьТаблицуФормы(ВыбраннаяНоменклатура)
	
КонецПроцедуры	// ОбработатьТаблицуФормы()

//**********
&НаКлиенте
Процедура ПоручениеЭкспедитору(Команда)
	
	ФормаДокументаПоручениеЭкспедитору = ПолучитьФорму("Документ.ПоручениеЭкспедитору.ФормаОбъекта");	
	ДанныеФормы        = ФормаДокументаПоручениеЭкспедитору.Объект;	
	ДокументОснование  = ПолучитьСсылкуНаДокументЗаказПоставщику();			
	// Заполняем документ на сервере
	ПараметрыЗаполнения    = Новый Структура("ДанныеФормы, ДокументОснование", ДанныеФормы, ДокументОснование);
	ЗаполнитьЗаявкуНаСервере(ПараметрыЗаполнения );
	
	КопироватьДанныеФормы(ПараметрыЗаполнения.ДанныеФормы, ФормаДокументаПоручениеЭкспедитору.Объект); // копируем наш объект в объект формы и далее открываем ее
	
	ФормаДокументаПоручениеЭкспедитору.Открыть();
	
	//ФормаДокумента = ПолучитьФорму("Документ.ПоручениеЭкспедитору.Форма.ФормаДокумента");
	//
	//ФормаДокумента.Открыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьЗаявкуНаСервере(ПараметрыЗаполнения)

	НовыйДокументПоручениеЭкспедитору	    = Документы.ПоручениеЭкспедитору.СоздатьДокумент();
	НовыйДокументПоручениеЭкспедитору.СпособДоставки  = Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте;
	НовыйДокументПоручениеЭкспедитору.Дата = ТекущаяДата();
	НовыйДокументПоручениеЭкспедитору.Склад = ПараметрыЗаполнения.ДокументОснование.Склад;
	НовыйДокументПоручениеЭкспедитору.Пункт = ПараметрыЗаполнения.ДокументОснование.Контрагент;
	НовыйДокументПоручениеЭкспедитору.АдресДоставки = ПараметрыЗаполнения.ДокументОснование.АдресДоставки;
	НовыйДокументПоручениеЭкспедитору.ЗонаДоставки = ПараметрыЗаполнения.ДокументОснование.ЗонаДоставки;
	НовыйДокументПоручениеЭкспедитору.Ответственный = Пользователи.ТекущийПользователь();
	НовыйДокументПоручениеЭкспедитору.ОсобыеУсловияПеревозкиОписание = ПараметрыЗаполнения.ДокументОснование.ОсобыеУсловияПеревозкиОписание; 
	НовыйДокументПоручениеЭкспедитору.ДополнительнаяИнформацияПоДоставке = ПараметрыЗаполнения.ДокументОснование.ДополнительнаяИнформацияПоДоставке;
	
		Если ДеньНедели(НовыйДокументПоручениеЭкспедитору.Дата) = 1 Тогда
			НовыйДокументПоручениеЭкспедитору.ДатаВыполнения = НовыйДокументПоручениеЭкспедитору.Дата + 86400;
		ИначеЕсли ДеньНедели(НовыйДокументПоручениеЭкспедитору.Дата) = 2 Тогда	
			НовыйДокументПоручениеЭкспедитору.ДатаВыполнения = НовыйДокументПоручениеЭкспедитору.Дата + 86400;
		ИначеЕсли ДеньНедели(НовыйДокументПоручениеЭкспедитору.Дата) = 3 Тогда	
			НовыйДокументПоручениеЭкспедитору.ДатаВыполнения = НовыйДокументПоручениеЭкспедитору.Дата + 86400;
		ИначеЕсли ДеньНедели(НовыйДокументПоручениеЭкспедитору.Дата) = 4 Тогда	
			НовыйДокументПоручениеЭкспедитору.ДатаВыполнения = НовыйДокументПоручениеЭкспедитору.Дата + 86400;
		ИначеЕсли ДеньНедели(НовыйДокументПоручениеЭкспедитору.Дата) = 5 Тогда	
			НовыйДокументПоручениеЭкспедитору.ДатаВыполнения = НовыйДокументПоручениеЭкспедитору.Дата + 259200;
		КонецЕсли;	

	//НовыйДокументЗаявкиНаДоставку.Дата  = _ДоработкиСлужебный.ПолучитьСледующийДень(ТекущаяДата());
	
	
	
	ЗначениеВДанныеФормы(НовыйДокументПоручениеЭкспедитору, ПараметрыЗаполнения.ДанныеФормы);

КонецПроцедуры

&НаКлиенте
Функция ПолучитьСсылкуНаДокументЗаказПоставщику()

	ТекущиеДанные = Элементы.ЗаказыПоставщикам.ТекущиеДанные; // Возвращает структуру с данными

	СсылкаНаДокумент = ТекущиеДанные.Ссылка;
	
	ТекущийЗаказКлиента = СсылкаНаДокумент;
	Возврат СсылкаНаДокумент;

КонецФункции

//**ДОБАВЛЕНО Максимов В.А.

&НаКлиенте
Процедура ОбновитьСписокЗадач(Команда)
	ОбновитьСписокЗадачНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокЗадачНаСервере()

	БизнесПроцессыИЗадачиСервер.УстановитьПараметрыСпискаМоихЗадач(ЗадачиПользователяСписок);
	// Цвет просроченных задач зависит от значения текущей даты,
	// поэтому нужно переинициализировать условное оформление.
	УстановитьУсловноеОформлениеЗадач();
	Элементы.ЗадачиПользователяСписок.Обновить();

КонецПроцедуры	

&НаСервере
Процедура УстановитьУсловноеОформлениеЗадач()
	
	//УсловноеОформление.Элементы.Очистить();
	БизнесПроцессыИЗадачиСервер.УстановитьОформлениеЗадач(ЗадачиПользователяСписок);
	
КонецПроцедуры	// УстановитьУсловноеОформлениеЗадач()

&НаКлиенте
Процедура ЗадачиПользователяСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрокаСписка = ВыбраннаяСтрока;
	СтандартнаяОбработка	 = Ложь;
	
	Если Поле = Элементы.ЗадачиПользователяСписокПредмет Тогда
		ПоказатьЗначение(,Элементы.ЗадачиПользователяСписок.ТекущиеДанные.Предмет);
	Иначе
		ПоказатьЗначение(,Элементы.ЗадачиПользователяСписок.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаНомераЗаказаКлиент()
	
	Если ТипЗнч(Объект.ПараметрыЗаказа) = Тип("Структура") Тогда
		
		Если  Объект.ПараметрыЗаказа.Свойство("НомерЗаказа") И  Объект.ПараметрыЗаказа.Свойство("ДатаЗаказа") Тогда
			
			ЭлементДобавлен = Ложь;
			Для Каждого ЭлементНастройки Из ЗаказыПоставщикамСписок.Отбор.Элементы Цикл
				Если Строка(ЭлементНастройки.ЛевоеЗначение) = "Номер" Тогда
					ЭлементДобавлен                      = Истина;
					ЭлементНастройки.ВидСравнения        = ВидСравненияКомпоновкиДанных.Равно;
					Номер       			             = Объект.ПараметрыЗаказа.НомерЗаказа;
					ЭлементНастройки.ПравоеЗначение      = Номер;
					ЭлементНастройки.Использование       = Истина;
				КонецЕсли;
			КонецЦикла;		// ЭлементНастройки Из ЗаказыКлиентовСписок.Отбор.Элементы 
						
			Если НЕ ЭлементДобавлен Тогда
				НовЭлементОтбора                         = ЗаказыПоставщикамСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовЭлементОтбора.ЛевоеЗначение           = Новый ПолеКомпоновкиДанных("Номер"); 
				НовЭлементОтбора.ВидСравнения			 = ВидСравненияКомпоновкиДанных.Равно;
				Номер       			         	     = Объект.ПараметрыЗаказа.НомерЗаказа;
				НовЭлементОтбора.ПравоеЗначение 	     = Номер;
				НовЭлементОтбора.Использование           = Истина;
			КонецЕсли;
						
		Иначе
			
			Для Каждого ЭлементНастройки Из ЗаказыПоставщикамСписок.Отбор.Элементы Цикл
				Если Строка(ЭлементНастройки.ЛевоеЗначение) = "Номер" Тогда
					ЭлементДобавлен                      = Истина;
					ЭлементНастройки.ВидСравнения        = ВидСравненияКомпоновкиДанных.Равно;
					Номер       			             = Объект.ПараметрыЗаказа.НомерЗаказа;
					ЭлементНастройки.ПравоеЗначение      = Номер;
					ЭлементНастройки.Использование       = Ложь;
				КонецЕсли;
			КонецЦикла;		// ЭлементНастройки Из ЗаказыКлиентовСписок.Отбор.Элементы 
			
		КонецЕсли;	
		
	Иначе
		
		Для Каждого ЭлементНастройки Из ЗаказыПоставщикамСписок.Отбор.Элементы Цикл
			Если Строка(ЭлементНастройки.ЛевоеЗначение) = "Номер" Тогда
				ЭлементДобавлен                      = Истина;
				ЭлементНастройки.ВидСравнения        = ВидСравненияКомпоновкиДанных.Равно;
				Номер       			             = "";
				ЭлементНастройки.ПравоеЗначение      = Номер;
				ЭлементНастройки.Использование       = Ложь;
			КонецЕсли;
		КонецЦикла;		// ЭлементНастройки Из ЗаказыКлиентовСписок.Отбор.Элементы 
		
	КонецЕсли;
	
КонецПроцедуры	// ОбработкаНомераЗаказаКлиент()

&НаСервере
Процедура ОбработкаЗадачПользователя()
	
	БизнесПроцессыИЗадачиСервер.УстановитьПараметрыСпискаМоихЗадач(ЗадачиПользователяСписок);
	ПараметрыОтбора = Новый Соответствие();
	ПараметрыОтбора.Вставить("ПоказыватьВыполненные", ПоказыватьВыполненные);
	УстановитьОтбор(ПараметрыОтбора);
	
	ПараметрыОтбораФормы = Новый Структура( ); //ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Параметры.Отбор);
	//Параметры.Отбор.Очистить();
	
	ИспользоватьДатуИВремяВСрокахЗадач = ПолучитьФункциональнуюОпцию("ИспользоватьДатуИВремяВСрокахЗадач");
	Элементы.ЗадачиПользователяСписокСрокИсполнения.Формат = ?(ИспользоватьДатуИВремяВСрокахЗадач, "ДЛФ=DT", "ДЛФ=D");
	Элементы.ЗадачиПользователяСписокДатаНачала.Формат = ?(ИспользоватьДатуИВремяВСрокахЗадач, "ДЛФ=DT", "ДЛФ=D");
	Элементы.ЗадачиПользователяСписокДата.Формат = ?(ИспользоватьДатуИВремяВСрокахЗадач, "ДЛФ=DT", "ДЛФ=D");
		
КонецПроцедуры	// ОбработкаЗадачПользователя()

&НаСервере
Процедура УстановитьОтбор(ПараметрыОтбора)
	
	Если ПараметрыОтбора["ПоказыватьВыполненные"] Тогда
		СгруппироватьПоКолонкеНаСервере("");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ЗадачиПользователяСписок, "Выполнена", Ложь, , , Не ПараметрыОтбора["ПоказыватьВыполненные"]);
		
КонецПроцедуры

&НаСервере
Процедура СгруппироватьПоКолонкеНаСервере(Знач ИмяКолонкиРеквизита)
	РежимГруппировки = ИмяКолонкиРеквизита;
	Если НЕ ПустаяСтрока(РежимГруппировки) Тогда
		ПоказыватьВыполненные = Ложь;
		ПараметрыОтбора = Новый Соответствие();
		ПараметрыОтбора.Вставить("ПоказыватьВыполненные", ПоказыватьВыполненные);	
		УстановитьОтбор(ПараметрыОтбора);	
	КонецЕсли;
	ЗадачиПользователяСписок.Группировка.Элементы.Очистить();
	Если НЕ ПустаяСтрока(ИмяКолонкиРеквизита) Тогда
		ПолеГруппировки = ЗадачиПользователяСписок.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(ИмяКолонкиРеквизита);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	ii = 12;
КонецПроцедуры
 
#КонецОбласти


#Область ПодключаемыйСистемаНапоминаний

&НаКлиенте
Процедура ПодключаемыйСоздатьНапоминание(Команда)
	ОткрытьФорму("РегистрСведений.НапоминанияПользователя.Форма.Напоминание");
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйИзменитьНапоминание(Команда)
	ОткрытьФорму("РегистрСведений.НапоминанияПользователя.Форма.Напоминание", Новый Структура("Ключ", Элементы.СписокНапоминаний.ТекущаяСтрока));
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйУдалитьНапоминание(Команда)
	УдалитьНапоминаниеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНапоминаниеНаКлиенте()
	
	КнопкиДиалога = Новый СписокЗначений;
	КнопкиДиалога.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Удалить';
														|en = 'Delete'"));
	КнопкиДиалога.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Не удалять';
															|en = 'Do not delete'"));
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьНапоминаниеЗавершение", ЭтотОбъект);
	
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Удалить напоминание?';
											|en = 'Do you want to delete the reminder?'"), КнопкиДиалога);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНапоминаниеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	КлючЗаписи = Элементы.СписокНапоминаний.ТекущаяСтрока;
	ПараметрыНапоминания = Новый Структура("Пользователь,ВремяСобытия,Источник");
	ЗаполнитьЗначенияСвойств(ПараметрыНапоминания, Элементы.СписокНапоминаний.ТекущиеДанные);
	
	ПараметрыНапоминания.Пользователь = ПользователиКлиент.ТекущийПользователь();
	
	ОтключитьНапоминание(ПараметрыНапоминания);
	НапоминанияПользователяКлиент.УдалитьЗаписьИзКэшаОповещений(ПараметрыНапоминания);
	Оповестить("Запись_НапоминанияПользователя", Новый Структура, КлючЗаписи);
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.НапоминанияПользователя"));
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьНапоминание(ПараметрыНапоминания)
	НапоминанияПользователяСлужебный.ОтключитьНапоминание(ПараметрыНапоминания, Ложь);
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.ЗаказыПоставщикам);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.ЗаказыПоставщикам, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.ЗаказыПоставщикам);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ДобавитьКомандуСозданияЗаявкиНаДоставку()
	
	
	//Добавление команды формы
	Команда = Команды.Добавить(	"_СоздатьЗаявкуНаДоставку"); //Имя команды
	Команда.Заголовок = "Заявка на доставку";
	Команда.Действие  = "Команда_СоздатьЗаявкуНаДоставку"; //Имя связанной процедуры
	
	//Добавление кнопки формы
	КнопкаФормы = Элементы.Добавить(
		"КнопкаПоказатьПредупреждение", //Имя кнопки
		Тип("КнопкаФормы"),             //Тип, всегда КнопкаФормы
		ЭтаФорма.Элементы.ЗаказыПоставщикам.КоманднаяПанель.ПодчиненныеЭлементы.ПодменюСоздатьНаОсновании.ПодчиненныеЭлементы.ПодменюСоздатьНаОснованииОбычное);                      //Контейнер для кнопки (Форма, Группа, Командная панель)
		
	КнопкаФормы.ИмяКоманды = "_СоздатьЗаявкуНаДоставку"; //Связь с командой по имени
	
	//Возможные варианты вида кнопки:
	//	-Гиперссылка
	//	-ГиперссылкаКоманднойПанели
	//	-КнопкаКоманднойПанели
	//	-ОбычнаяКнопка
	//Если контейнер для формы - командная панель
	//то вид кнопки должен быть КнопкаКоманднойПанели
	КнопкаФормы.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели; 
	
	
КонецПроцедуры	

&НаКлиенте
Процедура Команда_СоздатьЗаявкуНаДоставку(Команда)
	
	Если ( ТекущийЗаказПоставщику = ПредопределенноеЗначение("Документ.ЗаказПоставщику.ПустаяСсылка") ) Тогда
		Возврат;
	КонецЕсли;	
	
	
	ПараметрыФормы = Новый Структура("Основание", ТекущийЗаказПоставщику);
	ОткрытьФорму("Документ._ЗаявкаНаДоставку.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры
#КонецОбласти

