
&ИзменениеИКонтроль("ВыполнитьОбработкуПоРегламентномуЗаданию")
Процедура Кт_ВыполнитьОбработкуПоРегламентномуЗаданию1(ВнешняяОбработка, ИдентификаторКоманды)

    #Вставка
	Если ТипЗнч(ИдентификаторКоманды) = Тип("ПеречислениеСсылка._РегламентныеЗаданияРасширения")  Тогда
		Кт_ОбщегоНазначенияСервер.ВыполнитьРегламентнуюЗадачу( ИдентификаторКоманды );
	Иначе
	#КонецВставки
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ЗапускДополнительныхОбработок);

	// Запись журнала регистрации
	ЗаписатьИнформацию(ВнешняяОбработка, 
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Команда %1: Запуск.'"), ИдентификаторКоманды));

	// Выполнение команды
	Попытка
		ВыполнитьКоманду(Новый Структура("ДополнительнаяОбработкаСсылка, ИдентификаторКоманды", ВнешняяОбработка, ИдентификаторКоманды), Неопределено);
	Исключение
		Уточнение = ОбщегоНазначенияКлиентСервер.УточнениеИсключения(ИнформацияОбОшибке(),
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Команда %1 не выполнена по причине:'"), ИдентификаторКоманды));
		ВызватьИсключение(Уточнение.Текст, Уточнение.Категория,,, ИнформацияОбОшибке());
	КонецПопытки;

	// Запись журнала регистрации
	ЗаписатьИнформацию(ВнешняяОбработка, 
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Команда %1: Завершение.'"), ИдентификаторКоманды));
	#Вставка
	КонецЕсли;
	#КонецВставки

КонецПроцедуры
