
//&Вместо("ЗаполнитьПустоеСопоставлениеВНоменклатуреКонтрагентаПоНоменклатуреИБ")
Процедура Расш1_ЗаполнитьПустоеСопоставлениеВНоменклатуреКонтрагентаПоНоменклатуреИБ(Знач ТаблицаТоваров, Отказ, ТаблицаТоваровПоУмолчанию)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", ТаблицаТоваров);
	Запрос.УстановитьПараметр("ПустаяНоменклатура", СопоставлениеНоменклатурыКонтрагентовСлужебный.ПустаяСсылкаНоменклатурыБЭД());
	
	Попытка
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Упаковка КАК Упаковка
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	&Товары КАК Товары
		|ГДЕ
		|	Товары.Номенклатура <> &ПустаяНоменклатура
		|	И Товары.НоменклатураКонтрагента <> ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)";

		ТекстЗапроса = "";
		СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ТекстЗапросаПоискаНеСопоставленнойНоменклатурыКонтрагентовПоНоменклатуреИБ(
			ТекстЗапроса, ТаблицаТоваровПоУмолчанию);
			
		Если ПустаяСтрока(ТекстЗапроса) Тогда
			Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
			"ВЫБРАТЬ
			|	Товары.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.Характеристика КАК Характеристика,
			|	Товары.Упаковка КАК Упаковка
			|ИЗ
			|	Товары КАК Товары
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
			|		ПО Товары.НоменклатураКонтрагента = НоменклатураКонтрагентов.Ссылка
			|ГДЕ
			|	НоменклатураКонтрагентов.Номенклатура = &ПустаяНоменклатура";
			
		ИначеЕсли ТаблицаТоваровПоУмолчанию Тогда
			Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() + ТекстЗапроса;
		Иначе
			Запрос.Текст = ТекстЗапроса;
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.НоменклатураПартнера КАК НоменклатураКонтрагента,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Упаковка КАК Упаковка
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	&Товары КАК Товары
		|ГДЕ
		|	Товары.Номенклатура <> &ПустаяНоменклатура
		|	И Товары.НоменклатураПартнера <> ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)";

		ТекстЗапроса = "";
		СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ТекстЗапросаПоискаНеСопоставленнойНоменклатурыКонтрагентовПоНоменклатуреИБ(
			ТекстЗапроса, ТаблицаТоваровПоУмолчанию);
			
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Товары.НоменклатураПартнера", "НоменклатураПартнера"); 		
			
		Если ПустаяСтрока(ТекстЗапроса) Тогда
			Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
			"ВЫБРАТЬ
			|	Товары.НоменклатураПартнера КАК НоменклатураКонтрагента,
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.Характеристика КАК Характеристика,
			|	Товары.Упаковка КАК Упаковка
			|ИЗ
			|	Товары КАК Товары
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
			|		ПО Товары.НоменклатураКонтрагента = НоменклатураКонтрагентов.Ссылка
			|ГДЕ
			|	НоменклатураКонтрагентов.Номенклатура = &ПустаяНоменклатура";
						
		ИначеЕсли ТаблицаТоваровПоУмолчанию Тогда
			Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() + ТекстЗапроса;
		Иначе
			Запрос.Текст = ТекстЗапроса;
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
	КонецПопытки;		
		

	Пока Выборка.Следующий() Цикл
		
		НоменклатураКонтрагента = Выборка.НоменклатураКонтрагента;
		
		Попытка
			
			ЗаблокироватьДанныеДляРедактирования(НоменклатураКонтрагента);
			
			НоменклатураКонтрагентаОбъект = НоменклатураКонтрагента.ПолучитьОбъект(); // СправочникОбъект
			ЗаполнитьЗначенияСвойств(НоменклатураКонтрагентаОбъект, Выборка);
			НоменклатураКонтрагентаОбъект.Записать();
			
		Исключение
			
			ТекстОшибки = НСтр("ru = 'Не удалось заблокировать %Элемент%. %ОписаниеОшибки%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Элемент%",        НоменклатураКонтрагента);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ОписаниеОшибки%", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			Отказ = Истина;
			ВызватьИсключение ТекстОшибки;
			
		КонецПопытки;
		
	КонецЦикла;	
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьПустоеСопоставлениеВНоменклатуреКонтрагентаПоНоменклатуреИБ")
Процедура Кт_ЗаполнитьПустоеСопоставлениеВНоменклатуреКонтрагентаПоНоменклатуреИБ(Знач ТаблицаТоваров, Отказ, ТаблицаТоваровПоУмолчанию)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", ТаблицаТоваров);
	Запрос.УстановитьПараметр("ПустаяНоменклатура", СопоставлениеНоменклатурыКонтрагентовСлужебный.ПустаяСсылкаНоменклатурыБЭД());
	
	#Вставка
	Попытка
	#КонецВставки
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары
	|ГДЕ
	|	Товары.Номенклатура <> &ПустаяНоменклатура
	|	И Товары.НоменклатураКонтрагента <> ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)";

	ТекстЗапроса = "";
	СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ТекстЗапросаПоискаНеСопоставленнойНоменклатурыКонтрагентовПоНоменклатуреИБ(
	ТекстЗапроса, ТаблицаТоваровПоУмолчанию);

	Если ПустаяСтрока(ТекстЗапроса) Тогда
		Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
		"ВЫБРАТЬ
		|	Товары.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Упаковка КАК Упаковка
		|ИЗ
		|	Товары КАК Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
		|		ПО Товары.НоменклатураКонтрагента = НоменклатураКонтрагентов.Ссылка
		|ГДЕ
		|	НоменклатураКонтрагентов.Номенклатура = &ПустаяНоменклатура";

	ИначеЕсли ТаблицаТоваровПоУмолчанию Тогда
		Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() + ТекстЗапроса;
	Иначе
		Запрос.Текст = ТекстЗапроса;
	КонецЕсли;

	Выборка = Запрос.Выполнить().Выбрать();
	
	#Вставка
	Исключение
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.НоменклатураПартнера КАК НоменклатураКонтрагента,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Упаковка КАК Упаковка
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	&Товары КАК Товары
		|ГДЕ
		|	Товары.Номенклатура <> &ПустаяНоменклатура
		|	И Товары.НоменклатураПартнера <> ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)";

		ТекстЗапроса = "";
		СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ТекстЗапросаПоискаНеСопоставленнойНоменклатурыКонтрагентовПоНоменклатуреИБ(
			ТекстЗапроса, ТаблицаТоваровПоУмолчанию);
			
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Товары.НоменклатураПартнера", "НоменклатураПартнера"); 		
			
		Если ПустаяСтрока(ТекстЗапроса) Тогда
			Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
			"ВЫБРАТЬ
			|	Товары.НоменклатураПартнера КАК НоменклатураКонтрагента,
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.Характеристика КАК Характеристика,
			|	Товары.Упаковка КАК Упаковка
			|ИЗ
			|	Товары КАК Товары
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
			|		ПО Товары.НоменклатураКонтрагента = НоменклатураКонтрагентов.Ссылка
			|ГДЕ
			|	НоменклатураКонтрагентов.Номенклатура = &ПустаяНоменклатура";
						
		ИначеЕсли ТаблицаТоваровПоУмолчанию Тогда
			Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() + ТекстЗапроса;
		Иначе
			Запрос.Текст = ТекстЗапроса;
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
	КонецПопытки;		
	#КонецВставки
	Пока Выборка.Следующий() Цикл

		НоменклатураКонтрагента = Выборка.НоменклатураКонтрагента;

		Попытка

			ЗаблокироватьДанныеДляРедактирования(НоменклатураКонтрагента);

			НоменклатураКонтрагентаОбъект = НоменклатураКонтрагента.ПолучитьОбъект(); // СправочникОбъект
			ЗаполнитьЗначенияСвойств(НоменклатураКонтрагентаОбъект, Выборка);
			НоменклатураКонтрагентаОбъект.Записать();

		Исключение

			ТекстОшибки = НСтр("ru = 'Не удалось заблокировать %Элемент%. %ОписаниеОшибки%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Элемент%",        НоменклатураКонтрагента);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ОписаниеОшибки%", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));

			Отказ = Истина;
			ВызватьИсключение ТекстОшибки;

		КонецПопытки;

	КонецЦикла;

КонецПроцедуры
