
&НаКлиенте
Процедура Расш1_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)

	//++ Сухарев Б.В. 15.01.2019
	ОбработатьКодСтроки();
	//== Сухарев Б.В
	
КонецПроцедуры

&НаКлиенте
&После("ОбработкаОповещенияФрагмент")
Процедура Расш1_ОбработкаОповещенияФрагмент(Знач ИмяСобытия, Знач Параметр)

	//***********************************************************************
	//ИЗМЕНЕНО Сухарев Б.В. 09.08.2018
	Если (ИмяСобытия = "Запись_ЗаказаНаОтгрузку") Тогда
		ВыбранныеЗаказы = НЕОПРЕДЕЛЕНО;
		НомерЗаказа		= НЕОПРЕДЕЛЕНО;
		Если Параметр.Свойство("ВыбранныеЗаказы", ВыбранныеЗаказы) Тогда
			Если НЕ ВыбранныеЗаказы = НЕОПРЕДЕЛЕНО Тогда
				Если ВыбранныеЗаказы.Свойство(Объект.Номер) Тогда
					ЭтаФорма.Прочитать();
					ЭтаФорма.ОбновитьОтображениеДанных(ЭтаФорма.Элементы.Товары);
					ЭтаФорма.Элементы.Товары.Обновить();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//***********************************************************************
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	//++ Сухарев Б.В. 08.02.2019
	ПолучитьДоступКПолям();
	//== Сухарев Б.В
	
КонецПроцедуры

&НаСервере
Функция УстановитьТолькоПросмотрПоНаличиюЗаявок()
	
	//++ Сухарев Б.В. 26.12.2018
	Отметка = Ложь;
	//== Сухарев Б.В
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаявкаНаЗакупку.Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаЗакупку КАК ЗаявкаНаЗакупку
	|ГДЕ
	|	ЗаявкаНаЗакупку.ДокументОснование = &ДокументОснование
	|	И ЗаявкаНаЗакупку.СтатусЗаявкиНаЗакупку = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаЗакупку.ПереданаЗакупке)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаЗакупку.Ссылка";
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	//++ Сухарев Б.В. 26.12.2018
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка.Проведен Тогда
			Отметка =  Истина;
		КонецЕсли; 
	КонецЦикла;		// Выборка.Следующий()
	
	Если _ДоработкиСлужебный.ПолучитьДоступКполямДокумента() Тогда
		Отметка =  Ложь;
	КонецЕсли;
	
	Возврат Отметка;
	//== Сухарев Б.В
	
КонецФункции

&НаКлиенте
Процедура Расш1_ТоварыПриНачалеРедактированияПосле(Элемент, НоваяСтрока, Копирование)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	//************************************************************************
	//ИЗМЕНЕНО Сухарев Б.В. 04.07.2018
	Если НЕ НоваяСтрока Тогда
		Если ТекущиеДанные.Упаковка.Пустая() Тогда
	//		_СтараяУпаковка = ТекущиеДанные.Номенклатура.ЕдиницаИзмерения;
			_СтараяУпаковка = ТекущиеДанные.Номенклатура;
		Иначе
			_СтараяУпаковка = ТекущиеДанные.Упаковка;
		КонецЕсли;
	КонецЕсли;
	//************************************************************************
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ТоварыУпаковкаПриИзменении")
Процедура Кт_ТоварыУпаковкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	ОчиститьСообщения();
	ПрименитьОплатуБонуснымиБалламиКлиент(, Истина);

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
#Вставка
	//************************************************************************
	//ИЗМЕНЕНО Сухарев Б.В. 04.07.2018
	СтруктураДействий.Вставить("ПересчитатьУпаковокиЕдиницы", Истина);
	СтруктураДействий.Вставить("ТекущийДокумент", Объект.Ссылка);
	СтруктураДействий.Вставить("СтараяУпаковка"  , _СтараяУпаковка);
	Если ТекущаяСтрока.Упаковка.Пустая() Тогда
	//	СтруктураДействий.Вставить("НоваяУпаковка"   , ТекущаяСтрока.Номенклатура.ЕдиницаИзмерения);
		СтруктураДействий.Вставить("НоваяУпаковка"   , ТекущаяСтрока.Номенклатура);
	Иначе	
		СтруктураДействий.Вставить("НоваяУпаковка"   , ТекущаяСтрока.Упаковка);
	КонецЕсли;
	//************************************************************************
#КонецВставки
	
	Если ТекущаяСтрока.Количество > 0 И Не ЗначениеЗаполнено(ТекущаяСтрока.ВидЦены) Тогда
		СтруктураДействий.Вставить("ПересчитатьЦенуЗаУпаковку", ТекущаяСтрока.Количество);
	ИначеЕсли ТекущаяСтрока.Количество > 0 И ЗначениеЗаполнено(ТекущаяСтрока.ВидЦены) Тогда
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияЦеныВСтрокеТЧ(Объект));
	ИначеЕсли (ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение)) 
		Или (Не ИспользоватьСоглашенияСКлиентами И ИспользуетсяЦенообразование25) Тогда
		СтруктураДействий.Вставить("ЗаполнитьУсловияПродаж", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ(Объект));
	КонецЕсли;
	
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	ДобавитьДействияОбеспеченияНаКлиенте(СтруктураДействий, "ДоступноВДругихСтроках");
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	Если ОбеспечениеВДокументахКлиент.ТребуетсяОбновитьКолонкуДоступно(СтруктураДействий) Тогда
		ОбновитьКолонкуДоступноСервер();
	КонецЕсли;
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	СкидкиНаценкиЗаполнениеКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ТоварыНоменклатураПриИзменении")
Процедура Кт_ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	ОчиститьСообщения();
	ПрименитьОплатуБонуснымиБалламиКлиент(, Истина);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(Объект, Истина));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакВариантОформленияПродажи", Новый Структура("Номенклатура", "ВариантОформленияПродажи"));
	СтруктураДействий.Вставить("ЗаполнитьСодержание", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", ТекущаяСтрока.Склад, ПараметрыУказанияСерий));
	ДобавитьДействияОбеспеченияНаКлиенте(СтруктураДействий,
		"ВариантОбеспечения,ДоступноВДругихСтроках,СкладОбязателен,ДатаОтгрузкиОбязательна");
	ДобавитьДействиеЗаполненияЦен(СтруктураДействий);
	
	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ЭтаФорма.ИмяФормы, "Товары"));
	Если Объект.ХозяйственнаяОперация <> ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПоставкаПодПринципала") Тогда
		СтруктураДействий.Вставить("ЗаполнитьПодразделениеВСтрокеТЧ", Новый Структура("Подразделение", Объект.Подразделение));
	КонецЕсли;
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	Если ОбеспечениеВДокументахКлиент.ТребуетсяОбновитьКолонкуДоступно(СтруктураДействий) Тогда
		ОбновитьКолонкуДоступноСервер();
	КонецЕсли;
	
#Вставка
	//++ Сухарев Б.В. 30.10.2018
	// все добавляемые товары умолчанию в Не обеспечивать.
	ТекущаяСтрока.ВариантОбеспечения = ПолучитьВариантОбеспеченияСервер();
	//== Сухарев Б.В 
#КонецВставки
	ОбеспечениеВДокументахКлиентСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	СкидкиНаценкиЗаполнениеКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
КонецПроцедуры

//++ Сухарев Б.В. 30.10.2018
&НаСервере
Функция ПолучитьВариантОбеспеченияСервер()
	
	Возврат _ОбработкаДоставкиТоваровСервер.ПолучитьВариантОбеспечения();
	
КонецФункции
//== Сухарев Б.В

&НаСервере
&После("УстановитьУсловноеОформление")
Процедура Расш1_УстановитьУсловноеОформление()

	//++ Сухарев Б.В. 05.08.2019
	 Если Объект.Закрыт Тогда
	 	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ПодменюСоздатьНаОсновании.Доступность = НЕ Объект.Закрыт;
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ПодменюЗаполнить.Доступность		   = НЕ Объект.Закрыт;
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаГлобальныеКоманды.ПодчиненныеЭлементы[7].Доступность = НЕ Объект.Закрыт;
	 КонецЕсли;
	//== Сухарев Б.В
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ОбработкаВыбораПодборНаСервере")
Процедура Кт_ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	
	ПараметрыЗаполненияСтавкиНДС = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(Объект, Истина);
	Если Объект.НеОтгружатьЧастями И ЗначениеЗаполнено(Объект.ДатаОтгрузки) Тогда
		ПараметрыЗаполненияСтавкиНДС.Дата = Объект.ДатаОтгрузки;
	КонецЕсли;
	
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ПараметрыЗаполненияСтавкиНДС);
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьСодержание", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
	Если Объект.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПоставкаПодПринципала Тогда
		СтруктураДействий.Вставить("ЗаполнитьПодразделениеВСтрокеТЧ", Новый Структура("Подразделение", Объект.Подразделение));
	КонецЕсли;
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");

	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
	ДобавитьДействияОбеспеченияНаСервере(СтруктураДействий, "СкладОбязателен,ДатаОтгрузкиОбязательна");
	
	НачалоДня = НачалоДня(ТекущаяДатаСеанса());
	
	ПоляДляЗаполнения = "НоменклатураНабора, ХарактеристикаНабора, Номенклатура, Характеристика, Упаковка, Склад, ДатаОтгрузки, 
		|ВидЦены, Цена, КоличествоУпаковок, Количество, Сумма, СуммаНДС, СуммаСНДС, СуммаРучнойСкидки, ПроцентРучнойСкидки, 
		|СрокПоставки, ВариантОбеспечения, Обособленно, Серия";
	ПоляПоиска = "НоменклатураНабора, ХарактеристикаНабора, Номенклатура, Характеристика, Упаковка, Склад, 
		|ВидЦены, ВариантОбеспечения, Обособленно, Серия, Цена";
	Если Не Объект.НеОтгружатьЧастями Тогда
		ПоляПоиска = ПоляПоиска + ", ДатаОтгрузки";
	КонецЕслИ;
	ПараметрыОтбора = Новый Структура(ПоляПоиска);
	ОбрабатываемыеСтроки = Новый Массив;
	ДатыОтгрузки = Новый Соответствие;
	
	ТребуетсяПересчетУпаковок = Ложь;
	Для каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
		Если ЗначениеЗаполнено(СтрокаТовара.НоменклатураНабора) Тогда
			// Для наборов следует увеличивать количество в строках набора, которые уже добавлены в ТЧ.
			
			ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаТовара);
			НайденныеСтроки = Объект.Товары.НайтиСтроки(ПараметрыОтбора);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				ТекущаяСтрока = НайденныеСтроки[0];
				ТекущаяСтрока.Количество = ТекущаяСтрока.Количество + СтрокаТовара.Количество;
				ТребуетсяПересчетУпаковок = Истина;
			Иначе
				ТекущаяСтрока = Объект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара, ПоляДляЗаполнения);
			КонецЕсли;
		Иначе
			// Для не-наборов следует всегда добавлять новую строку, независимо от наличия такого товара в ТЧ.
			
			ТекущаяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара, ПоляДляЗаполнения);
		КонецЕсли;
		
		ТекущаяСтрока.ИндексНабора = ?(ЗначениеЗаполнено(ТекущаяСтрока.НоменклатураНабора), 1, 0);
		ОбрабатываемыеСтроки.Добавить(ТекущаяСтрока);
		ДатыОтгрузки.Вставить(ТекущаяСтрока, СтрокаТовара.ДатаОтгрузки);
		
	КонецЦикла;
	Если ТребуетсяПересчетУпаковок Тогда
		СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
	КонецЕсли;
		
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ОбрабатываемыеСтроки,
		СтруктураДействий,
		Объект.Товары,
		КэшированныеЗначения);
		
	Для Каждого ТекущаяСтрока Из ОбрабатываемыеСтроки Цикл
	
		ТекущаяСтрока.ДатаОтгрузки = ОбеспечениеВДокументахСервер.ДатаОтгрузкиОбработкаВыбораПодбор(
			ДатыОтгрузки.Получить(ТекущаяСтрока),
			ТекущаяСтрока.ВариантОбеспечения,
			НачалоДня);
		
#Вставка
		//++ Сухарев Б.В. 30.10.2018 
		Если Объект._РабочийСтолПродаж Тогда
			ТекущаяСтрока.ВариантОбеспечения = _ОбработкаДоставкиТоваровСервер.ПолучитьВариантОбеспечения();
		КонецЕсли;
		//== Сухарев Б.В
#КонецВставки
	КонецЦикла;
	
	ОбеспечениеВДокументахСервер.АктуализироватьДатуОтгрузкиОднойДатой(
		Объект.НеОтгружатьЧастями,
		Объект.ДатаОтгрузки,
		Объект.Товары,
		"ДатаОтгрузки");
	ОбновитьКолонкуДоступноСервер();
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
	СкладыСервер.ПриИзмененииСкладаВТабличнойЧасти(Объект.Товары, ТаблицаСкладов, СкладГруппа);
	ВсегоСкладов = ТаблицаСкладов.Количество();
	СкладыКлиентСервер.ОбновитьКартинкуГруппыСкладов(НадписьНесколькоСкладов, Элементы.КартинкаНесколькоСкладов, ВсегоСкладов);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	МногооборотнаяТараСервер.ОбновитьСостояниеЗаполненияМногооборотнойТары(Объект.СостояниеЗаполненияМногооборотнойТары);

КонецПроцедуры

//++ Сухарев Б.В. 15.01.2019
&НаСервере
Процедура ОбработатьКодСтроки()
	
	ТаблицаТоваровДокумента = Объект.Товары.Выгрузить();
	ТаблицаТоваровДокумента.Свернуть("КодСтроки");
	ТаблицаТоваровДокумента.Сортировать("КодСтроки Убыв"); 
	мКодСтроки = ТаблицаТоваровДокумента[0].КодСтроки;
	
	Для Каждого ТекСтрока Из Объект.Товары Цикл
		СтруктураПоиска = Новый Структура("КодСтроки", ТекСтрока.КодСтроки);
		МассивСтрок    = Объект.Товары.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрок.Количество() > 1 Тогда
			Для Ном = 1 По МассивСтрок.Количество() - 1 Цикл
				мКодСтроки = мКодСтроки + 1;
				Объект.Товары[МассивСтрок[1].НомерСтроки-1].КодСтроки = мКодСтроки;
			КонецЦикла;// Ном 
		КонецЕсли;
	КонецЦикла;// ТекСтрока Из Товары 
	
КонецПроцедуры// ОбработатьКодСтроки()

&НаКлиенте
Процедура ПолучитьДоступКПолям()
	
	Если _ДоработкиСлужебный.ПолучитьДоступКполямДокумента() Тогда
		ЭтаФорма.Элементы.Товары_Отгрузка.ТолькоПросмотр		= Ложь;
		ЭтаФорма.Элементы.Товары_ЗаявкаНаЗакупку.ТолькоПросмотр = Ложь;
	Иначе
		ЭтаФорма.Элементы.Товары_Отгрузка.ТолькоПросмотр		= Истина;
		ЭтаФорма.Элементы.Товары_ЗаявкаНаЗакупку.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры	// ПолучитьДоступКПолям()

//**ДОБАВЛЕНО Максимов В.А.

&НаСервере
Процедура Кт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//КАВ начало
	Если Не РольДоступна("ПолныеПрава") Тогда
		Элементы.Закрыт.Доступность = Ложь;
	КонецЕсли;
	//КАВ конец

	//**ИЗМЕНЕНО Максимов
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыДоступа.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|ГДЕ
	|	ГруппыДоступа.Пользователи.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	ГруппыДоступа = Запрос.Выполнить().Выгрузить();
	
	Если НЕ РольДоступна("АдминистраторСистемы") Тогда
		Элементы.Статус.Видимость 					= Ложь;
		Элементы.Приоритет.Видимость 				= Ложь;
		Элементы.ПоказатьСообщения.Видимость 		= Ложь;
		Элементы.ЗакрытьЗаказ.Видимость 			= Ложь;
		Элементы.Закрыт.Видимость 					= Ложь;
		Элементы.ФормаПровести.Видимость 			= Ложь;
		Элементы.ФормаГлобальныеКоманды.Видимость 	= Ложь;
		Элементы.ТоварыПоискПоШтрихкоду.Видимость 	= Ложь;
		Элементы.ГруппаОбеспечение.Видимость 		= Ложь;
		Элементы.ГруппаЦеныСкидки.Видимость 		= Ложь;
		Элементы.ФормаСправка.Видимость 			= Ложь;
		Элементы.Состояние.Видимость 				= Ложь;
		Элементы.ПодменюЭДО.Видимость 				= Ложь;
		Элементы.ПодменюОтчетыВажное.Видимость		= Ложь;
		Элементы.ПодменюОтчетыОбычное.Видимость		= Ложь;
		Элементы.Организация.Видимость				= Ложь;
		Элементы.Склад.Видимость					= Ложь;
		КоманднаяПанель.ПодчиненныеЭлементы.ПодменюЭДО.Видимость 	= Ложь;
		//КоманднаяПанель.ПодчиненныеЭлементы.ЗачетОплаты.Видимость 	= Ложь;
		//КоманднаяПанель.ПодчиненныеЭлементы.ИзменитьФорму.Видимость = Ложь;
		Элементы.Товары.КоманднаяПанель.ПодчиненныеЭлементы.ТоварыВыделитьВсе.Видимость 			= Ложь;
		//Элементы.Товары.КоманднаяПанель.ПодчиненныеЭлементы.ГруппаТоварыПодобратьТовары.Видимость 	= Ложь;
		//Элементы.Товары.КоманднаяПанель.ПодчиненныеЭлементы.ТоварыСкопироватьСтроки.Видимость	 	= Ложь;
		Элементы.Товары.КоманднаяПанель.ПодчиненныеЭлементы.ТоварыРазбитьСтроку.Видимость	 		= Ложь;
		//Элементы.Товары.КоманднаяПанель.ПодчиненныеЭлементы.ТоварыВставитьСтроки.Видимость	 	= Ложь;
		Элементы.Товары.КоманднаяПанель.ПодчиненныеЭлементы.ТоварыСоставНабора.Видимость			= Ложь;
		//Элементы.ПодменюПечать.ПодчиненныеЭлементы.ПодменюПечатьОбычное.ПодчиненныеЭлементы.ПодменюПечатьОбычное__1.Видимость = Ложь;
		Элементы.ПодменюПечать.ПодчиненныеЭлементы.ПодменюПечатьОбычное.ПодчиненныеЭлементы.ПодменюПечатьОбычное__КомплектДокументов.Видимость = Ложь;
		Элементы.ПодменюПечать.ПодчиненныеЭлементы.ПодменюПечатьОбычное.ПодчиненныеЭлементы.ПодменюПечатьОбычное__КомплектДокументовСНастройкой.Видимость = Ложь;
		Элементы.ПодменюПечать.ПодчиненныеЭлементы.ПодменюПечатьОбычное.ПодчиненныеЭлементы.ПодменюПечатьОбычное__Извещение.Видимость = Ложь;
		Элементы.ПодменюПечать.ПодчиненныеЭлементы.ПодменюПечатьОбычное.ПодчиненныеЭлементы.ПодменюПечатьОбычное__ЗаказКлиента.Видимость = Ложь;
		Элементы.ГруппаОсновное.Видимость = Ложь;
		Элементы.ГруппаДополнительно.Видимость = Ложь;
		Элементы.Комментарий.Видимость = Истина;
		Элементы.Комментарий.Доступность = Истина;
	Иначе
		Элементы.ГруппаТовары.ПодчиненныеЭлементы.Группа2.Видимость = Ложь;
		Элементы.ГруппаТовары.ПодчиненныеЭлементы.Группа3.Видимость = Ложь;
		Элементы.СтраницаДоставка.ПодчиненныеЭлементы.ГруппаМенеджер.Видимость = Ложь;
	КонецЕсли;
	
	Для Каждого Группа Из ГруппыДоступа Цикл
		Если Группа.Ссылка.Наименование = "Администраторы" Тогда 
			Элементы.Закрыт.Доступность = Истина;
			Прервать;
		Иначе
			Элементы.Закрыт.Доступность = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Группа Из ГруппыДоступа Цикл
		Если Группа.Ссылка.Наименование = "Бухгалтер" Тогда
			Элементы.ГруппаДополнительно.Видимость = Истина;
		КонецЕсли;
	КонецЦикла;	
	
	Для Каждого Группа Из ГруппыДоступа Цикл
		Если Группа.Ссылка.Наименование = "Менеджер по закупкам" Тогда
			Элементы.СтраницаДоставка.ПодчиненныеЭлементы.ГруппаМенеджер.Видимость = Истина;
		КонецЕсли;
	КонецЦикла;
	//******************

	//**ДОБАВЛЕНО Максимов В.А. отключено 21.03.2025 по запросу Виктора
	ЭтаФорма.ТолькоПросмотр = Ложь;
	//Если НЕ РольДоступна("АдминистраторСистемы") Тогда
	//	ЕстьЗаявкаНаЗакупку = НайтиСвязанныйДокументЗаявкаНаЗакупку();

	//	Если ЕстьЗаявкаНаЗакупку Тогда
	//		Сообщить("По данному заказу создан документ Заявка на закупку, изменение документа недоступно");
	//		ЭтаФорма.ТолькоПросмотр = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	//*************************
	
	//***************************************************************
	//ИЗМЕНЕНО Стефутин В.П. 21.08.2023
	УстановитьДоступностьКонтракта();
	//***************************************************************
	
КонецПроцедуры

Функция НайтиСвязанныйДокументЗаявкаНаЗакупку()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаЗакупку.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаЗакупку КАК ЗаявкаНаЗакупку
	|ГДЕ
	|	ЗаявкаНаЗакупку.ДокументОснование = &ДокументОснование
	|	И ЗаявкаНаЗакупку.Проведен = ИСТИНА
	|	И ЗаявкаНаЗакупку.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Если Рез.Количество() = 0 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПартнерИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	шш =1;
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	шш=1;
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	шш=1;
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	шш=1;
	
КонецПроцедуры

//***********************

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	//КАВ начало
	Если СокрЛП(Команда.Имя) = "ПодменюПечатьКомандаПечати6" Тогда
		Структура = Новый Структура("Сумма", СуммаОплаты); 
		ФормаВыбораРеквизитовСчета = ПолучитьФорму("Обработка.ПечатьСчетовНаОплату.Форма.ФормаВыбораРеквизитовСчета", Структура);
		Структура = ФормаВыбораРеквизитовСчета.ОткрытьМодально();
		
		Если Структура.Отказ = Истина Тогда
			Возврат;
		КонецЕсли;
		
		ЗаписатьСтруктуруВПараметрСеанса(Структура);
	КонецЕсли;
	//КАВ конец
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры



#Область ПеременныеМодуля

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

//КАВ начало
Процедура ЗаписатьСтруктуруВПараметрСеанса(Структура)
	ПараметрыСеанса.ДопСчетНаОплату_Подномер = Структура.Подномер;
	ПараметрыСеанса.ДопСчетНаОплату_Процент = Структура.Процент;
	ПараметрыСеанса.ДопСчетНаОплату_Сумма = Структура.Сумма;
	ПараметрыСеанса.ДопСчетНаОплату_Аванс = Структура.Аванс;
КонецПроцедуры

//&НаКлиенте
//Процедура Расш1_Соглашение1ПриИзмененииПосле(Элемент)
//	
//	Если Не ЗначениеЗаполнено (Объект.Соглашение) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	СкидкиНаценкиЗаполнениеКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
//	
//	СоглашениеПриИзмененииСервер(Ложь);
//	ПродажиКлиент.ОповеститьОбОкончанииЗаполненияУсловийПродаж();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Расш1_Соглашение1НачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	ПараметрыВыбораСоглашения = ПродажиКлиент.ПараметрыНачалаВыбораСоглашенияСКлиентом();
//	
//	ПараметрыВыбораСоглашения.Элемент                     = Элемент;
//	ПараметрыВыбораСоглашения.Партнер                     = Объект.Партнер;
//	ПараметрыВыбораСоглашения.Документ                    = Объект.Соглашение;
//	ПараметрыВыбораСоглашения.ДатаДокумента               = Объект.Дата;
//	ПараметрыВыбораСоглашения.ДанныеФормыСтруктура        = Объект;
//	
//	Если Не РедактированиеРеквизитовEDIКлиентСервер.РеквизитДоступенДляРедактирования(ЭтотОбъект, "Поставщик") Тогда
//		ПараметрыВыбораСоглашения.Организация = Объект.Организация;
//	КонецЕсли;
//	
//	Если Не РедактированиеРеквизитовEDIКлиентСервер.РеквизитДоступенДляРедактирования(ЭтотОбъект, "Покупатель") Тогда
//		ПараметрыВыбораСоглашения.Контрагент = Объект.Контрагент;
//	КонецЕсли;
//	
//	ПродажиКлиент.НачалоВыбораСоглашенияСКлиентом(ПараметрыВыбораСоглашения, СтандартнаяОбработка);
//	
//	Объект.Партнер = Объект.Партнер;
//	
//	
//КонецПроцедуры

//КАВ конец  

&НаКлиенте
Процедура Кт_Соглашение1ПриИзмененииВместо(Элемент)
	СоглашениеПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Кт_Соглашение1НачалоВыбораВместо(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СоглашениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Партнер1ПриИзмененииВместо(Элемент)
	ПартнерПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Кт_Дата1ПриИзмененииВместо(Элемент)
	ДатаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Кт_Склад1ПриИзмененииВместо(Элемент)
	СкладПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Кт_Организация1ПриИзмененииВместо(Элемент)
	ОрганизацияПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Кт_Договор1ПриИзмененииВместо(Элемент)
	ДоговорПриИзменении(Элемент); 
	
	////РИВ +++ 24.11.25
	//Подразд = ПолучитьПодразделение(Объект.Договор);
	//МенеджерДог = ПолучитьМенеджерДог(Объект.Договор);
	//Если ЗначениеЗаполнено(Подразд) Тогда
	//	Объект.Подразделение = Подразд;
	//КонецЕсли;
	//Если ЗначениеЗаполнено(МенеджерДог) Тогда
	//	Объект.Менеджер = МенеджерДог;
	//КонецЕсли;
	////РИВ --- 24.11.25

КонецПроцедуры

&НаСервере
&После("ДоговорПриИзмененииСервер")
Процедура Кт_ДоговорПриИзмененииСервер()
	
	//РИВ +++ 24.11.25
	Подразд = ПолучитьПодразделение(Объект.Договор);
	МенеджерДог = ПолучитьМенеджерДог(Объект.Договор);
	Если ЗначениеЗаполнено(Подразд) Тогда
		Объект.Подразделение = Подразд;
	КонецЕсли;
	Если ЗначениеЗаполнено(МенеджерДог) Тогда
		Объект.Менеджер = МенеджерДог;
	КонецЕсли;
	//РИВ --- 24.11.25
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПодразделение(Договор)

	Возврат Договор.Подразделение;	

КонецФункции // ПолучитьПодразделение()


&НаСервере
Функция ПолучитьМенеджерДог(Договор)

	Возврат Договор.Менеджер;	

КонецФункции // ПолучитьПодразделение()


&НаКлиенте
Процедура Кт_Договор1СозданиеВместо(Элемент, СтандартнаяОбработка)
	ДоговорСоздание(Элемент, СтандартнаяОбработка);
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьДоступностьКонтракта()
	Элементы.Кт_КонтрактНомер.Доступность 	= Объект.Кт_Контракт;
	Элементы.Кт_КонтрактДата.Доступность 	= Объект.Кт_Контракт;
КонецПроцедуры	

&НаКлиенте
Процедура Кт_Кт_КонтрактПриИзмененииВместо(Элемент)
	УстановитьДоступностьКонтракта();
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("СоглашениеПриИзмененииСервер")
Функция Кт_СоглашениеПриИзмененииСервер(ПересчитыватьЦены)

	КомиссионныеПродажи25 = ПродажиСервер.ЭтоСоглашениеПоНовойКомиссии(Объект.Соглашение);

	ЗаполнитьПараметрыСвязиВидаЦенИПризнакЦенаВключаетНДС();

	ДокументПродажи = РеквизитФормыВЗначение("Объект");
	ЦеныРасчитаны = ДокументПродажи.ЗаполнитьУсловияПродажПоСоглашению(ПересчитыватьЦены);
	ЗначениеВРеквизитФормы(ДокументПродажи, "Объект");

	ПараметрыДоговора = ПараметрыДоговора(Объект.Договор, Объект.ХозяйственнаяОперация);
	Если ПараметрыДоговора.ПоНовойКомиссии Тогда
		Объект.ЦенаВключаетНДС = ПараметрыДоговора.ЦенаВключаетНДС;
	КонецЕсли;

	ВалютаДокумента = Объект.Валюта;

	ХозяйственнаяОперацияПриИзмененииСервер(Ложь);
	СкладПриИзмененииСервер();

	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	ЗаполнитьСлужебныеРеквизитыФормыДокумента();

	ОбновитьДубликатыЗависимыхРеквизитов();
	Объект.БанковскийСчетКонтрагента = ПолучитьБанковскийСчетКонтрагентаПоУмолчаниюСервер(Объект.Контрагент, Объект.БанковскийСчет);
	ДенежныеСредстваСервер.ПроверитьЗаполнитьБанковскийСчетОрганизацииПоВладельцу(Объект.Организация, Объект.БанковскийСчет, , Объект.НаправлениеДеятельности);
	ДенежныеСредстваСервер.ПроверитьЗаполнитьКассуОрганизацииПоВладельцу(Объект.Организация, Объект.Касса, Объект.ФормаОплаты, Объект.НаправлениеДеятельности, Объект.Курьер);

	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);

	ЗаполнитьСписокВыбораОпераций(Ложь);
	ЗаполнитьГруппуФинУчета();
	ОбновитьДоступностьЭлементовВозвратнойТары(ЭтаФорма);

	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("Договор");
	МассивРеквизитов.Добавить("Соглашение");
	ВзаиморасчетыСервер.ФормаПриИзмененииРеквизитов(ЭтотОбъект, МассивРеквизитов);

	ОтветственныеЛицаСервер.ЗаполнитьСписокВыбораМенеджера(Элементы.Менеджер, Объект);
	#Удаление
	ОтветственныеЛицаСервер.УстановитьМенеджера(Объект, Объект.ДокументОснование);
	#КонецУдаления

	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда
		ЗаполнитьДоговорПоУмолчанию();
	Иначе
		ЗаполнитьПодчиненныеСвойстваПоСтатистике("Договор");
	КонецЕсли;

	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Объект);

	ВариантОбеспеченияПоУмолчанию = ВариантОбеспеченияПоУмолчанию();
	ВариантОбеспеченияИФлагОбособленно = ПродажиСервер.ВариантОбеспеченияИФлагОбособленноПоУмолчанию(
	Объект.Соглашение,
	Объект.Статус,
	ВариантОбеспеченияПоУмолчанию,
	Не Объект.ЭтоЗаказКакСчет);

	Если ИспользоватьНаправленияДеятельности Тогда
		НаправленияДеятельностиСервер.ЗаполнитьНаправлениеПоУмолчанию(Объект.НаправлениеДеятельности, Объект.Соглашение, Объект.Договор);
	КонецЕсли;
	НаправленияДеятельностиСервер.ПриИзмененииНаправленияДеятельности(ЭтотОбъект);

	ПодготовитьЗаполнитьУстановитьВидимостьСборкиИДоставки();
	ОбеспечениеВДокументахСервер.ПриИзмененииРеквизитаДокумента(ЭтотОбъект);

	// ЭлектронноеВзаимодействие.ЭлектронноеАктированиеЕИС
	ЭлектронноеАктированиеЕИСУТ.ДоговорПриИзмененииЭлектронноеАктированиеЕИС(ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ЭлектронноеАктированиеЕИС

	Возврат ЦеныРасчитаны;

КонецФункции


&НаКлиенте 
&Вместо ("ТоварыНоменклатураПартнераПриИзменении")
Процедура Кт_ТоварыНоменклатураПартнераПриИзменении(Элемент)
	
	//## Ничего не делаем
	Возврат;
	

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	НоменклатураПартнеровКлиент.УстановитьПараметрыВыбораУпаковки(Элемент.ПараметрыВыбора, ТекущаяСтрока);
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	ОчиститьСообщения();
	ПрименитьОплатуБонуснымиБалламиКлиент(, Истина);

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
	СтруктураДействий.Вставить("ЗаполнитьНоменклатуруПоНоменклатуреПартнера");
	СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение) Тогда
		СтруктураДействий.Вставить("ЗаполнитьУсловияПродаж", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ(Объект));
	Иначе
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияЦеныВСтрокеТЧ(Объект));
	КонецЕсли;
	
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(Объект, Истина));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	СтруктураДействий.Вставить("ЗаполнитьПризнакВариантОформленияПродажи", Новый Структура("Номенклатура", "ВариантОформленияПродажи"));
	СтруктураДействий.Вставить("ЗаполнитьСодержание", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", ТекущаяСтрока.Склад, ПараметрыУказанияСерий));
	
	ДобавитьДействияОбеспеченияНаКлиенте(СтруктураДействий,
		"ВариантОбеспечения,ДоступноВДругихСтроках,СкладОбязателен,ДатаОтгрузкиОбязательна");
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	СкидкиНаценкиЗаполнениеКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
КонецПроцедуры


#КонецОбласти