#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//++ Сухарев Б.В. 17.01.2019

&НаСервере
Функция ПолучитьОтмекуДокументовСервер(ЗаказКлиента)
	
	НужныДокументы = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	_ЗаявкаНаДоставкуЗаказы.Ссылка КАК Ссылка,
	|	_ЗаявкаНаДоставкуЗаказы.ЗаказКлиента КАК ЗаказКлиента,
	|	_ЗаявкаНаДоставкуЗаказы.Ссылка.НужныДокументы КАК НужныДокументы
	|ИЗ
	|	Документ._ЗаявкаНаДоставку.Заказы КАК _ЗаявкаНаДоставкуЗаказы
	|ГДЕ
	|	_ЗаявкаНаДоставкуЗаказы.ЗаказКлиента = &ЗаказКлиента
	|	И _ЗаявкаНаДоставкуЗаказы.Ссылка.НужныДокументы = ИСТИНА";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		НужныДокументы = Истина;
	КонецЕсли;
	
	Возврат НужныДокументы;
	
КонецФункции // ПолучитьОтмекуДокументовСервер()

//== Сухарев Б.В

&ИзменениеИКонтроль("ЗаполнитьОтгружаемыеТоварыПоТоварамПоРаспоряжениям")
Процедура Кт_ЗаполнитьОтгружаемыеТоварыПоТоварамПоРаспоряжениям(Объект)

	Объект.ОтгружаемыеТовары.Очистить();

	Для Каждого СтрТабл Из Объект.ТоварыПоРаспоряжениям Цикл

		НоваяСтрока = Объект.ОтгружаемыеТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТабл);
		НоваяСтрока.КоличествоУпаковок = СтрТабл.Количество;

		Если ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыРасходныхОрдеров", Новый Структура("Склад", Объект.Склад)) Тогда
			НоваяСтрока.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отобрать;
		Иначе
			НоваяСтрока.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
		КонецЕсли;

#Вставка
		//++ Сухарев Б.В. 17.01.2019
		Если ТипЗнч(СтрТабл.Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			Объект._НужныДокументы = ПолучитьОтмекуДокументовСервер(СтрТабл.Распоряжение);
		КонецЕсли;
		//== Сухарев Б.В
#КонецВставки
	КонецЦикла;

	КолонкиСвертки = "Номенклатура, Характеристика, Назначение, Серия, СтатусУказанияСерий, ЭтоУпаковочныйЛист,"
	+ "УпаковочныйЛистРодитель, УпаковочныйЛист, Упаковка, Действие";
	КолонкиСуммы   = "Количество, КоличествоУпаковок";

	Если ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура") Тогда
		ТаблицаДляСвертки = Объект.ОтгружаемыеТовары.Выгрузить(); // ТаблицаЗначений
		ТаблицаДляСвертки.Свернуть(КолонкиСвертки, КолонкиСуммы);
		Объект.ОтгружаемыеТовары.Загрузить(ТаблицаДляСвертки);
	Иначе
		Объект.ОтгружаемыеТовары.Свернуть(КолонкиСвертки, КолонкиСуммы);
	КонецЕсли;

	Объект.ВсегоМест = УпаковочныеЛистыСервер.КоличествоМестВТЧ(Объект.ОтгружаемыеТовары);

КонецПроцедуры

#КонецЕсли