
&После("ОбработкаПроведения")
Процедура Расш1_ОбработкаПроведения(Отказ, РежимПроведения)
	
	//++ Сухарев Б.В. 24.01.2019
	_ОбработкаДоставкиТоваровСервер.ОбновитьСпособДоставкиЗаказаКлинта(ЭтотОбъект);
	//== Сухарев Б.В
	
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура Расш1_ОбработкаУдаленияПроведения(Отказ)
	
	//++ Сухарев Б.В. 24.01.2019
	_ОбработкаДоставкиТоваровСервер.ОбновитьСпособДоставкиЗаказаКлинта(ЭтотОбъект, Истина);
	//== Сухарев Б.В
	
КонецПроцедуры

&ИзменениеИКонтроль("ПередЗаписью")
Процедура Кт_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);

#Удаление
	Если НЕ ПраваПользователяПовтИсп.ВзятиеРасходногоОрдераВРаботу() Тогда

		Если  Статус <> Перечисления.СтатусыРасходныхОрдеров.Подготовлен
			И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда

			ТекстСообщения = СтрШаблон(НСтр("ru = 'Недостаточно прав на взятие расходного ордера в работу. Изменения статуса не выполнено. (%1)'"), Ссылка);
			ВызватьИсключение ТекстСообщения;

		КонецЕсли;

		СтарыйСтатус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Статус");

		Если СтарыйСтатус <> Перечисления.СтатусыРасходныхОрдеров.Подготовлен
			И СтарыйСтатус <> Неопределено Тогда

			ТекстСообщения = СтрШаблон(НСтр("ru = 'Недостаточно прав на изменение статуса расходного ордера, взятого в работу. (%1)'"), Ссылка);
			ВызватьИсключение ТекстСообщения;

		КонецЕсли;

	КонецЕсли;
#КонецУдаления

	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.РасходныйОрдерНаТовары);

	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект, ПараметрыУказанияСерий.ТоварыПоРаспоряжениям);
	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект, ПараметрыУказанияСерий.ОтгружаемыеТовары);

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыРасходныхОрдеров", Новый Структура("Склад", Склад)) Тогда
		Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
	КонецЕсли;

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПроверитьОрдерныйСклад(Отказ);
	КонецЕсли;

	ВсегоМест = УпаковочныеЛистыСервер.КоличествоМестВТЧ(ОтгружаемыеТовары);

КонецПроцедуры
