Функция ПолучитьРазрешениеНаОтгрузку(ДокументОтгрузки, Назначение, Номенклатура, Характеристика)
	//дов
	Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ТоварыКОтгрузке.ДокументОтгрузки КАК ДокументОтгрузки,
	//|	ТоварыКОтгрузке.Назначение КАК Назначение,
	//|	ТоварыКОтгрузке.Номенклатура КАК Номенклатура,
	//|	ТоварыКОтгрузке.Характеристика КАК Характеристика,
	//|	СУММА(ТоварыКОтгрузке.КОтгрузке) КАК КОтгрузке,
	//|	СУММА(ТоварыКОтгрузке.Собрано) КАК Собрано
	//|ИЗ
	//|	РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
	//|ГДЕ
	//|	ТоварыКОтгрузке.ДокументОтгрузки = &ДокументОтгрузки
	//|	И ТоварыКОтгрузке.Номенклатура = &Номенклатура
	//|	И ТоварыКОтгрузке.Характеристика = &Характеристика
	//|	И ТоварыКОтгрузке.Назначение = &Назначение
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТоварыКОтгрузке.ДокументОтгрузки,
	//|	ТоварыКОтгрузке.Назначение,
	//|	ТоварыКОтгрузке.Номенклатура,
	//|	ТоварыКОтгрузке.Характеристика
	//|";    
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ТоварыКОтгрузкеОстатки.Назначение КАК Назначение,
	|	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузкеОстатки.Характеристика КАК Характеристика,
	|	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток КАК КОтгрузке,
	|	ТоварыКОтгрузкеОстатки.СобраноОстаток КАК Собрано
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(
	|			,
	|			ДокументОтгрузки = &ДокументОтгрузки
	|				И Назначение = &Назначение) КАК ТоварыКОтгрузкеОстатки
	|ГДЕ
	|	ТоварыКОтгрузкеОстатки.Номенклатура = &Номенклатура
	|	И ТоварыКОтгрузкеОстатки.Характеристика = &Характеристика";    
	
	
	Запрос.УстановитьПараметр("ДокументОтгрузки", ДокументОтгрузки);
	Запрос.УстановитьПараметр("Назначение", 	  Назначение);
	Запрос.УстановитьПараметр("Номенклатура",	  Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",   Характеристика);
	
	Результат = Запрос.Выполнить();
	Если  НЕ Результат.Пустой() Тогда
		Выборка	  = Результат.Выгрузить()[0];
		Если Выборка.КОтгрузке - Выборка.Собрано = 0 Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ПолучитьРащрешениеНаОтгрузку()

Функция ПолучитьРазрешениеНаПоставку(ДокументПоступления, Назначение, Номенклатура, Характеристика)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыКПоступлению.ДокументПоступления КАК ДокументОтгрузки,
	               |	ТоварыКПоступлению.Назначение КАК Назначение,
	               |	ТоварыКПоступлению.Номенклатура КАК Номенклатура,
	               |	ТоварыКПоступлению.Характеристика КАК Характеристика,
	               |	СУММА(ТоварыКПоступлению.КОформлениюПоступленийПоРаспоряжению) КАК КОтгрузке,
	               |	СУММА(ТоварыКПоступлению.КОформлениюНакладныхПоРаспоряжению) КАК Собрано
	               |ИЗ
	               |	Документ._ЗаявкаНаДоставку.Товары КАК _ЗаявкаНаДоставкуТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПоступлению КАК ТоварыКПоступлению
	               |		ПО _ЗаявкаНаДоставкуТовары.Ссылка.ДокументОснование = ТоварыКПоступлению.ДокументПоступления
	               |			И _ЗаявкаНаДоставкуТовары.Номенклатура = ТоварыКПоступлению.Номенклатура
	               |			И _ЗаявкаНаДоставкуТовары.Характеристика = ТоварыКПоступлению.Характеристика
	               |			И _ЗаявкаНаДоставкуТовары.Склад = ТоварыКПоступлению.Склад
	               |ГДЕ
	               |	ТоварыКПоступлению.ДокументПоступления = &ДокументПоступления
	               |	И ТоварыКПоступлению.Номенклатура = &Номенклатура
	               |	И ТоварыКПоступлению.Характеристика = &Характеристика
	               |	И ТоварыКПоступлению.Назначение = &Назначение
	               |	И _ЗаявкаНаДоставкуТовары.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыКПоступлению.ДокументПоступления,
	               |	ТоварыКПоступлению.Назначение,
	               |	ТоварыКПоступлению.Номенклатура,
	               |	ТоварыКПоступлению.Характеристика";
	
	Запрос.УстановитьПараметр("ДокументПоступления", ДокументПоступления);
	Запрос.УстановитьПараметр("Назначение", 	  	 Назначение);
	Запрос.УстановитьПараметр("Номенклатура",	  	 Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",   	 Характеристика);
	
	Результат = Запрос.Выполнить();
	Если  НЕ Результат.Пустой() Тогда
		Выборка	  = Результат.Выгрузить()[0];
		Если Выборка.КОтгрузке - Выборка.Собрано = 0 Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ПолучитьРазрешениеНаПоставку()


Функция ПолучательОтправитель(ДокОбъект)
	Заполнение = Новый Структура("Партнер,СкладПолучатель,Пункт",0,0,0);
	ЗаполнитьЗначенияСвойств(Заполнение,ДокОбъект);
	Если Заполнение.СкладПолучатель <> 0 Тогда
		Возврат Новый Структура("ИмяПоля,Значение","СкладПолучатель",ДокОбъект.СкладПолучатель);
	ИначеЕсли Заполнение.Пункт <> 0 Тогда
		Возврат Новый Структура("ИмяПоля,Значение","Пункт",ДокОбъект.Пункт);
	ИначеЕсли Заполнение.Партнер <> 0 Тогда
		Возврат Новый Структура("ИмяПоля,Значение","Партнер",ДокОбъект.Партнер);
	Иначе
		ВызватьИсключение НСтр("ru = 'Получатель (отправитель) не определен.'");
	КонецЕсли;
КонецФункции

Процедура СкопироватьСписокЗначений(СписокПриемник, СписокИсточник)
	
	СписокПриемник.Очистить();
	Для Каждого Элемент Из СписокИсточник Цикл
		СписокПриемник.Добавить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДозаполнитьПустыеСвойства(СтруктураПриемник, Источник);
	
	СтруктураЗаполнения = Новый Структура;
	Для Каждого Элемент Из СтруктураПриемник Цикл
		Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
			СтруктураЗаполнения.Вставить(Элемент.Ключ);
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Источник);
	ЗаполнитьЗначенияСвойств(СтруктураПриемник, СтруктураЗаполнения);
	
КонецПроцедуры

Функция СтруктураВыбора()
	
	СтруктураВыбора = Новый Структура;
	СтруктураВыбора.Вставить("АдресДоставки", "");
	СтруктураВыбора.Вставить("АдресДоставкиЗначенияПолей", "");
	СтруктураВыбора.Вставить("ЗонаДоставки", Справочники.ЗоныДоставки.ПустаяСсылка());
	СтруктураВыбора.Вставить("ВремяДоставкиС", Дата(1,1,1));
	СтруктураВыбора.Вставить("ВремяДоставкиПо", Дата(1,1,1));
	СтруктураВыбора.Вставить("ДополнительнаяИнформацияПоДоставке", "");
	
	Возврат СтруктураВыбора;
	
КонецФункции

Функция ПоследниеРеквизитыДоставкиИзРаспоряжений(ОбъектСсылка, ПолучательОтправитель = Неопределено, Перевозчик = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяОбъекта = ОбщегоНазначения.ИмяТаблицыПоСсылке(ОбъектСсылка);
	МетаданныеОбъекта = ОбъектСсылка.Метаданные();
	Если ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ПоручениеЭкспедитору") Тогда
		Возврат ПоследниеРеквизитыПорученийЭкспедиторам(ПолучательОтправитель)
	КонецЕсли;
	
	СвязанныеДокументы = Новый Соответствие;
	СвязанныеДокументы.Вставить("Документ.РеализацияТоваровУслуг", Документы.РеализацияТоваровУслуг.ПустаяСсылка());
	СвязанныеДокументы.Вставить("Документ.ЗаказКлиента", Документы.ЗаказКлиента.ПустаяСсылка());
	СвязанныеДокументы.Вставить("Документ.ЗаявкаНаВозвратТоваровОтКлиента", Документы.ЗаявкаНаВозвратТоваровОтКлиента.ПустаяСсылка());
	
	Если СвязанныеДокументы[ИмяОбъекта] = Неопределено Тогда
		СвязанныеДокументы.Очистить();
		СвязанныеДокументы.Вставить("Документ.ЗаказНаПеремещение", Документы.ЗаказНаПеремещение.ПустаяСсылка());
		СвязанныеДокументы.Вставить("Документ.ПеремещениеТоваров", Документы.ПеремещениеТоваров.ПустаяСсылка());
		
		Если СвязанныеДокументы[ИмяОбъекта] = Неопределено Тогда
			СвязанныеДокументы.Очистить();
			СвязанныеДокументы.Вставить("Документ.ЗаказПоставщику",Документы.ЗаказПоставщику.ПустаяСсылка());
			СвязанныеДокументы.Вставить("Документ.ПриобретениеТоваровУслуг", Документы.ПриобретениеТоваровУслуг.ПустаяСсылка());
			
			Если СвязанныеДокументы[ИмяОбъекта] = Неопределено Тогда
				СвязанныеДокументы.Очистить();
				Если СвязанныеДокументы[ИмяОбъекта] = Неопределено Тогда
					СвязанныеДокументы.Очистить();
					СвязанныеДокументы.Вставить(ИмяОбъекта,ОбъектСсылка);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ШаблонЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 3
	|	ВЫБОР КОГДА Док.СпособДоставки В (&СпособыДоставкиДоМестаПередачи)
	|			И &Перевозчик <> НЕОПРЕДЕЛЕНО
	|		ТОГДА Док.АдресДоставкиПеревозчика
	|		ИНАЧЕ Док.АдресДоставки
	|	КОНЕЦ КАК АдресДоставки,
	|	МАКСИМУМ(Док.Дата) КАК Дата
	|ПОМЕСТИТЬ ВТ_ПоследниеАдреса
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Док
	|ГДЕ
	|	Док.Проведен
	|	И (Док.Партнер = &ПолучательОтправитель
	|		ИЛИ &ПолучательОтправитель = НЕОПРЕДЕЛЕНО)
	|	И (Док.ПеревозчикПартнер = &Перевозчик
	|			И Док.АдресДоставкиПеревозчика <> """"
	|		ИЛИ &Перевозчик = НЕОПРЕДЕЛЕНО
	|			И Док.АдресДоставки <> """")
	|	И Док.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПоставщикаДоНашегоСклада)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР КОГДА Док.СпособДоставки В (&СпособыДоставкиДоМестаПередачи)
	|			И &Перевозчик <> НЕОПРЕДЕЛЕНО
	|		ТОГДА Док.АдресДоставкиПеревозчика
	|		ИНАЧЕ Док.АдресДоставки
	|	КОНЕЦ
	|";
	
	ТекстЗапроса = "";
	
	Для Каждого КлючИЗначение Из СвязанныеДокументы Цикл
		
		ТекстПоДокументу = "";
		
		ИмяДокумента = КлючИЗначение.Ключ;
		
		МетаданныеСвязанногоОбъекта = КлючИЗначение.Значение.Метаданные();
		
		Если МетаданныеСвязанногоОбъекта.Реквизиты.Найти("Партнер") <> Неопределено Тогда
			ИмяПоляПолучатель = "Партнер";
		Иначе
			ИмяПоляПолучатель = "СкладПолучатель";
		КонецЕсли;
		
		Если ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта) Тогда
			ИмяПоляАктуальныйОбъект = "Док.Проведен";
		Иначе
			ИмяПоляАктуальныйОбъект = "НЕ Док.ПометкаУдаления";
		КонецЕсли;
		
		ТекстПоДокументу = СтрЗаменить(ШаблонЗапроса	, "Документ.РеализацияТоваровУслуг"	, ИмяДокумента);
		ТекстПоДокументу = СтрЗаменить(ТекстПоДокументу	, "Док.Проведен"					, ИмяПоляАктуальныйОбъект);
		ТекстПоДокументу = СтрЗаменить(ТекстПоДокументу	, "Док.Партнер"						, "Док." + ИмяПоляПолучатель);
		Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
			ТекстПоДокументу = СтрЗаменить(ТекстПоДокументу,"ПОМЕСТИТЬ ВТ_ПоследниеАдреса", "");
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|" + ТекстПоДокументу;
		Иначе
			ТекстЗапроса = ТекстПоДокументу;
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|УПОРЯДОЧИТЬ ПО
	|	МАКСИМУМ(Док.Дата) УБЫВ
	|;" + "
	|
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ПоследниеАдреса.Ссылка) КАК Ссылка,
	|	ПоследниеАдреса.АдресДоставки
	|ПОМЕСТИТЬ ВТ_СсылкиПоАдресам
	|ИЗ #Текст_ВТ_СсылкиПоАдресам КАК ПоследниеАдреса
	|СГРУППИРОВАТЬ ПО
	|	ПоследниеАдреса.АдресДоставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|" +
	"ВЫБРАТЬ ВТ_СсылкиПоАдресам.Ссылка,ВТ_СсылкиПоАдресам.Ссылка.СпособДоставки,
	|	ВТ_СсылкиПоАдресам.Ссылка.СпособДоставки В (&СпособыДоставкиДоКонечногоПункта),
	|	ВТ_ПоследниеАдреса.АдресДоставки КАК АдресДоставки,
	|	ВЫБОР КОГДА ВТ_СсылкиПоАдресам.Ссылка.СпособДоставки В (&СпособыДоставкиДоМестаПередачи)
	|			И &Перевозчик <> НЕОПРЕДЕЛЕНО
	|		ТОГДА ВТ_СсылкиПоАдресам.Ссылка.АдресДоставкиПеревозчикаЗначенияПолей
	|		ИНАЧЕ ВТ_СсылкиПоАдресам.Ссылка.АдресДоставкиЗначенияПолей
	|	КОНЕЦ КАК АдресДоставкиЗначенияПолей,
	|	ВТ_СсылкиПоАдресам.Ссылка.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
	|	ВЫБОР КОГДА ВТ_СсылкиПоАдресам.Ссылка.СпособДоставки В (&СпособыДоставкиДоКонечногоПункта)
	|			И &Перевозчик = НЕОПРЕДЕЛЕНО
	|		ИЛИ ВТ_СсылкиПоАдресам.Ссылка.СпособДоставки В (&СпособыДоставкиДоМестаПередачи)
	|			И &Перевозчик <> НЕОПРЕДЕЛЕНО
	|		ТОГДА ВТ_СсылкиПоАдресам.Ссылка.ЗонаДоставки
	|		ИНАЧЕ Значение(Справочник.ЗоныДоставки.ПустаяСсылка)
	|	КОНЕЦ КАК ЗонаДоставки,
	|	ВЫБОР КОГДА ВТ_СсылкиПоАдресам.Ссылка.СпособДоставки В (&СпособыДоставкиДоКонечногоПункта)
	|			И &Перевозчик = НЕОПРЕДЕЛЕНО
	|		ИЛИ ВТ_СсылкиПоАдресам.Ссылка.СпособДоставки В (&СпособыДоставкиДоМестаПередачи)
	|			И &Перевозчик <> НЕОПРЕДЕЛЕНО
	|		ТОГДА ВТ_СсылкиПоАдресам.Ссылка.ВремяДоставкиС
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1)
	|	КОНЕЦ КАК ВремяДоставкиС,
	|	ВЫБОР КОГДА ВТ_СсылкиПоАдресам.Ссылка.СпособДоставки В (&СпособыДоставкиДоКонечногоПункта)
	|			И &Перевозчик = НЕОПРЕДЕЛЕНО
	|		ИЛИ ВТ_СсылкиПоАдресам.Ссылка.СпособДоставки В (&СпособыДоставкиДоМестаПередачи)
	|			И &Перевозчик <> НЕОПРЕДЕЛЕНО
	|		ТОГДА ВТ_СсылкиПоАдресам.Ссылка.ВремяДоставкиПо
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1)
	|	КОНЕЦ КАК ВремяДоставкиПо
	|ИЗ
	|	ВТ_ПоследниеАдреса КАК ВТ_ПоследниеАдреса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СсылкиПоАдресам КАК ВТ_СсылкиПоАдресам
	|		ПО (ВТ_СсылкиПоАдресам.АдресДоставки = ВТ_ПоследниеАдреса.АдресДоставки)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ПоследниеАдреса.Дата УБЫВ";
	
	ШаблонЗапроса =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	ВТ_ПоследниеАдреса.АдресДоставки КАК АдресДоставки
	|ИЗ
	|	ВТ_ПоследниеАдреса КАК ВТ_ПоследниеАдреса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Док
	|		ПО ВТ_ПоследниеАдреса.Дата = Док.Дата
	|			И (ВТ_ПоследниеАдреса.АдресДоставки = Док.АдресДоставки
	|				ИЛИ ВТ_ПоследниеАдреса.АдресДоставки = Док.АдресДоставкиПеревозчика)
	|";
	Текст_ВТ_СсылкиПоАдресам = "";
	Для Каждого КлючИЗначение Из СвязанныеДокументы Цикл
		ТекстПоДокументу = "";
		ИмяДокумента = КлючИЗначение.Ключ;
		ТекстПоДокументу = СтрЗаменить(ШаблонЗапроса,"Документ.РеализацияТоваровУслуг", ИмяДокумента);
		Если ЗначениеЗаполнено(Текст_ВТ_СсылкиПоАдресам) Тогда
			Текст_ВТ_СсылкиПоАдресам = Текст_ВТ_СсылкиПоАдресам + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|" + ТекстПоДокументу;
		Иначе
			Текст_ВТ_СсылкиПоАдресам = ТекстПоДокументу;
		КонецЕсли;
	КонецЦикла;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#Текст_ВТ_СсылкиПоАдресам","("+Текст_ВТ_СсылкиПоАдресам+")");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ПолучательОтправитель",ПолучательОтправитель);
	Запрос.УстановитьПараметр("Перевозчик",Перевозчик);
	СпособыДоставкиДоМестаПередачи = Новый Массив;
	СпособыДоставкиДоМестаПередачи.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу);
	СпособыДоставкиДоМестаПередачи.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи);
	Запрос.УстановитьПараметр("СпособыДоставкиДоМестаПередачи",СпособыДоставкиДоМестаПередачи);
	
	СпособыДоставкиДоКонечногоПункта = Новый Массив;
	СпособыДоставкиДоКонечногоПункта.Добавить(Перечисления.СпособыДоставки.ДоКлиента);
	СпособыДоставкиДоКонечногоПункта.Добавить(Перечисления.СпособыДоставки.НашимиСиламиСАдресаОтправителя);
	СпособыДоставкиДоКонечногоПункта.Добавить(Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки);
	СпособыДоставкиДоКонечногоПункта.Добавить(Перечисления.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки);
	Запрос.УстановитьПараметр("СпособыДоставкиДоКонечногоПункта",СпособыДоставкиДоКонечногоПункта);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция ПоследниеРеквизитыПорученийЭкспедиторам(ПолучательОтправитель)
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 3
	|	Док.АдресДоставки,
	|	МАКСИМУМ(Док.Дата) КАК Дата
	|ПОМЕСТИТЬ ВТ_ПоследниеАдреса
	|ИЗ
	|	Документ.ПоручениеЭкспедитору КАК Док
	|ГДЕ
	|	Док.Проведен
	|	И Док.Пункт = &ПолучательОтправитель
	|
	|СГРУППИРОВАТЬ ПО
	|	Док.АдресДоставки
	|
	|УПОРЯДОЧИТЬ ПО
	|	МАКСИМУМ(Док.Дата) УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Док.Ссылка) КАК Ссылка,
	|	ВТ_ПоследниеАдреса.АдресДоставки
	|ПОМЕСТИТЬ ВТ_СсылкиПоАдресам
	|ИЗ
	|	ВТ_ПоследниеАдреса КАК ВТ_ПоследниеАдреса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоручениеЭкспедитору КАК Док
	|		ПО ВТ_ПоследниеАдреса.Дата = Док.Дата
	|			И ВТ_ПоследниеАдреса.АдресДоставки = Док.АдресДоставки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоследниеАдреса.АдресДоставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоследниеАдреса.АдресДоставки КАК АдресДоставки,
	|	ВТ_СсылкиПоАдресам.Ссылка.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	ВТ_СсылкиПоАдресам.Ссылка.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
	|	ВТ_СсылкиПоАдресам.Ссылка.ЗонаДоставки КАК ЗонаДоставки,
	|	ВТ_СсылкиПоАдресам.Ссылка.ВремяДоставкиС КАК ВремяДоставкиС,
	|	ВТ_СсылкиПоАдресам.Ссылка.ВремяДоставкиПо КАК ВремяДоставкиПо
	|ИЗ
	|	ВТ_ПоследниеАдреса КАК ВТ_ПоследниеАдреса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СсылкиПоАдресам КАК ВТ_СсылкиПоАдресам
	|		ПО (ВТ_СсылкиПоАдресам.АдресДоставки = ВТ_ПоследниеАдреса.АдресДоставки)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ПоследниеАдреса.Дата УБЫВ";
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ПолучательОтправитель",ПолучательОтправитель);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция АдресаПолучателяИзКонтактнойИнформации(ПолучательОтправитель)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК АдресДоставки,
	|	КонтактнаяИнформация.Вид.Представление КАК Вид,
	|	КонтактнаяИнформация.ЗначенияПолей КАК АдресДоставкиЗначенияПолей
	|ИЗ
	|	Справочник." + ПолучательОтправитель.Метаданные().Имя + ".КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &ПолучательОтправитель
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)");
	
	Запрос.УстановитьПараметр("ПолучательОтправитель", ПолучательОтправитель);
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьСписокВыбораАдресовПеревозчика(ЭлементыФормы, ДокОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЭлементыФормы.Найти("АдресДоставкиПеревозчика") <> Неопределено Тогда
		ИмяЭлементаАдрес = "АдресДоставкиПеревозчика";
	Иначе
		Возврат;
	КонецЕсли;
	
	ПеревозчикПартнер = ДокОбъект.ПеревозчикПартнер;
	
	Если Не ЗначениеЗаполнено(ПеревозчикПартнер) Тогда
		ЭлементыФормы[ИмяЭлементаАдрес].СписокВыбора.Очистить();
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Новый СписокЗначений;
	
	ПолучательОтправитель = ПолучательОтправитель(ДокОбъект).Значение;
	ПоследниеРеквизитыДоставкиИзЗаданий = ДоставкаТоваров.ПоследниеРеквизитыДоставкиИзЗаданий(ПолучательОтправитель,ПеревозчикПартнер);
	// Получим последние использованные реквизиты доставки перевозчика по получателю
	Для Каждого Стр Из ПоследниеРеквизитыДоставкиИзЗаданий Цикл
		СтруктураВыбора = СтруктураВыбора();
		ЗаполнитьЗначенияСвойств(СтруктураВыбора, Стр);
		СписокВыбора.Добавить(СтруктураВыбора,Стр.АдресДоставки);
	КонецЦикла;
	
	Если СписокВыбора.Количество() < 3 Тогда
		ПоследниеРеквизитыДоставкиИзЗаданий = ДоставкаТоваров.ПоследниеРеквизитыДоставкиИзЗаданий(,ПеревозчикПартнер);
		// Если список не полный, попытаемся дополнить его, устранив ограничение по получателю.
		Для Каждого Стр Из ПоследниеРеквизитыДоставкиИзЗаданий Цикл
			НайденныйЭлементСЗ = ДоставкаТоваровКлиентСервер.НайтиВСпискеСтруктур(СписокВыбора,"АдресДоставки",Стр.АдресДоставки);
			Если НайденныйЭлементСЗ = Неопределено Тогда
				СтруктураВыбора = СтруктураВыбора();
				ЗаполнитьЗначенияСвойств(СтруктураВыбора, Стр);
				СписокВыбора.Добавить(СтруктураВыбора, Стр.АдресДоставки);
			Иначе
				ДозаполнитьПустыеСвойства(НайденныйЭлементСЗ.Значение, Стр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если СписокВыбора.Количество() < 5 Тогда
		ПоследниеРеквизитыДоставкиИзРаспоряжений = ПоследниеРеквизитыДоставкиИзРаспоряжений(ДокОбъект.Ссылка, , ПеревозчикПартнер);
		Для Каждого Стр Из ПоследниеРеквизитыДоставкиИзРаспоряжений Цикл
			НайденныйЭлементСЗ = ДоставкаТоваровКлиентСервер.НайтиВСпискеСтруктур(СписокВыбора,"АдресДоставки",Стр.АдресДоставки);
			Если НайденныйЭлементСЗ = Неопределено Тогда
				СтруктураВыбора = СтруктураВыбора();
				ЗаполнитьЗначенияСвойств(СтруктураВыбора, Стр);
				СписокВыбора.Добавить(СтруктураВыбора, Стр.АдресДоставки);
			Иначе
				ДозаполнитьПустыеСвойства(НайденныйЭлементСЗ.Значение, Стр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	АдресаПолучателяИзКонтактнойИнформации = АдресаПолучателяИзКонтактнойИнформации(ПеревозчикПартнер);
	Для Каждого Стр Из АдресаПолучателяИзКонтактнойИнформации Цикл
		НайденныйЭлементСЗ = ДоставкаТоваровКлиентСервер.НайтиВСпискеСтруктур(СписокВыбора,"АдресДоставки",Стр.АдресДоставки);
		Если НайденныйЭлементСЗ = Неопределено Тогда
			СтруктураВыбора = СтруктураВыбора();
			ЗаполнитьЗначенияСвойств(СтруктураВыбора, Стр);
			СписокВыбора.Добавить(СтруктураВыбора, Стр.Вид + ": " + Стр.АдресДоставки);
		ИначеЕсли Не ЗначениеЗаполнено(НайденныйЭлементСЗ.Значение.АдресДоставкиЗначенияПолей) Тогда
			НайденныйЭлементСЗ.Значение.АдресДоставкиЗначенияПолей = Стр.АдресДоставкиЗначенияПолей;
		КонецЕсли;
	КонецЦикла;
	
	СкопироватьСписокЗначений(ЭлементыФормы[ИмяЭлементаАдрес].СписокВыбора, СписокВыбора)
	
КонецПроцедуры

Функция ПолучитьПозициюДляВставки(РаспоряженияНаДоставку, ЗонаГруппаИлиПустая, СтрокаИсточник)
	
	Адрес = СтрокаИсточник.Адрес;
	КоллекцияРаспоряжений = РаспоряженияНаДоставку.ПолучитьЭлементы();
	Если ЗонаГруппаИлиПустая Тогда
		Для Каждого СтрокаЗона Из КоллекцияРаспоряжений Цикл
			Если СтрокаИсточник.Зона = СтрокаЗона.Зона Тогда
				Ветка = СтрокаЗона.ПолучитьЭлементы();
				Для Каждого СтрокаРаспоряжение Из Ветка Цикл
					Если Адрес < СтрокаРаспоряжение.Адрес Тогда
						Возврат Новый Структура("Зона, Распоряжение", КоллекцияРаспоряжений.Индекс(СтрокаЗона), Ветка.Индекс(СтрокаРаспоряжение));
					КонецЕсли;
				КонецЦикла;
				Возврат Новый Структура("Зона, Распоряжение", КоллекцияРаспоряжений.Индекс(СтрокаЗона), Макс(0,Ветка.Количество()));
			ИначеЕсли Строка(СтрокаИсточник.Зона) < Строка(СтрокаЗона.Зона) Тогда
				НоваяСтрока = КоллекцияРаспоряжений.Вставить(КоллекцияРаспоряжений.Индекс(СтрокаЗона));
				НоваяСтрока.Зона  = СтрокаИсточник.Зона;
				НоваяСтрока.Адрес = СтрокаИсточник.Зона;
				НоваяСтрока.ОформлениеСтроки = 5;
				Возврат Новый Структура("Зона, Распоряжение", КоллекцияРаспоряжений.Индекс(НоваяСтрока), 0);
			КонецЕсли;
		КонецЦикла;
		НоваяСтрока = КоллекцияРаспоряжений.Добавить();
		НоваяСтрока.Зона  = СтрокаИсточник.Зона;
		НоваяСтрока.Адрес = СтрокаИсточник.Зона;
		НоваяСтрока.ОформлениеСтроки = 5;
		Возврат Новый Структура("Зона, Распоряжение", КоллекцияРаспоряжений.Количество() - 1, 0);
	Иначе
		Для Каждого СтрокаРаспоряжение Из КоллекцияРаспоряжений Цикл
			Если Адрес < СтрокаРаспоряжение.Адрес Тогда
				Возврат Новый Структура("Зона, Распоряжение", 0, КоллекцияРаспоряжений.Индекс(СтрокаРаспоряжение));
			КонецЕсли;
		КонецЦикла;
		Возврат Новый Структура("Зона, Распоряжение", 0, КоллекцияРаспоряжений.Количество());
	КонецЕсли;
	
КонецФункции

Функция РеквизитыДоставки(ДокОбъект)
	
	ПолучательОтправитель = ПолучательОтправитель(ДокОбъект);
	РеквизитыДоставки = ДоставкаТоваровКлиентСервер.ПолучитьПустуюСтруктуруРеквизитовДоставки(ДокОбъект);
	РеквизитыДоставки.Вставить(ПолучательОтправитель.ИмяПоля, ПолучательОтправитель.Значение);
	РеквизитыДоставки.Вставить("Ссылка");
	ЗаполнитьЗначенияСвойств(РеквизитыДоставки, ДокОбъект);
	РеквизитыДоставки.Вставить("ПолучательОтправитель", ПолучательОтправитель);
	
	Возврат РеквизитыДоставки;
	
КонецФункции

Процедура ЗаполнитьРеквизитыПоПеревозчику(ЭлементыФормы, ДокОбъект, ДопИнфоИзмененоПользователем = Ложь)
	
	ПустыеРеквизиты = ДоставкаТоваровКлиентСервер.ПолучитьПустуюСтруктуруРеквизитовДоставки(ДокОбъект);
	
	ЗаполнитьЗначенияСвойств(ДокОбъект, ПустыеРеквизиты,
	"АдресДоставкиПеревозчика, АдресДоставкиПеревозчикаЗначенияПолей, ЗонаДоставки, ВремяДоставкиС, ВремяДоставкиПо");
	Если Не ДопИнфоИзмененоПользователем Тогда
		ДокОбъект.ДополнительнаяИнформацияПоДоставке = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокОбъект.ПеревозчикПартнер)
		И ЭлементыФормы.АдресДоставкиПеревозчика.СписокВыбора.Количество() > 0 Тогда
		ПерваяСтруктураВСписке = ЭлементыФормы.АдресДоставкиПеревозчика.СписокВыбора[0].Значение;
		ЗаполнитьЗначенияСвойств(ДокОбъект,ПерваяСтруктураВСписке,
		"ЗонаДоставки, ВремяДоставкиС, ВремяДоставкиПо");
		ДокОбъект.АдресДоставкиПеревозчика = ПерваяСтруктураВСписке.АдресДоставки;
		ДокОбъект.АдресДоставкиПеревозчикаЗначенияПолей = ПерваяСтруктураВСписке.АдресДоставкиЗначенияПолей;
		Если Не ДопИнфоИзмененоПользователем Тогда
			ДокОбъект.ДополнительнаяИнформацияПоДоставке = ПерваяСтруктураВСписке.ДополнительнаяИнформацияПоДоставке;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры



// Перезаполняет реквизиты доставки при изменении реквизиты формы
// Параметры:
//		ЭлементыФормы - ВсеЭлементыФормы - все элементы формы, в которой производятся изменения,
//		ДокОбъект - ДанныеФормыСтруктура - объект, реквизиты которого используются при заполнении.
//
Процедура ПриИзмененииПеревозчика(ЭлементыФормы, ДокОбъект)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеДоставкой") Тогда
		Возврат
	КонецЕсли;
	
	Если (ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу
		Или ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи) Тогда
		
		ДопИнфоИзмененоПользователем = ДоставкаТоваровКлиентСервер.ДопИнфоИзмененоПользователем(ЭлементыФормы, ДокОбъект);
		ЗаполнитьСписокВыбораАдресовПеревозчика(ЭлементыФормы, ДокОбъект);
		ЗаполнитьРеквизитыПоПеревозчику(ЭлементыФормы, ДокОбъект, ДопИнфоИзмененоПользователем);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДополнитьТекстРаспоряжениемИДопИнфо(Знач ДопИнфоИзменяемое, ДопИнфоДляДобавления, Распоряжение)
	
	Результат = ДопИнфоИзменяемое;
	
	Если Не ПустаяСтрока(ДопИнфоДляДобавления) Тогда
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Распоряжение, "Номер, Дата");
		ТекстДопИнфо = НСтр("ru = '%Распоряжение% %Номер% от %Дата%: %ДопИнфо%'");
		
		ТекстДопИнфо = СтрЗаменить(ТекстДопИнфо,"%Распоряжение%",Строка(ТипЗнч(Распоряжение)));
		ТекстДопИнфо = СтрЗаменить(ТекстДопИнфо,"%Номер%",
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер));
		ТекстДопИнфо = СтрЗаменить(ТекстДопИнфо, "%Дата%", Формат(Реквизиты.Дата,"ДФ=dd.MM.yy"));
		ТекстДопИнфо = СтрЗаменить(ТекстДопИнфо, "%ДопИнфо%", ДопИнфоДляДобавления);
		
		Если СтрНайти(ДопИнфоИзменяемое, ТекстДопИнфо) = 0 Тогда
			Результат = Результат + ?(ЗначениеЗаполнено(Результат), Символы.ПС, "") + ТекстДопИнфо;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ОсобыеУсловияПеревозкиУстановитьДоступность(ЭлементыФормы, ДокОбъект)
	
	Если ЭлементыФормы.Найти("ОсобыеУсловияПеревозкиОписание") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОсобыеУсловияПеревозки = ДокОбъект.ОсобыеУсловияПеревозки;
	ЭлементыФормы.ОсобыеУсловияПеревозкиОписание.Доступность = ОсобыеУсловияПеревозки;
	Если ЭлементыФормы.Найти("ОсобыеУсловияПеревозкиОписание1") <> Неопределено Тогда
		ЭлементыФормы.ОсобыеУсловияПеревозкиОписание1.Доступность = ОсобыеУсловияПеревозки;
	КонецЕсли;
	Если ЭлементыФормы.Найти("ОсобыеУсловияПеревозкиОписание2") <> Неопределено Тогда
		ЭлементыФормы.ОсобыеУсловияПеревозкиОписание2.Доступность = ОсобыеУсловияПеревозки;
	КонецЕсли;
	Если ЭлементыФормы.Найти("ОсобыеУсловияПеревозкиОписаниеДоставкаПеревозчиком") <> Неопределено Тогда
		ЭлементыФормы.ОсобыеУсловияПеревозкиОписаниеДоставкаПеревозчиком.Доступность = ОсобыеУсловияПеревозки;
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаРаспоряженияНаДоставку(ВыборочноеОбновление, ЕстьОрдерныйСклад, ЕстьНеОрдерныйСклад, ДоставкаПолучателям)
	
	Если ВыборочноеОбновление Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ОбновляемыеРаспоряжения.Распоряжение,
		|	ОбновляемыеРаспоряжения.Склад
		|ПОМЕСТИТЬ ОбновляемыеРаспоряжения
		|ИЗ
		|	&ОбновляемыеРаспоряжения КАК ОбновляемыеРаспоряжения";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО КАК Распоряжение,
		|	НЕОПРЕДЕЛЕНО КАК Склад
		|ПОМЕСТИТЬ ОбновляемыеРаспоряжения";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
		ТекстЗапросаВтРаспоряженияНаДоставку(ДоставкаПолучателям);
	
	ШаблонВыборкаДвиженийКРаспределению = ?(ДоставкаПолучателям,
	"ВЫБРАТЬ
	|	ТаблицыИсточника.Склад                  КАК Склад,
	|	ТаблицыИсточника.Распоряжение           КАК Распоряжение,
	|	ТаблицыИсточника.ПолучательОтправитель  КАК ПолучательОтправитель,
	|	ТаблицыИсточника.СпособДоставки         КАК СпособДоставки,
	|	ТаблицыИсточника.Зона                   КАК Зона,
	|	ТаблицыИсточника.Перевозчик             КАК Перевозчик,
	|	ТаблицыИсточника.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ТаблицыИсточника.Номенклатура           КАК Номенклатура,
	|	ТаблицыИсточника.Характеристика         КАК Характеристика,
	|	ТаблицыИсточника.Назначение             КАК Назначение,
	|	ТаблицыИсточника.Серия                  КАК Серия,
	|	ТаблицыИсточника.Количество             КАК Количество
	|ИЗ
	|	ИмяТаблицыИсточника КАК ТаблицыИсточника",
	"ВЫБРАТЬ
	|	ТаблицыИсточника.Период         КАК Период,
	|	ТаблицыИсточника.Распоряжение   КАК Распоряжение,
	|	ТаблицыИсточника.Номенклатура   КАК Номенклатура,
	|	ТаблицыИсточника.Характеристика КАК Характеристика,
	|	ТаблицыИсточника.Назначение     КАК Назначение,
	|	ТаблицыИсточника.Склад          КАК Склад,
	|	ТаблицыИсточника.Количество     КАК Количество,
	|	ТаблицыИсточника.Вес            КАК Вес,
	|	ТаблицыИсточника.Объем          КАК Объем
	|ИЗ
	|	ИмяТаблицыИсточника КАК ТаблицыИсточника");
	
	ШаблонВыборкаРаспоряжений = 
	"ВЫБРАТЬ
	|	ТаблицыИсточника.Дата                   КАК Дата,
	|	ТаблицыИсточника.Номенклатура           КАК Номенклатура,
	|	ТаблицыИсточника.МернаяЕдиницаИзмерения КАК МернаяЕдиницаИзмерения,
	|	ТаблицыИсточника.Характеристика         КАК Характеристика,
	|	ТаблицыИсточника.Назначение             КАК Назначение,
	|	ТаблицыИсточника.Серия                  КАК Серия,
	|	ТаблицыИсточника.Количество             КАК Количество,
	|	ТаблицыИсточника.Вес                    КАК Вес,
	|	ТаблицыИсточника.Объем                  КАК Объем,
	|	ТаблицыИсточника.Склад                  КАК Склад,
	|	ТаблицыИсточника.Распоряжение           КАК Распоряжение,
	|	ТаблицыИсточника.ПолучательОтправитель  КАК ПолучательОтправитель,
	|	ТаблицыИсточника.ВидРаспоряжения        КАК ВидРаспоряжения,
	|	ТаблицыИсточника.Номер                  КАК Номер,
	|	ТаблицыИсточника.Адрес                  КАК Адрес,
	|	ТаблицыИсточника.АдресЗначенияПолей     КАК АдресЗначенияПолей,
	|	ТаблицыИсточника.СпособДоставки         КАК СпособДоставки,
	|	ТаблицыИсточника.Картинка               КАК Картинка,
	|	ТаблицыИсточника.Зона                   КАК Зона,
	|	ТаблицыИсточника.ЗонаПредставление      КАК ЗонаПредставление,
	|	ТаблицыИсточника.Перевозчик             КАК Перевозчик,
	|	ТаблицыИсточника.ВремяС                 КАК ВремяС,
	|	ТаблицыИсточника.ВремяПо                КАК ВремяПо,
	|	ТаблицыИсточника.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	ТаблицыИсточника.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ТаблицыИсточника.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	ТаблицыИсточника.ПолеУпорядочивания     КАК ПолеУпорядочивания
	|ИЗ
	|	ИмяТаблицыИсточника КАК ТаблицыИсточника";
	
	ТекстИсточникиДвиженийКРаспределению = "";
	ТекстИсточникиРаспоряжений = "";
	
	Если ЕстьОрдерныйСклад Тогда
		
		ТекстЗапроса = ТекстЗапроса
			+ ОбщегоНазначения.РазделительПакетаЗапросов()
			+ ?(ДоставкаПолучателям,
				ТекстЗапросаРаспоряженияНаДоставкуПолучателямПоОрдернойСхеме(),
				ТекстЗапросаРаспоряженияНаДоставкуОтОтправителейПоОрдернойСхеме());
		
		ИмяТаблицыКРаспределению = "ВтДвиженияКРаспределениюПоОрдернойСхеме";
		ИмяТаблицыРаспоряжений = ?(ДоставкаПолучателям,
			"ВтРаспоряженияНаДоставкуПолучателямПоОрдернойСхеме",
			"ВтРаспоряженияНаДоставкуОтОтправителейПоОрдернойСхеме");
		
		ТекстИсточникДвиженийКРаспределению = СтрЗаменить(ШаблонВыборкаДвиженийКРаспределению,
			"ИмяТаблицыИсточника",
			ИмяТаблицыКРаспределению);
		ТекстИсточникРаспоряжений = СтрЗаменить(ШаблонВыборкаРаспоряжений,
			"ИмяТаблицыИсточника",
			ИмяТаблицыРаспоряжений);
		
		ТекстИсточникиДвиженийКРаспределению = ТекстИсточникДвиженийКРаспределению;
		ТекстИсточникиРаспоряжений = ТекстИсточникРаспоряжений;
		
	КонецЕсли;
	
	Если ЕстьНеОрдерныйСклад Тогда
		ТекстЗапроса = ТекстЗапроса
			+ ОбщегоНазначения.РазделительПакетаЗапросов()
			+ ?(ДоставкаПолучателям,
				ТекстЗапросаРаспоряженияНаДоставкуПолучателямБезОрдернойСхемы(),
				ТекстЗапросаРаспоряженияНаДоставкуОтОтправителейБезОрдернойСхемы());
		
		ИмяТаблицыКРаспределению = "ВтДвиженияКРаспределениюБезОрдернойСхемы";
		ИмяТаблицыРаспоряжений = ?(ДоставкаПолучателям,
			"ВтРаспоряженияНаДоставкуПолучателямБезОрдернойСхемы",
			"ВтРаспоряженияНаДоставкуОтОтправителейБезОрдернойСхемы");
		
		ТекстИсточникДвиженийКРаспределению = СтрЗаменить(ШаблонВыборкаДвиженийКРаспределению,
			"ИмяТаблицыИсточника",
			ИмяТаблицыКРаспределению);
		ТекстИсточникРаспоряжений = СтрЗаменить(ШаблонВыборкаРаспоряжений,
			"ИмяТаблицыИсточника",
			ИмяТаблицыРаспоряжений);
		
		ТекстИсточникиДвиженийКРаспределению = ?(ПустаяСтрока(ТекстИсточникиДвиженийКРаспределению),
			ТекстИсточникДвиженийКРаспределению,
			ТекстИсточникиДвиженийКРаспределению
			+ "
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|"
			+ ТекстИсточникДвиженийКРаспределению);
		
		ТекстИсточникиРаспоряжений = ?(ПустаяСтрока(ТекстИсточникиРаспоряжений),
			ТекстИсточникРаспоряжений,
			ТекстИсточникиРаспоряжений
			+ "
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|"
			+ ТекстИсточникРаспоряжений);
		
	КонецЕсли;
	
	ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению = 
		СтрЗаменить(ШаблонВыборкаДвиженийКРаспределению,
			"ИмяТаблицыИсточника",
			"("
			+ ТекстИсточникиДвиженийКРаспределению
			+ ")");
			
	Если Не ДоставкаПолучателям Тогда
		ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению = ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению
			+
			"
			|УПОРЯДОЧИТЬ ПО
			|	ТаблицыИсточника.Период";
	КонецЕсли;
	
	ФинальныйТекстЗапросаИсточникиРаспоряжений = 
		СтрЗаменить(ШаблонВыборкаРаспоряжений,
			"ИмяТаблицыИсточника",
			"("
			+ ТекстИсточникиРаспоряжений
			+ ")");
	
	ТекстЗапросаУпорядочивание = "";
	Если Не ДоставкаПолучателям
		И ЕстьОрдерныйСклад Тогда
		ТекстЗапросаУпорядочивание = 
		"
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицыИсточника.ЗонаПредставление,
		|	ТаблицыИсточника.Зона,
		|	ТаблицыИсточника.Распоряжение,
		|	ТаблицыИсточника.Склад,
		|	ТаблицыИсточника.Номенклатура,
		|	ТаблицыИсточника.Характеристика,
		|	ТаблицыИсточника.Назначение,
		|	ТаблицыИсточника.Серия,
		|	ТаблицыИсточника.Дата";
	Иначе
		ТекстЗапросаУпорядочивание = 
		"
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицыИсточника.ЗонаПредставление,
		|	ТаблицыИсточника.Зона,
		|	ТаблицыИсточника.ПолеУпорядочивания,
		|	ТаблицыИсточника.ПолучательОтправитель,
		|	ТаблицыИсточника.Распоряжение,
		|	ТаблицыИсточника.Склад,
		|	ТаблицыИсточника.Номенклатура,
		|	ТаблицыИсточника.Характеристика,
		|	ТаблицыИсточника.Назначение,
		|	ТаблицыИсточника.Серия,
		|	ТаблицыИсточника.Дата";
	КонецЕсли;
	
	ФинальныйТекстЗапросаИсточникиРаспоряжений = ФинальныйТекстЗапросаИсточникиРаспоряжений
		+ ТекстЗапросаУпорядочивание;
	
	ТекстЗапроса = ТекстЗапроса
		+ ОбщегоНазначения.РазделительПакетаЗапросов()
		+ ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению
		+ ОбщегоНазначения.РазделительПакетаЗапросов()
		+ ФинальныйТекстЗапросаИсточникиРаспоряжений;
	
	Если Не ВыборочноеОбновление Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения",
		"ЛЕВОЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаВесУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки("СправочникНоменклатура.ЕдиницаИзмерения", "СправочникНоменклатура"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаОбъемУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки("СправочникНоменклатура.ЕдиницаИзмерения", "СправочникНоменклатура"));
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтРаспоряженияНаДоставку(ДоставкаПолучателям)
	
	ТекстЗапроса = "";
	
	Если ДоставкаПолучателям Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РаспоряженияНаДоставку.Распоряжение КАК Распоряжение,
		|	РаспоряженияНаДоставку.Склад КАК Склад,
		|	(РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
		|		И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДатаСеанса) КАК ЭтоОрдерныйСклад,
		|	РаспоряженияНаДоставку.ПолучательОтправитель,
		|	РаспоряженияНаДоставку.СпособДоставки,
		|	РаспоряженияНаДоставку.Зона,
		|	РаспоряженияНаДоставку.Перевозчик,
		|	РаспоряженияНаДоставку.Дата,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
		|ПОМЕСТИТЬ РаспоряженияНаДоставку
		|ИЗ
		|	РегистрСведений.СостоянияИРеквизитыДоставки КАК РаспоряженияНаДоставку
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
		|		ПО (ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
		|			И (ТоварыКДоставке.Склад = РаспоряженияНаДоставку.Склад)
		|			И (ТоварыКДоставке.ВсеТовары)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения КАК ОбновляемыеРаспоряжения
		|		ПО РаспоряженияНаДоставку.Распоряжение = ОбновляемыеРаспоряжения.Распоряжение
		|			И РаспоряженияНаДоставку.Склад = ОбновляемыеРаспоряжения.Склад
		|ГДЕ
		|	(ТоварыКДоставке.Распоряжение ЕСТЬ NULL
		|			ИЛИ ТоварыКДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПодбор
		|			ИЛИ НЕ ТоварыКДоставке.ЗаданиеНаПеревозку.Проведен)
		|	И РаспоряженияНаДоставку.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДоставки.ТребуетсяДоставка)
		|	И ВЫБОР
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.НашаТранспортнаяСлужба)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиКПолучателю)
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомКПолучателю)
		|			ИНАЧЕ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиКПолучателю)
		|					ИЛИ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомКПолучателю)
		|		КОНЕЦ
		|	И (&БезОтбораПоЗоне
		|			ИЛИ РаспоряженияНаДоставку.Зона В ИЕРАРХИИ (&Зона))
		|	И (РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
		|			ИЛИ РаспоряженияНаДоставку.Склад В ИЕРАРХИИ (&Склад))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РаспоряженияНаДоставку.Распоряжение,
		|	РаспоряженияНаДоставку.Склад,
		|	(РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
		|		И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДатаСеанса) КАК ЭтоОрдерныйСклад,
		|	РаспоряженияНаДоставку.ПолучательОтправитель,
		|	РаспоряженияНаДоставку.СпособДоставки,
		|	РаспоряженияНаДоставку.Зона,
		|	РаспоряженияНаДоставку.Перевозчик,
		|	РаспоряженияНаДоставку.Дата,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
		|ИЗ
		|	РегистрСведений.СостоянияИРеквизитыДоставки КАК РаспоряженияНаДоставку
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК РаспоряженияЗадания
		|		ПО (РаспоряженияЗадания.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
		|			И (РаспоряженияЗадания.Склад = РаспоряженияНаДоставку.Склад)
		|			И (РаспоряженияЗадания.Ссылка = &ЗаданиеНаПеревозкуПодбор)                                                                                         
		|			И (РаспоряженияНаДоставку.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияДоставки.ТребуетсяДоставка))
		|ГДЕ
		|	(&БезОтбораПоЗоне
		|			ИЛИ РаспоряженияНаДоставку.Зона В ИЕРАРХИИ (&Зона))
		|	И (РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
		|			ИЛИ РаспоряженияНаДоставку.Склад В ИЕРАРХИИ (&Склад))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Распоряжение,
		|	Склад";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РаспоряженияНаДоставку.Распоряжение КАК Распоряжение,
		|	РаспоряженияНаДоставку.Склад КАК Склад,
		|	(РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|		И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриПоступлении <= &ТекущаяДатаСеанса) КАК ЭтоОрдерныйСклад,
		|	РаспоряженияНаДоставку.ПолучательОтправитель,
		|	ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) КАК ВидРаспоряжения,
		|	РаспоряженияНаДоставку.Номер КАК Номер,
		|	РаспоряженияНаДоставку.Дата КАК Дата,
		|	РаспоряженияНаДоставку.Адрес КАК Адрес,
		|	РаспоряженияНаДоставку.АдресЗначенияПолей КАК АдресЗначенияПолей,
		|	РаспоряженияНаДоставку.СпособДоставки КАК СпособДоставки,
		|	РаспоряженияНаДоставку.Зона КАК Зона,
		|	РаспоряженияНаДоставку.Перевозчик КАК Перевозчик,
		|	РаспоряженияНаДоставку.ВремяС КАК ВремяС,
		|	РаспоряженияНаДоставку.ВремяПо КАК ВремяПо,
		|	РаспоряженияНаДоставку.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
		|	ВЫБОР
		|		КОГДА РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада)
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(РаспоряженияНаДоставку.Перевозчик)
		|		ИНАЧЕ РаспоряженияНаДоставку.Адрес
		|	КОНЕЦ КАК ПолеУпорядочения
		|ПОМЕСТИТЬ РаспоряженияНаДоставку
		|ИЗ
		|	РегистрСведений.СостоянияИРеквизитыДоставки КАК РаспоряженияНаДоставку
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
		|		ПО (ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
		|			И (ТоварыКДоставке.Склад = РаспоряженияНаДоставку.Склад)
		|			И (ТоварыКДоставке.ВсеТовары)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения КАК ОбновляемыеРаспоряжения
		|		ПО РаспоряженияНаДоставку.Распоряжение = ОбновляемыеРаспоряжения.Распоряжение
		|			И РаспоряженияНаДоставку.Склад = ОбновляемыеРаспоряжения.Склад
		|ГДЕ
		|	(ТоварыКДоставке.Распоряжение ЕСТЬ NULL
		|			ИЛИ ТоварыКДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПодбор
		|			ИЛИ НЕ ТоварыКДоставке.ЗаданиеНаПеревозку.Проведен)
		|	И РаспоряженияНаДоставку.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДоставки.ТребуетсяДоставка)
		|	И ВЫБОР
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.НашаТранспортнаяСлужба)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиОтОтправителя)
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомОтОтправителя)
		|			ИНАЧЕ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиОтОтправителя)
		|					ИЛИ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомОтОтправителя)
		|		КОНЕЦ
		|	И (&БезОтбораПоЗоне
		|			ИЛИ РаспоряженияНаДоставку.Зона В ИЕРАРХИИ (&Зона))
		|	И (РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
		|			ИЛИ РаспоряженияНаДоставку.Склад В ИЕРАРХИИ (&Склад))
		|	И (НЕ (РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|			И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриПоступлении <= &ТекущаяДатаСеанса)
		|		ИЛИ (НЕ РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.СоглашенияСПоставщиками
		|			 И НЕ РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.ДоговорыКонтрагентов)
		|		)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РаспоряженияНаДоставку.Распоряжение КАК Распоряжение,
		|	РаспоряженияНаДоставку.Склад КАК Склад,
		|	(РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|		И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриПоступлении <= &ТекущаяДатаСеанса) КАК ЭтоОрдерныйСклад,
		|	РаспоряженияНаДоставку.ПолучательОтправитель,
		|	ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) КАК ВидРаспоряжения,
		|	РаспоряженияНаДоставку.Номер,
		|	РаспоряженияНаДоставку.Дата,
		|	РаспоряженияНаДоставку.Адрес,
		|	РаспоряженияНаДоставку.АдресЗначенияПолей,
		|	РаспоряженияНаДоставку.СпособДоставки,
		|	РаспоряженияНаДоставку.Зона,
		|	РаспоряженияНаДоставку.Перевозчик,
		|	РаспоряженияНаДоставку.ВремяС,
		|	РаспоряженияНаДоставку.ВремяПо,
		|	РаспоряженияНаДоставку.ДополнительнаяИнформация,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозкиОписание,
		|	ВЫБОР
		|		КОГДА РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада)
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(РаспоряженияНаДоставку.Перевозчик)
		|		ИНАЧЕ РаспоряженияНаДоставку.Адрес
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.СостоянияИРеквизитыДоставки КАК РаспоряженияНаДоставку
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК РаспоряженияЗадания
		|		ПО (РаспоряженияЗадания.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
		|			И (РаспоряженияЗадания.Склад = РаспоряженияНаДоставку.Склад)
		|			И (РаспоряженияЗадания.Ссылка = &ЗаданиеНаПеревозкуПодбор)
		|			И (РаспоряженияНаДоставку.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияДоставки.ТребуетсяДоставка))
		|ГДЕ
		|	(&БезОтбораПоЗоне
		|			ИЛИ РаспоряженияНаДоставку.Зона В ИЕРАРХИИ (&Зона))
		|	И (РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
		|			ИЛИ РаспоряженияНаДоставку.Склад В ИЕРАРХИИ (&Склад))
		|	И (НЕ (РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|			И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриПоступлении <= &ТекущаяДатаСеанса)
		|		ИЛИ (НЕ РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.СоглашенияСПоставщиками
		|			 И НЕ РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.ДоговорыКонтрагентов)
		|		)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РаспоряженияНаДоставку.Распоряжение,
		|	РаспоряженияНаДоставку.Склад,
		|	(РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|		И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриПоступлении <= &ТекущаяДатаСеанса) КАК ЭтоОрдерныйСклад,
		|	РаспоряженияНаДоставку.ПолучательОтправитель,
		|	ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) КАК ВидРаспоряжения,
		|	NULL КАК Номер,
		|	РаспоряженияНаДоставку.Дата,
		|	NULL КАК Адрес,
		|	NULL КАК АдресЗначенияПолей,
		|	РаспоряженияНаДоставку.СпособДоставки,
		|	РаспоряженияНаДоставку.Зона,
		|	РаспоряженияНаДоставку.Перевозчик,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	РегистрСведений.СостоянияИРеквизитыДоставки КАК РаспоряженияНаДоставку
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения КАК ОбновляемыеРаспоряжения
		|		ПО РаспоряженияНаДоставку.Распоряжение = ОбновляемыеРаспоряжения.Распоряжение
		|			И РаспоряженияНаДоставку.Склад = ОбновляемыеРаспоряжения.Склад
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.НашаТранспортнаяСлужба)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиОтОтправителя)
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомОтОтправителя)
		|			ИНАЧЕ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиОтОтправителя)
		|					ИЛИ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомОтОтправителя)
		|		КОНЕЦ
		|	И (&БезОтбораПоЗоне
		|			ИЛИ РаспоряженияНаДоставку.Зона В ИЕРАРХИИ (&Зона))
		|	И (РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
		|			ИЛИ РаспоряженияНаДоставку.Склад В ИЕРАРХИИ (&Склад))
		|	И (РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.СоглашенияСПоставщиками
		|		ИЛИ РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.ДоговорыКонтрагентов)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Распоряжение,
		|	Склад";
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРаспоряженияНаДоставкуПолучателямПоОрдернойСхеме()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЧастичноДоставленныеЗаказы.Склад             КАК Склад,
	|	ЧастичноДоставленныеЗаказы.Распоряжение      КАК Распоряжение,
	|	РаспоряженияНаДоставку.ПолучательОтправитель КАК ПолучательОтправитель,
	|	РаспоряженияНаДоставку.СпособДоставки        КАК СпособДоставки,
	|	РаспоряженияНаДоставку.Зона                  КАК Зона,
	|	РаспоряженияНаДоставку.Перевозчик            КАК Перевозчик,
	|	NULL                                         КАК ОсобыеУсловияПеревозки,
	|	ЧастичноДоставленныеЗаказы.Номенклатура      КАК Номенклатура,
	|	ЧастичноДоставленныеЗаказы.Характеристика    КАК Характеристика,
	|	ЧастичноДоставленныеЗаказы.Назначение        КАК Назначение,
	|	ЧастичноДоставленныеЗаказы.Серия             КАК Серия,
	|	СУММА(ЧастичноДоставленныеЗаказы.Количество) КАК Количество
	|ПОМЕСТИТЬ ВтДвиженияКРаспределениюПоОрдернойСхеме
	|ИЗ
	|	РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ЧастичноДоставленныеЗаказы
	|		ПО РаспоряженияНаДоставку.Распоряжение = ЧастичноДоставленныеЗаказы.Распоряжение
	|			И РаспоряженияНаДоставку.Склад = ЧастичноДоставленныеЗаказы.Склад
	|			И (НЕ ЧастичноДоставленныеЗаказы.ВсеТовары)
	|			И (РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|				ИЛИ РаспоряженияНаДоставку.СпособДоставки
	|					= ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте))
	|ГДЕ
	|	(ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку <> &ЗаданиеНаПеревозкуПодбор
	|		И ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку.Проведен
	|			ИЛИ ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧастичноДоставленныеЗаказы.Склад,
	|	ЧастичноДоставленныеЗаказы.Распоряжение,
	|	РаспоряженияНаДоставку.ПолучательОтправитель,
	|	РаспоряженияНаДоставку.СпособДоставки,
	|	РаспоряженияНаДоставку.Зона,
	|	РаспоряженияНаДоставку.Перевозчик,
	|	ЧастичноДоставленныеЗаказы.Номенклатура,
	|	ЧастичноДоставленныеЗаказы.Характеристика,
	|	ЧастичноДоставленныеЗаказы.Назначение,
	|	ЧастичноДоставленныеЗаказы.Серия
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЧастичноДоставленныеЗаказы.Количество) > 0
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОтгрузкеДетально.ДатаОтгрузки КАК Дата,
	|	ТоварыКОтгрузкеДетально.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузкеДетально.МернаяЕдиницаИзмерения КАК МернаяЕдиницаИзмерения,
	|	ТоварыКОтгрузкеДетально.Характеристика КАК Характеристика,
	|	ТоварыКОтгрузкеДетально.Назначение КАК Назначение,
	|	ТоварыКОтгрузкеДетально.Серия КАК Серия,
	|	ТоварыКОтгрузкеДетально.Количество КАК Количество,
	|	ТоварыКОтгрузкеДетально.Вес КАК Вес,
	|	ТоварыКОтгрузкеДетально.Объем КАК Объем,
	|	ТоварыКОтгрузкеДетально.Склад КАК Склад,
	|	ТоварыКОтгрузкеДетально.Распоряжение КАК Распоряжение,
	|	ТоварыКОтгрузкеДетально.ПолучательОтправитель КАК ПолучательОтправитель,
	|	ТИПЗНАЧЕНИЯ(ТоварыКОтгрузкеДетально.Распоряжение) КАК ВидРаспоряжения,
	|	СостоянияИРеквизитыДоставки.Номер КАК Номер,
	|	СостоянияИРеквизитыДоставки.Адрес КАК Адрес,
	|	СостоянияИРеквизитыДоставки.АдресЗначенияПолей КАК АдресЗначенияПолей,
	|	ТоварыКОтгрузкеДетально.СпособДоставки КАК СпособДоставки,
	|	ВЫБОР
	|		КОГДА ТоварыКОтгрузкеДетально.ЭтоПоручениеЭкспедитору
	|			ТОГДА 4
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТоварыКОтгрузкеДетально.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика))
	|					ТОГДА 0
	|				КОГДА ТоварыКОтгрузкеДетально.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу))
	|					ТОГДА 1
	|				ИНАЧЕ 2
	|			КОНЕЦ + ВЫБОР
	|				КОГДА СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки
	|					ТОГДА 3
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Картинка,
	|	ТоварыКОтгрузкеДетально.Зона КАК Зона,
	|	ТоварыКОтгрузкеДетально.Зона.Наименование КАК ЗонаПредставление,
	|	ТоварыКОтгрузкеДетально.Перевозчик КАК Перевозчик,
	|	СостоянияИРеквизитыДоставки.ВремяС КАК ВремяС,
	|	СостоянияИРеквизитыДоставки.ВремяПо КАК ВремяПо,
	|	ВЫРАЗИТЬ(СостоянияИРеквизитыДоставки.ДополнительнаяИнформация КАК СТРОКА(200)) КАК ДополнительнаяИнформация,
	|	СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ВЫРАЗИТЬ(СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозкиОписание КАК СТРОКА(200)) КАК ОсобыеУсловияПеревозкиОписание,
	|	ВЫБОР
	|		КОГДА ТоварыКОтгрузкеДетально.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ТоварыКОтгрузкеДетально.Перевозчик)
	|		ИНАЧЕ СостоянияИРеквизитыДоставки.Адрес
	|	КОНЕЦ КАК ПолеУпорядочивания
	|ПОМЕСТИТЬ ВтРаспоряженияНаДоставкуПолучателямПоОрдернойСхеме
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		МАКСИМУМ(
	|			ВЫБОР КОГДА
	|				НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|					ТОГДА НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|				ИНАЧЕ НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ)
	|			КОНЕЦ) КАК ДатаОтгрузки,
	|		ВЫБОР КОГДА
	|			НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|				ТОГДА НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ)
	|		КОНЕЦ КАК ПолеГруппировкиПросроченныхДатОтгрузки,
	|		ТоварыСУчетомДоставленных.Номенклатура КАК Номенклатура,
	|		ТоварыСУчетомДоставленных.Характеристика КАК Характеристика,
	|		ТоварыСУчетомДоставленных.Назначение КАК Назначение,
	|		ТоварыСУчетомДоставленных.Серия КАК Серия,
	|		РаспоряженияНаДоставку.Склад                 КАК Склад,
	|		РаспоряженияНаДоставку.Распоряжение          КАК Распоряжение,
	|		РаспоряженияНаДоставку.ПолучательОтправитель КАК ПолучательОтправитель,
	|		РаспоряженияНаДоставку.СпособДоставки        КАК СпособДоставки,
	|		РаспоряженияНаДоставку.Зона                  КАК Зона,
	|		РаспоряженияНаДоставку.Перевозчик            КАК Перевозчик,
	|		СУММА(ТоварыСУчетомДоставленных.КОтгрузке) КАК Количество,      // Количество
	|		СУММА(ТоварыСУчетомДоставленных.КОтгрузке * &ТекстЗапросаВесУпаковки) КАК Вес,
	|		СУММА(ТоварыСУчетомДоставленных.КОтгрузке * &ТекстЗапросаОбъемУпаковки) КАК Объем,
	|		ЛОЖЬ КАК ЭтоПоручениеЭкспедитору,
	|		ТоварыСУчетомДоставленных.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК МернаяЕдиницаИзмерения
	|	ИЗ
	|		РегистрНакопления.ТоварыКОтгрузке КАК ТоварыСУчетомДоставленных
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ПО ТоварыСУчетомДоставленных.ДокументОтгрузки = РаспоряженияНаДоставку.Распоряжение
	|			И ТоварыСУчетомДоставленных.Склад = РаспоряженияНаДоставку.Склад
	|			И РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|			ПО ТоварыСУчетомДоставленных.Номенклатура = СправочникНоменклатура.Ссылка
	|	ГДЕ
	|		ТоварыСУчетомДоставленных.КОтгрузке > 0
	|		И ТоварыСУчетомДоставленных.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВЫБОР КОГДА
	|			НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|				ТОГДА НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ)
	|		КОНЕЦ,
	|		РаспоряженияНаДоставку.Склад,
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.Зона,
	|		РаспоряженияНаДоставку.ПолучательОтправитель,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		РаспоряженияНаДоставку.Перевозчик,
	|		ТоварыСУчетомДоставленных.Номенклатура,
	|		ТоварыСУчетомДоставленных.Характеристика,
	|		ТоварыСУчетомДоставленных.Назначение,
	|		ТоварыСУчетомДоставленных.Серия,
	|		ТоварыСУчетомДоставленных.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
	|	ИМЕЮЩИЕ
	|		СУММА(ТоварыСУчетомДоставленных.КОтгрузке) > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(РаспоряженияНаДоставку.Дата, ДЕНЬ),
	|		НАЧАЛОПЕРИОДА(РаспоряженияНаДоставку.Дата, ДЕНЬ),
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		РаспоряженияНаДоставку.Склад,
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.ПолучательОтправитель,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		РаспоряженияНаДоставку.Зона,
	|		NULL,
	|		0,
	|		0,
	|		0,
	|		ИСТИНА,
	|		ЛОЖЬ
	|	ИЗ
	|		РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|			ПО (ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
	|	ГДЕ
	|		ТоварыКДоставке.Распоряжение ЕСТЬ NULL
	|		И РаспоряженияНаДоставку.СпособДоставки В (
	|			ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуСоСклада),
	|			ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте) )
	//|			ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
	//РИВ  Добавили способ доставки "НашимиСиламиСАдресаОтправителя", чтобы попадали заказы поставщику!      
	/////////////////////////////////////////////// 
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		МАКСИМУМ(
	|			ВЫБОР КОГДА
	|				НАЧАЛОПЕРИОДА(ТоварыКПоступлению.Период, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|					ТОГДА НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|				ИНАЧЕ НАЧАЛОПЕРИОДА(ТоварыКПоступлению.Период, ДЕНЬ)
	|			КОНЕЦ) КАК ДатаОтгрузки,
	|		ВЫБОР КОГДА
	|			НАЧАЛОПЕРИОДА(ТоварыКПоступлению.Период, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|				ТОГДА НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ТоварыКПоступлению.Период, ДЕНЬ)
	|		КОНЕЦ КАК ПолеГруппировкиПросроченныхДатОтгрузки,
	|		ТоварыКПоступлению.Номенклатура КАК Номенклатура,
	|		ТоварыКПоступлению.Характеристика КАК Характеристика,
	|		ТоварыКПоступлению.Назначение КАК Назначение,
	|		ТоварыКПоступлению.Серия КАК Серия,
	|		РаспоряженияНаДоставку.Склад                 КАК Склад,
	|		РаспоряженияНаДоставку.Распоряжение          КАК Распоряжение,
	|		РаспоряженияНаДоставку.ПолучательОтправитель КАК ПолучательОтправитель,
	|		РаспоряженияНаДоставку.СпособДоставки        КАК СпособДоставки,
	|		РаспоряженияНаДоставку.Зона                  КАК Зона,
	|		РаспоряженияНаДоставку.Перевозчик            КАК Перевозчик,
	|		СУММА(ТоварыКПоступлению.КОформлениюПоступленийПоРаспоряжению) КАК Количество,      // Количество
	|		СУММА(ТоварыКПоступлению.КОформлениюПоступленийПоРаспоряжению * &ТекстЗапросаВесУпаковки) КАК Вес,
	|		СУММА(ТоварыКПоступлению.КОформлениюПоступленийПоРаспоряжению * &ТекстЗапросаОбъемУпаковки) КАК Объем,
	|		ЛОЖЬ КАК ЭтоПоручениеЭкспедитору,
	|		ТоварыКПоступлению.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК МернаяЕдиницаИзмерения
	|	ИЗ
	|		РегистрНакопления.ТоварыКПоступлению КАК ТоварыКПоступлению
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ПО ТоварыКПоступлению.ДокументПоступления = РаспоряженияНаДоставку.Распоряжение
	|			И ТоварыКПоступлению.Склад = РаспоряженияНаДоставку.Склад
	|			И РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|			ПО ТоварыКПоступлению.Номенклатура = СправочникНоменклатура.Ссылка
	|	ГДЕ
	|		ТоварыКПоступлению.КОформлениюПоступленийПоРаспоряжению > 0 
	//ПРОВЕРИТЬ ЧТО ВЫБРАЛИ ПРАВИЛЬНЫЙ РЕКВИЗИТ
	|		И                                                                                                
	|ТоварыКПоступлению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВЫБОР КОГДА
	|			НАЧАЛОПЕРИОДА(ТоварыКПоступлению.Период, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|				ТОГДА НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ТоварыКПоступлению.Период, ДЕНЬ)
	|		КОНЕЦ,
	|		РаспоряженияНаДоставку.Склад,
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.Зона,
	|		РаспоряженияНаДоставку.ПолучательОтправитель,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		РаспоряженияНаДоставку.Перевозчик,
	|		ТоварыКПоступлению.Номенклатура,
	|		ТоварыКПоступлению.Характеристика,
	|		ТоварыКПоступлению.Назначение,
	|		ТоварыКПоступлению.Серия,
	|		ТоварыКПоступлению.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
	///////////////////////////////////////////////
	|			
	|	) КАК ТоварыКОтгрузкеДетально
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
	|	ПО ТоварыКОтгрузкеДетально.Распоряжение = СостоянияИРеквизитыДоставки.Распоряжение
	|		И ТоварыКОтгрузкеДетально.Склад = СостоянияИРеквизитыДоставки.Склад";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРаспоряженияНаДоставкуПолучателямБезОрдернойСхемы()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЧастичноДоставленныеЗаказы.Склад              КАК Склад,
	|	ЧастичноДоставленныеЗаказы.Распоряжение       КАК Распоряжение,
	|	NULL                                          КАК ПолучательОтправитель,
	|	РаспоряженияНаДоставку.СпособДоставки         КАК СпособДоставки,
	|	NULL                                          КАК Зона,
	|	NULL                                          КАК Перевозчик,
	|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ЧастичноДоставленныеЗаказы.Номенклатура       КАК Номенклатура,
	|	ЧастичноДоставленныеЗаказы.Характеристика     КАК Характеристика,
	|	ЧастичноДоставленныеЗаказы.Назначение         КАК Назначение,
	|	ЧастичноДоставленныеЗаказы.Серия              КАК Серия,
	|	СУММА(ЧастичноДоставленныеЗаказы.Количество)  КАК Количество
	|ПОМЕСТИТЬ ВтДвиженияКРаспределениюБезОрдернойСхемы
	|ИЗ
	|	РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ЧастичноДоставленныеЗаказы
	|		ПО РаспоряженияНаДоставку.Распоряжение = ЧастичноДоставленныеЗаказы.Распоряжение
	|			И РаспоряженияНаДоставку.Склад = ЧастичноДоставленныеЗаказы.Склад
	|			И НЕ РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|			И (НЕ ЧастичноДоставленныеЗаказы.ВсеТовары)
	|ГДЕ
	|	(ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку <> &ЗаданиеНаПеревозкуПодбор
	|				И ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку.Проведен
	|			ИЛИ ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧастичноДоставленныеЗаказы.Склад,
	|	ЧастичноДоставленныеЗаказы.Распоряжение,
	|	РаспоряженияНаДоставку.СпособДоставки,
	|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки,
	|	ЧастичноДоставленныеЗаказы.Номенклатура,
	|	ЧастичноДоставленныеЗаказы.Характеристика,
	|	ЧастичноДоставленныеЗаказы.Назначение,
	|	ЧастичноДоставленныеЗаказы.Серия
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЗ.Дата КАК Дата,
	|	ВЗ.Номенклатура КАК Номенклатура,
	|	ВЗ.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК МернаяЕдиницаИзмерения,
	|	ВЗ.Характеристика КАК Характеристика,
	|	ВЗ.Назначение КАК Назначение,
	|	ВЗ.Серия КАК Серия,
	|	ВЗ.Количество КАК Количество,
	|	ВЗ.Количество * &ТекстЗапросаВесУпаковки КАК Вес,
	|	ВЗ.Количество * &ТекстЗапросаОбъемУпаковки КАК Объем,
	|	ВЗ.Склад КАК Склад,
	|	ВЗ.Распоряжение КАК Распоряжение,
	|	ДопРеквизиты.ПолучательОтправитель КАК ПолучательОтправитель,
	|	ТИПЗНАЧЕНИЯ(ВЗ.Распоряжение) КАК ВидРаспоряжения,
	|	ДопРеквизиты.Номер КАК Номер,
	|	ДопРеквизиты.Адрес КАК Адрес,
	|	ВЫРАЗИТЬ(ДопРеквизиты.АдресЗначенияПолей КАК СТРОКА(1000)) КАК АдресЗначенияПолей,
	|	ВЗ.СпособДоставки КАК СпособДоставки,
	|	ВЗ.Картинка КАК Картинка,
	|	ЕСТЬNULL(ДопРеквизиты.Зона, ЗНАЧЕНИЕ(Справочник.ЗоныДоставки.ПустаяСсылка)) КАК Зона,
	|	ДопРеквизиты.Зона.Наименование КАК ЗонаПредставление,
	|	ДопРеквизиты.Перевозчик КАК Перевозчик,
	|	ДопРеквизиты.ВремяС КАК ВремяС,
	|	ДопРеквизиты.ВремяПо КАК ВремяПо,
	|	ВЫРАЗИТЬ(ДопРеквизиты.ДополнительнаяИнформация КАК СТРОКА(500)) КАК ДополнительнаяИнформация,
	|	ДопРеквизиты.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ВЫРАЗИТЬ(ДопРеквизиты.ОсобыеУсловияПеревозкиОписание КАК СТРОКА(500)) КАК ОсобыеУсловияПеревозкиОписание,
	|	ВЫБОР
	|		КОГДА ВЗ.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ДопРеквизиты.Перевозчик)
	|		ИНАЧЕ ДопРеквизиты.Адрес
	|	КОНЕЦ КАК ПолеУпорядочивания
	|ПОМЕСТИТЬ ВтРаспоряженияНаДоставкуПолучателямБезОрдернойСхемы
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ТоварыКОтгрузке.Период, ДЕНЬ) КАК Дата,
	|		РаспоряженияНаДоставку.Распоряжение КАК Распоряжение,
	|		РаспоряженияНаДоставку.Склад КАК Склад,
	|		ТоварыКОтгрузке.Номенклатура КАК Номенклатура,
	|		ТоварыКОтгрузке.Характеристика КАК Характеристика,
	|		ТоварыКОтгрузке.Назначение КАК Назначение,
	|		ТоварыКОтгрузке.Серия КАК Серия,
	|		РаспоряженияНаДоставку.СпособДоставки КАК СпособДоставки,
	|		СУММА(ТоварыКОтгрузке.КОтгрузке) КАК Количество,
	|		ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика))
	|				ТОГДА 0
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу))
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ + ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
	|				ТОГДА 3
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Картинка
	|	ИЗ
	|		РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
	|			ПО РаспоряженияНаДоставку.Распоряжение = ТоварыКОтгрузке.ДокументОтгрузки
	|				И РаспоряженияНаДоставку.Склад = ТоварыКОтгрузке.Склад
	|				И НЕ РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|	ГДЕ
	|		ТоварыКОтгрузке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НАЧАЛОПЕРИОДА(ТоварыКОтгрузке.Период, ДЕНЬ),
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.Склад,
	|		ТоварыКОтгрузке.Номенклатура,
	|		ТоварыКОтгрузке.Характеристика,
	|		ТоварыКОтгрузке.Назначение,
	|		ТоварыКОтгрузке.Серия,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика))
	|				ТОГДА 0
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу))
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ + ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
	|				ТОГДА 3
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ИМЕЮЩИЕ
	|		СУММА(ТоварыКОтгрузке.КОтгрузке) > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(РаспоряженияНаДоставку.Дата, ДЕНЬ),
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.Склад,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		NULL,
	|		4
	|	ИЗ
	|		РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|			ПО (ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
	|	ГДЕ
	|		РаспоряженияНаДоставку.СпособДоставки В
	|			(ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуСоСклада),
	|			ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте))
	|		И ТоварыКДоставке.Распоряжение ЕСТЬ NULL
	|	) КАК ВЗ
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИРеквизитыДоставки КАК ДопРеквизиты
	|	ПО ВЗ.Распоряжение = ДопРеквизиты.Распоряжение
	|		И ВЗ.Склад = ДопРеквизиты.Склад
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|	ПО ВЗ.Номенклатура = СправочникНоменклатура.Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРаспоряженияНаДоставкуОтОтправителейПоОрдернойСхеме()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТоварыКПоступлениюОстатки.Склад КАК Склад,
	|	ТоварыКПоступлениюОстатки.ДокументПоступления КАК Распоряжение,
	|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
	|	ТоварыКПоступлениюОстатки.Назначение КАК Назначение,
	|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток КАК Количество
	|ПОМЕСТИТЬ ТоварыКДоставкеОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Остатки(
	|			,
	|			(Склад, ДокументПоступления) В
	|				(ВЫБРАТЬ
	|					РаспоряженияНаДоставку.Склад,
	|					РаспоряженияНаДоставку.Распоряжение
	|				ИЗ
	|					РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ГДЕ
	|					РаспоряженияНаДоставку.ЭтоОрдерныйСклад)) КАК ТоварыКПоступлениюОстатки
	|ГДЕ
	|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДетальныеДанные.Склад КАК Склад,
	|	ДетальныеДанные.Распоряжение КАК Распоряжение,
	|	ДетальныеДанные.Номенклатура КАК Номенклатура,
	|	ДетальныеДанные.Характеристика КАК Характеристика,
	|	ДетальныеДанные.Назначение КАК Назначение,
	|	СУММА(ДетальныеДанные.Количество) КАК Количество
	|ПОМЕСТИТЬ ТоварыСУчетомДоставленных
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыКДоставкеОстатки.Склад КАК Склад,
	|		ТоварыКДоставкеОстатки.Распоряжение КАК Распоряжение,
	|		ТоварыКДоставкеОстатки.Номенклатура КАК Номенклатура,
	|		ТоварыКДоставкеОстатки.Характеристика КАК Характеристика,
	|		ТоварыКДоставкеОстатки.Назначение КАК Назначение,
	|		ТоварыКДоставкеОстатки.Количество КАК Количество
	|	ИЗ
	|		ТоварыКДоставкеОстатки КАК ТоварыКДоставкеОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыКДоставкеОстатки.Склад,
	|		ТоварыКДоставкеОстатки.Распоряжение,
	|		ТоварыКДоставкеОстатки.Номенклатура,
	|		ТоварыКДоставкеОстатки.Характеристика,
	|		ТоварыКДоставкеОстатки.Назначение,
	|		-ЕСТЬNULL(ТоварыКДоставке.Количество, 0)
	|	ИЗ
	|		ТоварыКДоставкеОстатки КАК ТоварыКДоставкеОстатки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|			ПО ТоварыКДоставкеОстатки.Склад = ТоварыКДоставке.Склад
	|				И ТоварыКДоставкеОстатки.Распоряжение = ТоварыКДоставке.Распоряжение
	|				И ТоварыКДоставкеОстатки.Номенклатура = ТоварыКДоставке.Номенклатура
	|				И ТоварыКДоставкеОстатки.Характеристика = ТоварыКДоставке.Характеристика
	|				И ТоварыКДоставкеОстатки.Назначение = ТоварыКДоставке.Назначение
	|	ГДЕ
	|		(ТоварыКДоставке.ЗаданиеНаПеревозку <> &ЗаданиеНаПеревозкуПодбор
	|					И ТоварыКДоставке.ЗаданиеНаПеревозку.Проведен
	|				ИЛИ ТоварыКДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПустаяСсылка)
	|		И НЕ ТоварыКДоставке.ВсеТовары) КАК ДетальныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ДетальныеДанные.Склад,
	|	ДетальныеДанные.Распоряжение,
	|	ДетальныеДанные.Номенклатура,
	|	ДетальныеДанные.Характеристика,
	|	ДетальныеДанные.Назначение
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДетальныеДанные.Количество) > 0
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыКПоступлению.Период КАК Период,
	|	ТоварыКПоступлению.ДокументПоступления КАК Распоряжение,
	|	ТоварыКПоступлению.Номенклатура КАК Номенклатура,
	|	ТоварыКПоступлению.Характеристика КАК Характеристика,
	|	ТоварыКПоступлению.Назначение КАК Назначение,
	|	ТоварыКПоступлению.Склад КАК Склад,
	|	СУММА(ЕСТЬNULL(ТоварыКПоступлению.КОформлениюОрдеров, 0)) КАК Количество,
	|	СУММА(ЕСТЬNULL(ТоварыКПоступлению.КОформлениюОрдеров, 0) * &ТекстЗапросаВесУпаковки) КАК Вес,
	|	СУММА(ЕСТЬNULL(ТоварыКПоступлению.КОформлениюОрдеров, 0) * &ТекстЗапросаОбъемУпаковки) КАК Объем
	|ПОМЕСТИТЬ ВтДвиженияКРаспределениюПоОрдернойСхеме
	|ИЗ
	|	ТоварыСУчетомДоставленных КАК ТоварыСУчетомДоставленных
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПоступлению КАК ТоварыКПоступлению
	|		ПО ТоварыСУчетомДоставленных.Распоряжение = ТоварыКПоступлению.ДокументПоступления
	|			И ТоварыСУчетомДоставленных.Склад = ТоварыКПоступлению.Склад
	|			И ТоварыСУчетомДоставленных.Номенклатура = ТоварыКПоступлению.Номенклатура
	|			И ТоварыСУчетомДоставленных.Характеристика = ТоварыКПоступлению.Характеристика
	|			И ТоварыСУчетомДоставленных.Назначение = ТоварыКПоступлению.Назначение
	|			И (ТоварыКПоступлению.Период >= &ДатаОтбора)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТоварыСУчетомДоставленных.Номенклатура = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	ТоварыКПоступлению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКПоступлению.Период,
	|	ТоварыКПоступлению.ДокументПоступления,
	|	ТоварыКПоступлению.Номенклатура,
	|	ТоварыКПоступлению.Характеристика,
	|	ТоварыКПоступлению.Назначение,
	|	ТоварыКПоступлению.Склад
	|ИМЕЮЩИЕ
	|	СУММА(ТоварыКПоступлению.КОформлениюОрдеров) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СостоянияИРеквизитыДоставки.ПолучательОтправитель, НЕОПРЕДЕЛЕНО) КАК ПолучательОтправитель,
	|	ТоварыСУчетомДоставленных.Номенклатура КАК Номенклатура,
	|	ТоварыСУчетомДоставленных.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК МернаяЕдиницаИзмерения,
	|	ТоварыСУчетомДоставленных.Характеристика КАК Характеристика,
	|	ТоварыСУчетомДоставленных.Назначение КАК Назначение,
	|	ТоварыСУчетомДоставленных.Количество КАК Количество,
	|	ТоварыСУчетомДоставленных.Количество * &ТекстЗапросаВесУпаковки КАК Вес,
	|	ТоварыСУчетомДоставленных.Количество * &ТекстЗапросаОбъемУпаковки КАК Объем,
	|	ТоварыСУчетомДоставленных.Склад КАК Склад,
	|	ТоварыСУчетомДоставленных.Распоряжение КАК Распоряжение,
	|	ТИПЗНАЧЕНИЯ(ТоварыСУчетомДоставленных.Распоряжение) КАК ВидРаспоряжения,
	|	СостоянияИРеквизитыДоставки.Номер КАК Номер,
	|	СостоянияИРеквизитыДоставки.Адрес КАК Адрес,
	|	СостоянияИРеквизитыДоставки.АдресЗначенияПолей КАК АдресЗначенияПолей,
	|	СостоянияИРеквизитыДоставки.СпособДоставки КАК СпособДоставки,
	|	СостоянияИРеквизитыДоставки.Зона КАК Зона,
	|	СостоянияИРеквизитыДоставки.Зона.Наименование КАК ЗонаПредставление,
	|	СостоянияИРеквизитыДоставки.Перевозчик КАК Перевозчик,
	|	СостоянияИРеквизитыДоставки.ВремяС КАК ВремяС,
	|	СостоянияИРеквизитыДоставки.ВремяПо КАК ВремяПо,
	|	ВЫБОР
	|		КОГДА СостоянияИРеквизитыДоставки.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада))
	|			ТОГДА 0
	|		КОГДА СостоянияИРеквизитыДоставки.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи))
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ + ВЫБОР
	|		КОГДА СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки
	|			ТОГДА 3
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Картинка,
	|	ВЫРАЗИТЬ(СостоянияИРеквизитыДоставки.ДополнительнаяИнформация КАК СТРОКА(200)) КАК ДополнительнаяИнформация,
	|	СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ВЫРАЗИТЬ(СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозкиОписание КАК СТРОКА(200)) КАК ОсобыеУсловияПеревозкиОписание,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	СостоянияИРеквизитыДоставки.Дата КАК Дата,
	|	NULL КАК ПолеУпорядочивания
	|ПОМЕСТИТЬ ВтРаспоряженияНаДоставкуОтОтправителейПоОрдернойСхеме
	|ИЗ
	|	ТоварыСУчетомДоставленных КАК ТоварыСУчетомДоставленных
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
	|		ПО ТоварыСУчетомДоставленных.Склад = СостоянияИРеквизитыДоставки.Склад
	|			И ТоварыСУчетомДоставленных.Распоряжение = СостоянияИРеквизитыДоставки.Распоряжение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТоварыСУчетомДоставленных.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаспоряженияНаДоставку.ПолучательОтправитель,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	0,
	|	РаспоряженияНаДоставку.Склад,
	|	РаспоряженияНаДоставку.Распоряжение,
	|	ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение),
	|	СостоянияИРеквизитыДоставки.Номер,
	|	СостоянияИРеквизитыДоставки.Адрес,
	|	СостоянияИРеквизитыДоставки.АдресЗначенияПолей,
	|	СостоянияИРеквизитыДоставки.СпособДоставки,
	|	СостоянияИРеквизитыДоставки.Зона,
	|	СостоянияИРеквизитыДоставки.Зона.Наименование,
	|	СостоянияИРеквизитыДоставки.Перевозчик,
	|	СостоянияИРеквизитыДоставки.ВремяС,
	|	СостоянияИРеквизитыДоставки.ВремяПо,
	|	4,
	|	ВЫРАЗИТЬ(СостоянияИРеквизитыДоставки.ДополнительнаяИнформация КАК СТРОКА(200)),
	|	СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки,
	|	ВЫРАЗИТЬ(СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозкиОписание КАК СТРОКА(200)),
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА РаспоряженияНаДоставку.Распоряжение ССЫЛКА Документ.ПоручениеЭкспедитору
	|			ТОГДА НАЧАЛОПЕРИОДА(СостоянияИРеквизитыДоставки.Дата, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ,
	|	РаспоряженияНаДоставку.ПолеУпорядочения
	|ИЗ
	|	РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|		ПО РаспоряженияНаДоставку.Распоряжение = ТоварыКДоставке.Распоряжение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
	|		ПО РаспоряженияНаДоставку.Распоряжение = СостоянияИРеквизитыДоставки.Распоряжение
	|ГДЕ
	|	ТоварыКДоставке.Распоряжение ЕСТЬ NULL
	|	И РаспоряженияНаДоставку.СпособДоставки В (
	|		ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуНаСклад),
	|		ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте))
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРаспоряженияНаДоставкуОтОтправителейБезОрдернойСхемы()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Распоряжение КАК Распоряжение,
	|	ВложенныйЗапрос.Склад КАК Склад,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.Назначение КАК Назначение,
	|	ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.КоличествоВДоставке) > СУММА(ВложенныйЗапрос.КоличествоПринято)
	|			ТОГДА СУММА(ВложенныйЗапрос.КоличествоВДоставке)
	|		ИНАЧЕ СУММА(ВложенныйЗапрос.КоличествоПринято)
	|	КОНЕЦ КАК Количество
	|ПОМЕСТИТЬ ТоварыКВычетуИзДоставки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыКДоставке.Распоряжение КАК Распоряжение,
	|		ТоварыКДоставке.Склад КАК Склад,
	|		ТоварыКДоставке.Номенклатура КАК Номенклатура,
	|		ТоварыКДоставке.Характеристика КАК Характеристика,
	|		ТоварыКДоставке.Назначение КАК Назначение,
	|		ТоварыКДоставке.Количество КАК КоличествоВДоставке,
	|		0 КАК КоличествоПринято
	|	ИЗ
	|		РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ПО ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение
	|				И ТоварыКДоставке.Склад = РаспоряженияНаДоставку.Склад
	|				И НЕ РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|				И (НЕ ТоварыКДоставке.ВсеТовары)
	|	ГДЕ
	|		(ТоварыКДоставке.ЗаданиеНаПеревозку <> &ЗаданиеНаПеревозкуПодбор
	|					И ТоварыКДоставке.ЗаданиеНаПеревозку.Проведен
	|				ИЛИ ТоварыКДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПустаяСсылка)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыКПоступлениюОбороты.ДокументПоступления,
	|		ТоварыКПоступлениюОбороты.Склад,
	|		ТоварыКПоступлениюОбороты.Номенклатура,
	|		ТоварыКПоступлениюОбороты.Характеристика,
	|		ТоварыКПоступлениюОбороты.Назначение,
	|		0,
	|		ТоварыКПоступлениюОбороты.КОформлениюОрдеровРасход
	|	ИЗ
	|		РегистрНакопления.ТоварыКПоступлению.Обороты(, , , 
	|			(ДокументПоступления, Склад) В (
	|				ВЫБРАТЬ
	|					РаспоряженияНаДоставку.Распоряжение,
	|					РаспоряженияНаДоставку.Склад
	|				ИЗ
	|					РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ГДЕ
	|					НЕ РаспоряженияНаДоставку.ЭтоОрдерныйСклад)
	|			) КАК ТоварыКПоступлениюОбороты
	|	) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.Назначение,
	|	ВложенныйЗапрос.Распоряжение,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВложенныйЗапрос.Распоряжение,
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Характеристика,
	|	ВложенныйЗапрос.Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	NULL КАК Период,
	|	NULL КАК Распоряжение,
	|	NULL КАК Номенклатура,
	|	NULL КАК Характеристика,
	|	NULL КАК Назначение,
	|	NULL КАК Склад,
	|	0 КАК Количество,
	|	0 КАК Вес,
	|	0 КАК Объем
	|ПОМЕСТИТЬ ВтДвиженияКРаспределениюБезОрдернойСхемы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДетальныеДанные.Дата КАК Дата,
	|	ДетальныеДанные.Номенклатура КАК Номенклатура,
	|	ДетальныеДанные.МернаяЕдиницаИзмерения КАК МернаяЕдиницаИзмерения,
	|	ДетальныеДанные.Характеристика КАК Характеристика,
	|	ДетальныеДанные.Назначение КАК Назначение,
	|	ДетальныеДанные.Серия КАК Серия,
	|	ДетальныеДанные.НачальнаяПотребностьПоДатам - ДетальныеДанные.ВычетТоварыКДоставке КАК Количество,
	|	ДетальныеДанные.НачальнаяПотребностьПоДатамВес - ДетальныеДанные.ВычетТоварыКДоставкеВес КАК Вес,
	|	ДетальныеДанные.НачальнаяПотребностьПоДатамОбъем - ДетальныеДанные.ВычетТоварыКДоставкеОбъем КАК Объем,
	|	ДетальныеДанные.Склад КАК Склад,
	|	ДетальныеДанные.Распоряжение КАК Распоряжение,
	|	ДетальныеДанные.ПолучательОтправитель КАК ПолучательОтправитель,
	|	ДетальныеДанные.ВидРаспоряжения КАК ВидРаспоряжения,
	|	ДетальныеДанные.Номер КАК Номер,
	|	ДетальныеДанные.Адрес КАК Адрес,
	|	ДетальныеДанные.АдресЗначенияПолей КАК АдресЗначенияПолей,
	|	ДетальныеДанные.СпособДоставки КАК СпособДоставки,
	|	ДетальныеДанные.Картинка КАК Картинка,
	|	ДетальныеДанные.Зона КАК Зона,
	|	ДетальныеДанные.ЗонаПредставление КАК ЗонаПредставление,
	|	ДетальныеДанные.Перевозчик КАК Перевозчик,
	|	ДетальныеДанные.ВремяС КАК ВремяС,
	|	ДетальныеДанные.ВремяПо КАК ВремяПо,
	|	ДетальныеДанные.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	ДетальныеДанные.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ДетальныеДанные.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	ДетальныеДанные.ПолеУпорядочения КАК ПолеУпорядочивания
	|ПОМЕСТИТЬ ВтРаспоряженияНаДоставкуОтОтправителейБезОрдернойСхемы
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ТоварыКДоставкеПоРегистраторам.Период, ДЕНЬ) КАК Дата,
	|		ТоварыКДоставкеПоРегистраторам.Номенклатура КАК Номенклатура,
	|		ТоварыКДоставкеПоРегистраторам.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК МернаяЕдиницаИзмерения,
	|		ТоварыКДоставкеПоРегистраторам.Характеристика КАК Характеристика,
	|		ТоварыКДоставкеПоРегистраторам.Назначение КАК Назначение,
	|		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|		ТоварыКДоставкеПоРегистраторам.КОформлениюОрдеровПриход КАК НачальнаяПотребностьПоДатам,
	|		ТоварыКДоставкеПоРегистраторам.КОформлениюОрдеровПриход * &ТекстЗапросаВесУпаковки КАК НачальнаяПотребностьПоДатамВес,
	|		ТоварыКДоставкеПоРегистраторам.КОформлениюОрдеровПриход * &ТекстЗапросаОбъемУпаковки КАК НачальнаяПотребностьПоДатамОбъем,
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0) КАК ВычетТоварыКДоставке,
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0) * &ТекстЗапросаВесУпаковки КАК ВычетТоварыКДоставкеВес,
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0) * &ТекстЗапросаОбъемУпаковки КАК ВычетТоварыКДоставкеОбъем,
	|		РаспоряженияНаДоставку.Склад КАК Склад,
	|		РаспоряженияНаДоставку.Распоряжение КАК Распоряжение,
	|		РаспоряженияНаДоставку.ПолучательОтправитель КАК ПолучательОтправитель,
	|		РаспоряженияНаДоставку.ВидРаспоряжения КАК ВидРаспоряжения,
	|		РаспоряженияНаДоставку.Номер КАК Номер,
	|		РаспоряженияНаДоставку.Адрес КАК Адрес,
	|		РаспоряженияНаДоставку.АдресЗначенияПолей КАК АдресЗначенияПолей,
	|		РаспоряженияНаДоставку.СпособДоставки КАК СпособДоставки,
	|		ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада)
	|				ТОГДА 0
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуНаСклад), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте))
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ + ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
	|				ТОГДА 3
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Картинка,
	|		РаспоряженияНаДоставку.Зона КАК Зона,
	|		РаспоряженияНаДоставку.Зона.Наименование КАК ЗонаПредставление,
	|		РаспоряженияНаДоставку.Перевозчик КАК Перевозчик,
	|		РаспоряженияНаДоставку.ВремяС КАК ВремяС,
	|		РаспоряженияНаДоставку.ВремяПо КАК ВремяПо,
	|		РаспоряженияНаДоставку.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|		РаспоряженияНаДоставку.ПолеУпорядочения КАК ПолеУпорядочения
	|	ИЗ
	|		РегистрНакопления.ТоварыКПоступлению.Обороты(, , Регистратор, 
	|			(ДокументПоступления, Склад) В (
	|				ВЫБРАТЬ
	|					РаспоряженияНаДоставку.Распоряжение,
	|					РаспоряженияНаДоставку.Склад
	|				ИЗ
	|					РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ГДЕ
	|					НЕ РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|				)
	|			) КАК ТоварыКДоставкеПоРегистраторам
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТоварыКВычетуИзДоставки КАК ТоварыКВычетуИзДоставки
	|			ПО (ТоварыКВычетуИзДоставки.Распоряжение = ТоварыКДоставкеПоРегистраторам.Регистратор)
	|				И (ТоварыКВычетуИзДоставки.Склад = ТоварыКДоставкеПоРегистраторам.Склад)
	|				И (ТоварыКВычетуИзДоставки.Номенклатура = ТоварыКДоставкеПоРегистраторам.Номенклатура)
	|				И (ТоварыКВычетуИзДоставки.Характеристика = ТоварыКДоставкеПоРегистраторам.Характеристика)
	|				И (ТоварыКВычетуИзДоставки.Назначение = ТоварыКДоставкеПоРегистраторам.Назначение)
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|			ПО (СправочникНоменклатура.Ссылка = ТоварыКДоставкеПоРегистраторам.Номенклатура)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ПО ТоварыКДоставкеПоРегистраторам.Регистратор = РаспоряженияНаДоставку.Распоряжение
	|				И ТоварыКДоставкеПоРегистраторам.Склад = РаспоряженияНаДоставку.Склад
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗоныДоставки КАК Зоны
	|			ПО (Зоны.Ссылка = РаспоряженияНаДоставку.Зона)
	|	ГДЕ
	|		ТоварыКДоставкеПоРегистраторам.КОформлениюОрдеровПриход > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ТоварыКДоставкеПоДням.Период, ДЕНЬ),
	|		ТоварыКДоставкеПоДням.Номенклатура,
	|		ТоварыКДоставкеПоДням.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук),
	|		ТоварыКДоставкеПоДням.Характеристика,
	|		ТоварыКДоставкеПоДням.Назначение,
	|		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|		ТоварыКДоставкеПоДням.Количество,
	|		ТоварыКДоставкеПоДням.Количество * &ТекстЗапросаВесУпаковки,
	|		ТоварыКДоставкеПоДням.Количество * &ТекстЗапросаОбъемУпаковки,
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0),
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0) * &ТекстЗапросаВесУпаковки,
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0) * &ТекстЗапросаОбъемУпаковки,
	|		РаспоряженияНаДоставку.Склад,
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.ПолучательОтправитель,
	|		РаспоряженияНаДоставку.ВидРаспоряжения,
	|		РаспоряженияНаДоставку.Номер,
	|		РаспоряженияНаДоставку.Адрес,
	|		РаспоряженияНаДоставку.АдресЗначенияПолей,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада))
	|				ТОГДА 0
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи))
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ + ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
	|				ТОГДА 3
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		РаспоряженияНаДоставку.Зона,
	|		РаспоряженияНаДоставку.Зона.Наименование,
	|		РаспоряженияНаДоставку.Перевозчик,
	|		РаспоряженияНаДоставку.ВремяС,
	|		РаспоряженияНаДоставку.ВремяПо,
	|		РаспоряженияНаДоставку.ДополнительнаяИнформация,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозки,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозкиОписание,
	|		РаспоряженияНаДоставку.ПолеУпорядочения
	|	ИЗ
	|		(ВЫБРАТЬ
	|			Т.Ссылка КАК Ссылка,
	|			Т.ДатаПоступления КАК Период,
	|			Т.Склад КАК Склад,
	|			Т.Номенклатура КАК Номенклатура,
	|			Т.Характеристика КАК Характеристика,
	|			Т.Назначение КАК Назначение,
	|			СУММА(Т.Количество) КАК Количество
	|		ИЗ
	|			Документ.ЗаказПоставщику.Товары КАК Т
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ПО Т.Ссылка = РаспоряженияНаДоставку.Распоряжение
	|					И Т.Склад = РаспоряженияНаДоставку.Склад
	|					И (НЕ Т.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|						ИЛИ Т.ДатаПоступления < Т.Склад.ДатаНачалаОрдернойСхемыПриПоступлении)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Т.Ссылка,
	|			Т.ДатаПоступления,
	|			Т.Склад,
	|			Т.Номенклатура,
	|			Т.Характеристика,
	|			Т.Назначение
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			Т.Ссылка,
	|			Т.Ссылка.Дата,
	|			Т.Склад,
	|			Т.Номенклатура,
	|			Т.Характеристика,
	|			Т.Назначение,
	|			СУММА(Т.Количество)
	|		ИЗ
	|			Документ.ПриобретениеТоваровУслуг.Товары КАК Т
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ПО Т.Ссылка = РаспоряженияНаДоставку.Распоряжение
	|					И Т.Склад = РаспоряженияНаДоставку.Склад
	|					И (НЕ Т.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|						ИЛИ Т.Ссылка.Дата < Т.Склад.ДатаНачалаОрдернойСхемыПриПоступлении)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Т.Ссылка,
	|			Т.Склад,
	|			Т.Номенклатура,
	|			Т.Характеристика,
	|			Т.Назначение,
	|			Т.Ссылка.Дата
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			Т.Ссылка,
	|			Т.Ссылка.Дата,
	|			Т.Склад,
	|			Т.Номенклатура,
	|			Т.Характеристика,
	|			Т.Назначение,
	|			СУММА(Т.Количество)
	|		ИЗ
	|			Документ.ПриемкаТоваровНаХранение.Товары КАК Т
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ПО Т.Ссылка = РаспоряженияНаДоставку.Распоряжение
	|					И Т.Склад = РаспоряженияНаДоставку.Склад
	|					И (НЕ Т.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|						ИЛИ Т.Ссылка.Дата < Т.Склад.ДатаНачалаОрдернойСхемыПриПоступлении)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Т.Ссылка,
	|			Т.Склад,
	|			Т.Номенклатура,
	|			Т.Характеристика,
	|			Т.Назначение,
	|			Т.Ссылка.Дата
	|	) КАК ТоварыКДоставкеПоДням
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыКВычетуИзДоставки КАК ТоварыКВычетуИзДоставки
	|		ПО (ТоварыКВычетуИзДоставки.Распоряжение = ТоварыКДоставкеПоДням.Ссылка)
	|			И (ТоварыКВычетуИзДоставки.Склад = ТоварыКДоставкеПоДням.Склад)
	|			И (ТоварыКВычетуИзДоставки.Номенклатура = ТоварыКДоставкеПоДням.Номенклатура)
	|			И (ТоварыКВычетуИзДоставки.Характеристика = ТоварыКДоставкеПоДням.Характеристика)
	|			И (ТоварыКВычетуИзДоставки.Назначение = ТоварыКДоставкеПоДням.Назначение)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО (СправочникНоменклатура.Ссылка = ТоварыКДоставкеПоДням.Номенклатура)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|		ПО ТоварыКДоставкеПоДням.Ссылка = РаспоряженияНаДоставку.Распоряжение
	|			И ТоварыКДоставкеПоДням.Склад = РаспоряженияНаДоставку.Склад
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(РаспоряженияНаДоставку.Дата, ДЕНЬ),
	|		НЕОПРЕДЕЛЕНО,
	|		ЛОЖЬ,
	|		НЕОПРЕДЕЛЕНО,
	|		НЕОПРЕДЕЛЕНО,
	|		НЕОПРЕДЕЛЕНО,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		РаспоряженияНаДоставку.Склад,
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.ПолучательОтправитель,
	|		РаспоряженияНаДоставку.ВидРаспоряжения,
	|		РаспоряженияНаДоставку.Номер,
	|		РаспоряженияНаДоставку.Адрес,
	|		РаспоряженияНаДоставку.АдресЗначенияПолей,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		4,
	|		РаспоряженияНаДоставку.Зона,
	|		РаспоряженияНаДоставку.Зона.Наименование,
	|		РаспоряженияНаДоставку.Перевозчик,
	|		РаспоряженияНаДоставку.ВремяС,
	|		РаспоряженияНаДоставку.ВремяПо,
	|		РаспоряженияНаДоставку.ДополнительнаяИнформация,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозки,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозкиОписание,
	|		РаспоряженияНаДоставку.ПолеУпорядочения
	|	ИЗ
	|		РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|			ПО (ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
	|	ГДЕ
	|		РаспоряженияНаДоставку.СпособДоставки В (
	|			ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуНаСклад),
	|			ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте))
	|		И ТоварыКДоставке.Распоряжение ЕСТЬ NULL
	|	) КАК ДетальныеДанные
	|ГДЕ
	|	(ДетальныеДанные.НачальнаяПотребностьПоДатам = 0
	|			ИЛИ ДетальныеДанные.НачальнаяПотребностьПоДатам - ДетальныеДанные.ВычетТоварыКДоставке > 0)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция СпособыДоставкиНашимиСиламиКПолучателю()
	
	СпособыДоставкиНашимиСиламиКПолучателю = Новый Массив;
	СпособыДоставкиНашимиСиламиКПолучателю.Добавить(Перечисления.СпособыДоставки.ДоКлиента);
	СпособыДоставкиНашимиСиламиКПолучателю.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу);
	СпособыДоставкиНашимиСиламиКПолучателю.Добавить(Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки);
	СпособыДоставкиНашимиСиламиКПолучателю.Добавить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуСоСклада);
	СпособыДоставкиНашимиСиламиКПолучателю.Добавить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте);
	//РИВ
	СпособыДоставкиНашимиСиламиКПолучателю.Добавить(Перечисления.СпособыДоставки.НашимиСиламиСАдресаОтправителя);
	//РИВ
	Возврат СпособыДоставкиНашимиСиламиКПолучателю;
	
КонецФункции

Функция СпособыДоставкиПеревозчикомКПолучателю()
	
	СпособыДоставкиПеревозчикомКПолучателю = Новый Массив;
	СпособыДоставкиПеревозчикомКПолучателю.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчика);
	СпособыДоставкиПеревозчикомКПолучателю.Добавить(Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки);
	СпособыДоставкиПеревозчикомКПолучателю.Добавить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте); 
	//РИВ
	//СпособыДоставкиПеревозчикомКПолучателю.Добавить(Перечисления.СпособыДоставки.НашимиСиламиСАдресаОтправителя);
	//РИВ
	Возврат СпособыДоставкиПеревозчикомКПолучателю;	
	
КонецФункции

Функция СпособыДоставкиНашимиСиламиОтОтправителя()
	
	СпособыДоставкиНашимиСиламиОтОтправителя = Новый Массив;
	СпособыДоставкиНашимиСиламиОтОтправителя.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи);
	СпособыДоставкиНашимиСиламиОтОтправителя.Добавить(Перечисления.СпособыДоставки.НашимиСиламиСАдресаОтправителя);
	СпособыДоставкиНашимиСиламиОтОтправителя.Добавить(Перечисления.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки);
	СпособыДоставкиНашимиСиламиОтОтправителя.Добавить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуНаСклад);
	СпособыДоставкиНашимиСиламиОтОтправителя.Добавить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте);
	
	Возврат СпособыДоставкиНашимиСиламиОтОтправителя;
	
КонецФункции

Функция СпособыДоставкиПеревозчикомОтОтправителя()
	
	СпособыДоставкиПеревозчикомОтОтправителя = Новый Массив;
	СпособыДоставкиПеревозчикомОтОтправителя.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада);
	СпособыДоставкиПеревозчикомОтОтправителя.Добавить(Перечисления.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки);
	СпособыДоставкиПеревозчикомОтОтправителя.Добавить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте);
	Возврат СпособыДоставкиПеревозчикомОтОтправителя;
	
КонецФункции

// Перезаполняет список распоряжений на доставку на форме.
//
// Параметры:
//	Форма - УправляемаяФорма - форма, для которой необходимо обновить список распоряжений на доставку;
//	ОбновляемыеРаспоряжения - ТаблицаЗначений, Неопределено - фильтр для частичного перезаполнения списка только 
//		по переданным в таблице распоряжениям.
//
Процедура ОбновитьСписокРаспоряженийНаДоставку(Форма, ОбновляемыеРаспоряжения = Неопределено, ВыводитьВсе) Экспорт
	
	ДопустимоеОтклонениеПроцент = Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
	                          
	РаспоряженияНаДоставку 		= Форма.РаспоряженияНаДоставку;
	ТоварыРаспоряженийКДоставке = Форма.ТоварыРаспоряженийКДоставке;
	ОтборПоТипуИсполнителей 	= Форма.ОтборПоТипуИсполнителей;
	Зона 						= Форма.Зона;
	Склад 						= Форма.Склад;
	ДатаРаспоряжений 			= Форма.ДатаРаспоряжений;
	ЗонаГруппаИлиПустая 		= НЕ ЗначениеЗаполнено(Зона) ИЛИ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Зона,"ЭтоГруппа");
	
	ВыборочноеОбновление = (ОбновляемыеРаспоряжения <> Неопределено);
	
	ВесОбъемРаспоряженийПоДатам = Новый ТаблицаЗначений;
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Вес", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Объем", ОбщегоНазначения.ОписаниеТипаЧисло(18,6));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	
	КешДобавляемыхСтрок = Новый Массив;
	
	КоллекцияРаспоряжений = РаспоряженияНаДоставку.ПолучитьЭлементы();
	ВесОбъем = Новый Структура;
	
	Если Не ВыборочноеОбновление Тогда
		ВесОбъем.Вставить("ИтогоВес", 0);
		ВесОбъем.Вставить("ИтогоОбъем",0);
		КоллекцияРаспоряжений.Очистить();
		ТоварыРаспоряженийКДоставке.Очистить();
	Иначе
		СтруктураПоиска = Новый Структура("Склад, Распоряжение");
		
		Для Каждого Стр Из ОбновляемыеРаспоряжения Цикл
			
			// При выборочном обновлении сначала нужно удалить строки обновляемых распоряжений,
			// для этого воспользуемся списком товаров по распоряжениям.
			ПредыдущийИдентификатор = Неопределено;
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, Стр);
			
			НайденныеСтроки = ТоварыРаспоряженийКДоставке.НайтиСтроки(СтруктураПоиска);
			Для Каждого СтрокаТовары Из НайденныеСтроки Цикл
				Идентификатор = СтрокаТовары.ИдентификаторВДеревеРаспоряжений;
				Если ПредыдущийИдентификатор = Идентификатор
					Или Не ЗначениеЗаполнено(Идентификатор) Тогда
					Продолжить;
				КонецЕсли;
				СтрокаРаспоряжение = РаспоряженияНаДоставку.НайтиПоИдентификатору(Идентификатор);
				Если СтрокаРаспоряжение <> Неопределено Тогда
					Если ЗонаГруппаИлиПустая Тогда
						ТекущаяВетка = СтрокаРаспоряжение.ПолучитьРодителя();
						КоллекцияТекущаяВетка = ТекущаяВетка.ПолучитьЭлементы();
						// Если удаляем последний элемент в ветке, удалим родителя.
						Если КоллекцияТекущаяВетка.Количество() = 1 Тогда
							КоллекцияРаспоряжений.Удалить(ТекущаяВетка);
						Иначе
							ТекущаяВетка.Вес = ТекущаяВетка.Вес - СтрокаРаспоряжение.Вес;
							ТекущаяВетка.Объем = ТекущаяВетка.Объем - СтрокаРаспоряжение.Объем;
							КоллекцияТекущаяВетка.Удалить(СтрокаРаспоряжение);
						КонецЕсли;
					Иначе
						КоллекцияРаспоряжений.Удалить(СтрокаРаспоряжение);
					КонецЕсли;
				КонецЕсли;
				ТоварыРаспоряженийКДоставке.Удалить(СтрокаТовары);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	СтруктураЗадание = Новый Структура("ЗаданиеНаПеревозку", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураЗадание, Форма);
	
	Запрос = Новый Запрос;
	ИсходящаяДоставка = Форма.ВидДоставки = Перечисления.ВидыДоставки.СоСклада;
	
	ЕстьОрдерныйНаОтгрузкуСклад      = Ложь;
	ЕстьНеОрдерныйНаОтгрузкуСклад    = Ложь;
	ЕстьОрдерныйНаПоступлениеСклад   = Ложь;
	ЕстьНеОрдерныйНаПоступлениеСклад = Ложь;
	
	Если ИсходящаяДоставка Тогда
		ЕстьОрдерныйНаОтгрузкуСклад = СкладыСервер.ЕстьОрдерныйНаОтгрузкуСклад(Склад);
		ЕстьНеОрдерныйНаОтгрузкуСклад = СкладыСервер.ЕстьНеОрдерныйНаОтгрузкуСклад(Склад);
	Иначе
		ЕстьОрдерныйНаПоступлениеСклад = СкладыСервер.ЕстьОрдерныйНаПоступлениеСклад(Склад);
		ЕстьНеОрдерныйНаПоступлениеСклад = СкладыСервер.ЕстьНеОрдерныйНаПоступлениеСклад(Склад);
	КонецЕсли;
	
	ТекстЗапроса = "";
	Если ИсходящаяДоставка Тогда
		
		ТекстЗапроса = ТекстЗапросаРаспоряженияНаДоставку(ВыборочноеОбновление,
		ЕстьОрдерныйНаОтгрузкуСклад,
		ЕстьНеОрдерныйНаОтгрузкуСклад,
		Истина);
		
		Запрос.УстановитьПараметр("СпособыДоставкиНашимиСиламиКПолучателю", СпособыДоставкиНашимиСиламиКПолучателю());
		Запрос.УстановитьПараметр("СпособыДоставкиПеревозчикомКПолучателю", СпособыДоставкиПеревозчикомКПолучателю());
		
	Иначе
		
		ТекстЗапроса = ТекстЗапросаРаспоряженияНаДоставку(ВыборочноеОбновление,
		ЕстьОрдерныйНаПоступлениеСклад,
		ЕстьНеОрдерныйНаПоступлениеСклад,
		Ложь);
		
		Запрос.УстановитьПараметр("ДатаОтбора", ?(ЗначениеЗаполнено(ДатаРаспоряжений), ДатаРаспоряжений, НачалоДня(ТекущаяДатаСеанса())));
		Запрос.УстановитьПараметр("СпособыДоставкиНашимиСиламиОтОтправителя", СпособыДоставкиНашимиСиламиОтОтправителя());
		Запрос.УстановитьПараметр("СпособыДоставкиПеревозчикомОтОтправителя", СпособыДоставкиПеревозчикомОтОтправителя());
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	БезОтбораПоЗоне = Зона = Справочники.ЗоныДоставки.ПустаяСсылка();
	
	Запрос.УстановитьПараметр("Зона",                              Зона);
	Запрос.УстановитьПараметр("Склад",                             Склад);
	Запрос.УстановитьПараметр("БезОтбораПоЗоне",                   БезОтбораПоЗоне);
	Запрос.УстановитьПараметр("ОбновляемыеРаспоряжения",           ОбновляемыеРаспоряжения);
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозкуПодбор",          СтруктураЗадание.ЗаданиеНаПеревозку);
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозкуПустаяСсылка",    Документы.ЗаданиеНаПеревозку.ПустаяСсылка());
	Запрос.УстановитьПараметр("СтатусЗаданияЗакрыто",              Перечисления.СтатусыЗаданийНаПеревозку.Закрыто);
	Запрос.УстановитьПараметр("ОтборПоТипуИсполнителей",           ОтборПоТипуИсполнителей);
	Запрос.УстановитьПараметр("ТекущаяДатаСеанса",                 ТекущаяДатаСеанса());
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДвиженияКРаспределению = Пакет[Пакет.ВГраница()-1].Выгрузить();
	
	ПоляОтбораДвиженийКРаспределению = "Распоряжение,Склад,Номенклатура,Характеристика,Назначение";
	Если ИсходящаяДоставка
		Или ЕстьОрдерныйНаПоступлениеСклад Тогда
		ДвиженияКРаспределению.Индексы.Добавить(ПоляОтбораДвиженийКРаспределению);
	КонецЕсли;
	
	Выборка = Пакет[Пакет.ВГраница()].Выбрать();
	
	Пока Выборка.СледующийПоЗначениюПоля("Зона") Цикл
		
		Если ВыборочноеОбновление Тогда
			
		ИначеЕсли ЗонаГруппаИлиПустая Тогда
			ТекущаяВетка = КоллекцияРаспоряжений.Добавить();
			ТекущаяВетка.Адрес = Строка(Выборка.Зона);
			ТекущаяВетка.Зона = Выборка.Зона;
			КоллекцияТекущаяВетка = ТекущаяВетка.ПолучитьЭлементы();
		Иначе
			КоллекцияТекущаяВетка = КоллекцияРаспоряжений;
		КонецЕсли;
		
		ВесПоЗоне = 0;
		ОбъемПоЗоне = 0;
		
		Пока Выборка.СледующийПоЗначениюПоля("Распоряжение") Цикл
			
			Если ВыборочноеОбновление Тогда
				СтруктураЗонаАдрес = Новый Структура("Зона, Адрес");
				ЗаполнитьЗначенияСвойств(СтруктураЗонаАдрес, Выборка);
				ПозицияДляВставки = ПолучитьПозициюДляВставки(РаспоряженияНаДоставку, ЗонаГруппаИлиПустая, СтруктураЗонаАдрес);
				Если ЗонаГруппаИлиПустая Тогда
					ТекущаяВетка = КоллекцияРаспоряжений[ПозицияДляВставки.Зона];
					КоллекцияТекущаяВетка = ТекущаяВетка.ПолучитьЭлементы();
				Иначе
					КоллекцияТекущаяВетка = КоллекцияРаспоряжений;
				КонецЕсли;
				ПозицияДляВставки = ПозицияДляВставки.Распоряжение;
			КонецЕсли;
			
			Если Выборка.ВидРаспоряжения = Тип("ДокументСсылка.ПоручениеЭкспедитору") Тогда
				
				Если ЗначениеЗаполнено(ДатаРаспоряжений)
					И ЗначениеЗаполнено(Выборка.Дата)
					И НачалоДня(Выборка.Дата) > ДатаРаспоряжений Тогда
					Продолжить;
				КонецЕсли;
				
				Если ВыборочноеОбновление Тогда
					СтрокаРаспоряжение = КоллекцияТекущаяВетка.Вставить(ПозицияДляВставки);
					ПозицияДляВставки = ПозицияДляВставки + 1;
				Иначе
					СтрокаРаспоряжение = КоллекцияТекущаяВетка.Добавить();
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(СтрокаРаспоряжение, Выборка);
				СтрокаРаспоряжение.ПолучательОтправительПредставление = Выборка.ПолучательОтправитель;
				СтрокаРаспоряжение.Время = ДоставкаТоваровКлиентСервер.ПредставлениеВремениДоставки(Выборка.ВремяС, Выборка.ВремяПо);
				
				СтрокаДляХраненияИдентификатора = ТоварыРаспоряженийКДоставке.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДляХраненияИдентификатора, Выборка);
				СтрокаДляХраненияИдентификатора.ИдентификаторВДеревеРаспоряжений = СтрокаРаспоряжение.ПолучитьИдентификатор();
				
				Продолжить;
				
			КонецЕсли;
			
			Пока Выборка.СледующийПоЗначениюПоля("Склад") Цикл
				
				Номенклатура   = Неопределено;
				Характеристика = Неопределено;
				Назначение     = Неопределено;
				Серия          = Неопределено;
				
				ВесОбъемРаспоряженийПоДатам.Очистить();
				КешДобавляемыхСтрок.Очистить();
				ПотребностьПоТовару = 0;
				ПроверитьОтклонение = Ложь;
				
				Пока Выборка.Следующий() Цикл
					
					Если Номенклатура      <> Выборка.Номенклатура
						Или Характеристика <> Выборка.Характеристика
						Или Назначение     <> Выборка.Назначение
						Или Серия          <> Выборка.Серия Тогда
						// перешли к другому товару
						
						Номенклатура   = Выборка.Номенклатура;
						Характеристика = Выборка.Характеристика;
						Назначение     = Выборка.Назначение;
						Серия          = Выборка.Серия;
						
						Если ПроверитьОтклонение Тогда
							ДопустимоеОтклонение = ДопустимоеОтклонениеПроцент/100 * ПотребностьПоТовару;
							// Не нужно выводить строки с мерным товаром, если остаток к доставке не превысил допустимое отклонение;
							Для Каждого Стр Из КешДобавляемыхСтрок Цикл
								Если Стр.Количество <= ДопустимоеОтклонение Тогда
									ВесОбъемРаспоряженийПоДатам.Удалить(Стр);
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						КешДобавляемыхСтрок.Очистить();
						ПотребностьПоТовару = 0;
						
						ПроверитьОтклонение = Выборка.МернаяЕдиницаИзмерения И ДопустимоеОтклонениеПроцент > 0;
						
					КонецЕсли;
					
					Если ИсходящаяДоставка Тогда
						
						ОсталосьРаспределить = Выборка.Количество;
						
						ПараметрыОтбора = Новый Структура(ПоляОтбораДвиженийКРаспределению);
						ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Выборка);
						ДетальныеДанные = ДвиженияКРаспределению.НайтиСтроки(ПараметрыОтбора);
						Для Каждого СтрокаДетальныхДанных Из ДетальныеДанные Цикл
							Списываем = Мин(ОсталосьРаспределить, СтрокаДетальныхДанных.Количество);
							ОсталосьРаспределить = ОсталосьРаспределить - Списываем;
							СтрокаДетальныхДанных.Количество = СтрокаДетальныхДанных.Количество - Списываем;
							
							Если ОсталосьРаспределить = 0 Тогда
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
						Если ОсталосьРаспределить > 0 Тогда
							ТекущаяСтрокаВесОбъем = ВесОбъемРаспоряженийПоДатам.Добавить();
							ЗаполнитьЗначенияСвойств(ТекущаяСтрокаВесОбъем, Выборка);
							ТекущаяСтрокаВесОбъем.Количество = ОсталосьРаспределить;
							ТекущаяСтрокаВесОбъем.Вес = ОсталосьРаспределить * (Выборка.Вес / Выборка.Количество);
							ТекущаяСтрокаВесОбъем.Объем = ОсталосьРаспределить * (Выборка.Объем / Выборка.Количество);
							
							КешДобавляемыхСтрок.Добавить(ТекущаяСтрокаВесОбъем);
							ПотребностьПоТовару = ПотребностьПоТовару + ОсталосьРаспределить;
						КонецЕсли;
						
					ИначеЕсли Не ЕстьОрдерныйНаПоступлениеСклад Тогда
						
						ТекущаяСтрокаВесОбъем = ВесОбъемРаспоряженийПоДатам.Добавить();
						ЗаполнитьЗначенияСвойств(ТекущаяСтрокаВесОбъем, Выборка);
						КешДобавляемыхСтрок.Добавить(ТекущаяСтрокаВесОбъем);
						ПотребностьПоТовару = ПотребностьПоТовару + Выборка.Количество;
						
					Иначе
						
						ПараметрыОтбора = Новый Структура(ПоляОтбораДвиженийКРаспределению);
						ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Выборка);
						ДетальныеДанные = ДвиженияКРаспределению.НайтиСтроки(ПараметрыОтбора);
						
						ОсталосьРаспределить = Выборка.Количество;
						// Распределение товаров по датам поступления;
						Для Каждого СтрокаДетальныхДанных Из ДетальныеДанные Цикл
							
							Списываем = Мин(ОсталосьРаспределить, СтрокаДетальныхДанных.Количество);
							ОсталосьРаспределить = ОсталосьРаспределить - Списываем;
							
							ТекущаяСтрокаВесОбъем = ВесОбъемРаспоряженийПоДатам.Добавить();
							ЗаполнитьЗначенияСвойств(ТекущаяСтрокаВесОбъем, Выборка,,"Количество,Вес,Объем");
							ТекущаяСтрокаВесОбъем.Дата = СтрокаДетальныхДанных.Период;
							ТекущаяСтрокаВесОбъем.Количество = Списываем;
							ТекущаяСтрокаВесОбъем.Вес = Списываем * СтрокаДетальныхДанных.Вес / СтрокаДетальныхДанных.Количество;
							ТекущаяСтрокаВесОбъем.Объем = Списываем * СтрокаДетальныхДанных.Объем / СтрокаДетальныхДанных.Количество;
							КешДобавляемыхСтрок.Добавить(ТекущаяСтрокаВесОбъем);
							
							Если ОсталосьРаспределить <= 0 Тогда
								Прервать;
							КонецЕсли;
							
						КонецЦикла;
						
						Если ОсталосьРаспределить > 0 Тогда
							ТекущаяСтрокаВесОбъем = ВесОбъемРаспоряженийПоДатам.Добавить();
							ЗаполнитьЗначенияСвойств(ТекущаяСтрокаВесОбъем, Выборка,,"Количество,Вес,Объем");
							ТекущаяСтрокаВесОбъем.Дата = НачалоДня(ТекущаяДатаСеанса());
							ТекущаяСтрокаВесОбъем.Количество = ОсталосьРаспределить;
							ТекущаяСтрокаВесОбъем.Вес = ОсталосьРаспределить 	* Выборка.Вес 	/ Выборка.Количество;
							ТекущаяСтрокаВесОбъем.Объем = ОсталосьРаспределить 	* Выборка.Объем / Выборка.Количество;
							КешДобавляемыхСтрок.Добавить(ТекущаяСтрокаВесОбъем);
						КонецЕсли;
						ПотребностьПоТовару = ПотребностьПоТовару + Выборка.Количество;
					КонецЕсли;
				КонецЦикла;
				
				// Нужно проверить последний добавленный товар распоряжения;
				Если ПроверитьОтклонение Тогда
					ДопустимоеОтклонение = ДопустимоеОтклонениеПроцент/100 * ПотребностьПоТовару;
					// Не нужно выводить строки с мерным товаром, если остаток к доставке не превысил допустимое отклонение;
					Для Каждого Стр Из КешДобавляемыхСтрок Цикл
						Если Стр.Количество <= ДопустимоеОтклонение Тогда
							ВесОбъемРаспоряженийПоДатам.Удалить(Стр);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				ВесОбъемРаспоряженийПоДатам.Сортировать("Дата");
				
				ТекущаяДата = Неопределено;
				
				Для Каждого СтрокаВесОбъемДата Из ВесОбъемРаспоряженийПоДатам Цикл
					
					Если ЗначениеЗаполнено(ДатаРаспоряжений)
						И СтрокаВесОбъемДата.Дата > ДатаРаспоряжений Тогда
						Прервать;
					КонецЕсли;
					
					СтрокаТовар = ТоварыРаспоряженийКДоставке.Добавить();
					
					Если ВыводитьВсе Тогда
						СтрокаТовар = ТоварыРаспоряженийКДоставке.Добавить();
					Иначе 
						//РИВ
						Если ТипЗнч(Выборка.Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда	
							
							//Если ПолучитьРазрешениеНаПоставку(Выборка.Распоряжение, Выборка.Назначение, Выборка.Номенклатура, Выборка.Характеристика) Тогда
							Если ПолучитьРазрешениеНаПоставку(Выборка.Распоряжение, Выборка.Назначение, СтрокаВесОбъемДата.Номенклатура, СтрокаВесОбъемДата.Характеристика) Тогда
								СтрокаТовар = ТоварыРаспоряженийКДоставке.Добавить();
							Иначе
								Продолжить;
							КонецЕсли; 
							
						Иначе 
							//РИВ	
							//Если ПолучитьРащрешениеНаОтгрузку(Выборка.Распоряжение, Выборка.Назначение, Выборка.Номенклатура, Выборка.Характеристика) Тогда
							Если ПолучитьРазрешениеНаОтгрузку(Выборка.Распоряжение, Выборка.Назначение, СтрокаВесОбъемДата.Номенклатура, СтрокаВесОбъемДата.Характеристика) Тогда
								СтрокаТовар = ТоварыРаспоряженийКДоставке.Добавить();
							Иначе
								Продолжить;
							КонецЕсли; 
							
						КонецЕсли;
						
					КонецЕсли;	
					
					ЗаполнитьЗначенияСвойств(СтрокаТовар, Выборка);
					ЗаполнитьЗначенияСвойств(СтрокаТовар, СтрокаВесОбъемДата);
					
					Если ТекущаяДата <> СтрокаВесОбъемДата.Дата Тогда
						
						ТекущаяДата = СтрокаВесОбъемДата.Дата;
						
						Если ВыборочноеОбновление Тогда
							СтрокаРаспоряжение = КоллекцияТекущаяВетка.Вставить(ПозицияДляВставки);
							ПозицияДляВставки = ПозицияДляВставки + 1;                                  
						Иначе
							СтрокаРаспоряжение = КоллекцияТекущаяВетка.Добавить();
						КонецЕсли;
						
						ЗаполнитьЗначенияСвойств(СтрокаРаспоряжение, Выборка);						
						//РИВ
						Если ТипЗнч(Выборка.Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда	
		 				 
							//ВремПерем = _ДоработкиСлужебный.ПолучитьИнформациюПоРасходномуОрдеру(Выборка.Распоряжение, Выборка.Назначение, Выборка.Номенклатура, Выборка.Характеристика, , Истина);
							ВремПерем = _ДоработкиСлужебный.ПолучитьИнформациюПоРасходномуОрдеру(Выборка.Распоряжение, Выборка.Назначение, СтрокаВесОбъемДата.Номенклатура, СтрокаВесОбъемДата.Характеристика, , Истина);
							Если НЕ ЗначениеЗаполнено(ВремПерем) Тогда
								Продолжить;
							КонецЕсли;
							Ордер = ВремПерем.ЗаявкаНаДоставку;
							Если НЕ ВремПерем = Неопределено Тогда
								Машина = ВремПерем.СпособДоставки;
								СтрокаРаспоряжение.ТипТранспортногоСредства = Машина;
							КонецЕсли;
							
							//Максимов
							//Для Каждого Стр Из ВремПерем.Ссылка._ЗаявкаНаДоставку.Заказы Цикл //под вопросом
							Для Каждого Стр Из Ордер.Заказы Цикл
								
								СтрокаРаспоряжение.НужныДокументы = Стр.НужныДокументы;
								
							КонецЦикла;	
							//********  
							
						ИначеЕсли ТипЗнч(Выборка.Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда 	
							
							Ордер = _ДоработкиСлужебный.ВернутьЗаявкаНаДоставкуНомер(Выборка.Распоряжение, Выборка.СпособДоставки);  
							
							Если ЗначениеЗаполнено(Ордер) Тогда
								
								СсылкаНаДоверен = ОбновитьИнформациюОДоверенности(Ордер.Ссылка);
								
								Если ЗначениеЗаполнено(СсылкаНаДоверен) Тогда
									
									СтрокаРаспоряжение.Доверенность = СсылкаНаДоверен;
									СтрокаРаспоряжение.ДоверенностьПризнак = СсылкаНаДоверен.Проведен;
									
								КонецЕсли;
								
							КонецЕсли;
							//Если НЕ ЗначениеЗаполнено(Ордер) Тогда                     
							//	Продолжить;
							//КонецЕсли;
							
							//Если НЕ ОрдерПоЗаказуПоставщику = Неопределено Тогда
							//	Машина = ОрдерПоЗаказуПоставщику.СпособДоставки;
							//	СтрокаРаспоряжение.ТипТранспортногоСредства = Машина;
							//КонецЕсли;
							//
							////Максимов
							//Для Каждого Стр Из ОрдерПоЗаказуПоставщику.Ссылка._ЗаявкаНаДоставку.Заказы Цикл
							//	
							//	СтрокаРаспоряжение.НужныДокументы = Стр.НужныДокументы;
							//	
							//КонецЦикла;	
							////********  							
						КонецЕсли;
						//РИВ
						
						Если СтрокаРаспоряжение.Свойство("АдресДоставкиЗначенияПолей") Тогда
							СтрокаРаспоряжение.АдресДоставкиЗначенияПолей = Выборка.АдресЗначенияПолей;
						КонецЕсли;
						
						СтрокаРаспоряжение.Дата = ТекущаяДата;
						СтрокаРаспоряжение.Вес = 0;
						СтрокаРаспоряжение.Объем = 0;
						
						СтрокаРаспоряжение.ПолучательОтправительПредставление = ДоставкаТоваровКлиентСервер.ПредставлениеПолучателяОтправителя(Выборка.ПолучательОтправитель, Выборка.Перевозчик, Форма.ВидДоставки);
						СтрокаРаспоряжение.Время = ДоставкаТоваровКлиентСервер.ПредставлениеВремениДоставки(Выборка.ВремяС, Выборка.ВремяПо);
						
						ИдентификаторВДеревеРаспоряжений = СтрокаРаспоряжение.ПолучитьИдентификатор();
						
					КонецЕсли;
					
					СтрокаТовар.ИдентификаторВДеревеРаспоряжений = ИдентификаторВДеревеРаспоряжений;
					
					СтрокаРаспоряжение.Вес = СтрокаРаспоряжение.Вес + СтрокаВесОбъемДата.Вес;
					СтрокаРаспоряжение.Объем = СтрокаРаспоряжение.Объем + СтрокаВесОбъемДата.Объем;
					
					ВесПоЗоне   = ВесПоЗоне   + СтрокаВесОбъемДата.Вес;
					ОбъемПоЗоне = ОбъемПоЗоне + СтрокаВесОбъемДата.Объем;

					//РИВ
					Если ЗначениеЗаполнено(Ордер) Тогда 
						СтрокаРаспоряжение.ЗаявкаНаДоставку	     = ?(ЗначениеЗаполнено(Ордер), Ордер, "");
						СтрокаРаспоряжение.ЗаявкаНаДоставкуНомер = ?(ЗначениеЗаполнено(Ордер.Номер), Ордер.Номер, "");
						СтрокаРаспоряжение.ОсобыеУсловияПеревозки = Ордер.ОсобыеУсловияПеревозки; 
						Если Ордер.ОсобыеУсловияПеревозки Тогда
							СтрокаРаспоряжение.ОсобыеУсловияПеревозкиОписание = ?(ЗначениеЗаполнено(Ордер.ОсобыеУсловияПеревозкиОписание), Ордер.ОсобыеУсловияПеревозкиОписание, "");
						КонецЕсли; 
						СтрокаРаспоряжение.ДополнительнаяИнформация = ?(ЗначениеЗаполнено(Ордер.ДополнительнаяИнформацияПоДоставке), Ордер.ДополнительнаяИнформацияПоДоставке, "");
						Если ЗначениеЗаполнено(Ордер.АдресДоставки) Тогда
							СтрокаРаспоряжение.Адрес = Ордер.АдресДоставки;
						КонецЕсли;
					КонецЕсли;
					//РИВ
					
				КонецЦикла;
				
			КонецЦикла; // Склад
		КонецЦикла; // Распоряжение
		
		Если Не ВыборочноеОбновление Тогда
			ВесОбъем.ИтогоВес = ВесОбъем.ИтогоВес + ВесПоЗоне;
			ВесОбъем.ИтогоОбъем = ВесОбъем.ИтогоОбъем  + ОбъемПоЗоне;
		КонецЕсли;
		
		Если ЗонаГруппаИлиПустая Тогда
			
			Если КоллекцияТекущаяВетка.Количество() = 0 Тогда
				КоллекцияРаспоряжений.Удалить(ТекущаяВетка);
			Иначе
				Если ВыборочноеОбновление Тогда
					ТекущаяВетка.Вес   = ТекущаяВетка.Вес + ВесПоЗоне;
					ТекущаяВетка.Объем = ТекущаяВетка.Объем + ОбъемПоЗоне;
				Иначе
					ТекущаяВетка.Вес   = ВесПоЗоне;
					ТекущаяВетка.Объем = ОбъемПоЗоне;
				КонецЕсли;
				ТекущаяВетка.ОформлениеСтроки = 5;
				ТекущаяВетка.Зона = Выборка.Зона;
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла; // Зона
	
	ЗаполнитьЗначенияСвойств(Форма, ВесОбъем);
	ДоставкаТоваров.ЗаполнитьПризнакиОформленияРаспоряжений(РаспоряженияНаДоставку, ЗонаГруппаИлиПустая);
	
КонецПроцедуры


Функция ОбновитьИнформациюОДоверенности(СсылкаНаЗаявку)
	
	//Если ( Объект.Ссылка.Пустая() ) Тогда 
	//	ЭтаФорма.ТекстДоверенность = "Для создания доверенности запишите документ";
	//	Возврат;
	//КонецЕсли;	
	
	//Если НЕ ( Объект._ВидЗаявки = Перечисления._ВидыЗаявки.ОтПоставщика )	Тогда
	//	ЭтаФорма.ТекстДоверенность = "Доверенность создается если вид заявки - от поставщика ";
	//	Возврат;
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоверенностьВыданная.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ДоверенностьВыданная КАК ДоверенностьВыданная
	               |ГДЕ
	               |	ДоверенностьВыданная._ЗаявкаНаДоставку = &_ЗаявкаНаДоставку"; 
	Запрос.УстановитьПараметр("_ЗаявкаНаДоставку", СсылкаНаЗаявку);
	Результат = Запрос.Выполнить();
	Если НЕ ( Результат.Пустой() ) Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.Ссылка;
	//	ЭтаФорма.ТекстДоверенность = Строка( Выборка.Ссылка );
	//	ЭтаФорма.ДоверенностьВыданная = Выборка.Ссылка;  
	//Иначе
	//	ЭтаФорма.ТекстДоверенность = "Ввести доверенность";
	КонецЕсли;     
	
	
КонецФункции


