
&ИзменениеИКонтроль("ПоказатьПредупреждениеБезопасности")
Процедура Кт_ПоказатьПредупреждениеБезопасности(Оповещение, ВидПредупреждения, ДополнительныйПараметр)
	
	Если Не ПользователиСлужебныйКлиентСервер.ВидыПредупрежденийБезопасности().Свойство(ВидПредупреждения) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неверное значение параметра %1 в процедуре %2:
			           |""%3"".'"),
			"ВидПредупреждения",
			"ПользователиСлужебныйКлиент.ПоказатьПредупреждениеБезопасности",
			ВидПредупреждения);
		ВызватьИсключение(ТекстОшибки, КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ВидПредупреждения);
	ПараметрыФормы.Вставить("ДополнительныйПараметр", ДополнительныйПараметр);
	
	ОткрытьФорму("ОбщаяФорма.ПредупреждениеБезопасности", ПараметрыФормы,,,,, Оповещение);
	
КонецПроцедуры
