
&НаСервере
&Вместо("ОбъектыПоКритериюОтбора")
Функция Расш1_ОбъектыПоКритериюОтбора(ЗначениеКритерияОтбора)
	
	//Результат = ПродолжитьВызов(ЗначениеКритерияОтбора);
 
	// делаем примеси для включения реквизитов расширения
	УстановитьПривилегированныйРежим(Истина);
	 
	Если ТипЗнч(ЗначениеКритерияОтбора) = Тип("ДокументСсылка._ЗаявкаНаДоставку") Тогда
	 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ЗначениеКритерияОтбора);
	  
		Запрос.Текст = 
		"ВЫБРАТЬ
		| ЗаказКлиента.Ссылка КАК Ссылка
		|ИЗ
		| Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		| ЗаказКлиента._ЗаявкаНаДоставку = &ЗначениеКритерияОтбора";
	  
		//ОбщегоНазначенияКлиентСервер.
		//ДополнитьТаблицу(Запрос.Выполнить().Выгрузить(), Результат);
		Возврат Запрос.Выполнить().Выгрузить();
		
	ИначеЕсли ТипЗнч(ЗначениеКритерияОтбора) = Тип("ДокументСсылка.ЗаявкаНаЗакупку") Тогда	
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ЗначениеКритерияОтбора);
	  
		Запрос.Текст = 
		"ВЫБРАТЬ
		| ЗаявкаНаЗакупку.Ссылка КАК Ссылка
		|ИЗ
		| Документ.ЗаявкаНаЗакупку КАК ЗаявкаНаЗакупку
		|ГДЕ
		| ЗаявкаНаЗакупку.Ссылка = &ЗначениеКритерияОтбора";
		
		ТабЗнач = Новый ТаблицаЗначений;
		
		Возврат ТабЗнач;//Запрос.Выполнить().Выгрузить();			
			
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СвязанныеДокументы.Ссылка
		|ИЗ
		|	КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СвязанныеДокументы";
		
		Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ЗначениеКритерияОтбора);
		Возврат Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
 
	//Возврат Результат;	
	
КонецФункции

&НаСервере
&Вместо("ВывестиПредставлениеИКартинку")
Процедура Расш1_ВывестиПредставлениеИКартинку(СтрокаДерева, Макет, ЭтоТекущийОбъект, ЭтоПодчиненный)
	
	Попытка
		МетаданныеОбъекта = СтрокаДерева.Ссылка.Метаданные();	
		ЭтоДокумент       = ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта);
	
		ЕстьРодителиСуммарно = _ДеревоРодительскиеОбъекты.ПолучитьЭлементы().Количество() > 0;
		ЕстьПодчиненныеСуммарно = _ДеревоПодчиненныеОбъекты.ПолучитьЭлементы().Количество() > 0;
		ЕстьПодчиненные = ТипЗнч(СтрокаДерева) = Тип("ДанныеФормыЭлементДерева")
			И СтрокаДерева.ПолучитьЭлементы().Количество() > 0;
		
		// Вывод картинки
		Если СтрокаДерева.Проведен Тогда
			Если ЭтоТекущийОбъект Тогда
				Если ЕстьПодчиненныеСуммарно И ЕстьРодителиСуммарно Тогда
					ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведенКоннекторВерхНиз");
				ИначеЕсли ЕстьПодчиненныеСуммарно Тогда
					ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведенКоннекторНиз");
				Иначе
					ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведенКоннекторВерх");
				КонецЕсли;
			ИначеЕсли ЭтоПодчиненный = Истина Тогда
				Если ЕстьПодчиненные Тогда
					ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведенКоннекторЛевоНиз");
				Иначе
					ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведен");
				КонецЕсли;
			Иначе
				Если ЕстьПодчиненные Тогда
					ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведенКоннекторЛевоВерх");
				Иначе
					ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведен");
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли СтрокаДерева.ПометкаУдаления Тогда
			Если ЭтоТекущийОбъект Тогда
				Если ЕстьПодчиненныеСуммарно И ЕстьРодителиСуммарно  Тогда
					ИмяОбласти = ?(ЭтоДокумент, "ДокументПомеченНаУдалениеКоннекторВерхНиз", "СправочникПВХПомеченНаУдалениеКоннекторВерхНиз");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				ИначеЕсли ЕстьПодчиненныеСуммарно Тогда
					ИмяОбласти = ?(ЭтоДокумент, "ДокументПомеченНаУдалениеКоннекторНиз", "СправочникПВХПомеченНаУдалениеКоннекторНиз");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				Иначе
					ИмяОбласти = ?(ЭтоДокумент, "ДокументПомеченНаУдалениеКоннекторВерх", "СправочникПВХПомеченНаУдалениеКоннекторВерх");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				КонецЕсли;
			ИначеЕсли ЭтоПодчиненный = Истина Тогда
				Если ЕстьПодчиненные Тогда
					ИмяОбласти = ?(ЭтоДокумент, "ДокументПомеченНаУдалениеКоннекторЛевоНиз", "СправочникПВХПомеченНаУдалениеКоннекторЛевоНиз");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				Иначе
					ИмяОбласти = ?(ЭтоДокумент, "ДокументПомеченНаУдаление", "СправочникПВХПомеченНаУдалениеКоннекторЛево");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				КонецЕсли;
			Иначе
				Если ЕстьПодчиненные Тогда
					ИмяОбласти = ?(ЭтоДокумент, "ДокументПомеченНаУдалениеКоннекторЛевоВерх", "СправочникПВХПомеченНаУдалениеКоннекторЛевоВерх");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				Иначе
					ИмяОбласти = ?(ЭтоДокумент, "ДокументПомеченНаУдаление", "СправочникПВХПомеченНаУдалениеКоннекторЛево");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если ЭтоТекущийОбъект Тогда
				Если ЕстьПодчиненныеСуммарно И ЕстьРодителиСуммарно Тогда
					ИмяОбласти = ?(ЭтоДокумент, "ДокументЗаписанКоннекторВерхНиз", "СправочникПВХКоннекторВерхНиз");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				ИначеЕсли ЕстьПодчиненныеСуммарно Тогда
					ИмяОбласти = ?(ЭтоДокумент, "ДокументЗаписанКоннекторНиз", "СправочникПВХКоннекторНиз");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				Иначе
					ИмяОбласти = ?(ЭтоДокумент, "ДокументЗаписанКоннекторВерх", "СправочникПВХКоннекторВерх");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				КонецЕсли;
			ИначеЕсли ЭтоПодчиненный = Истина Тогда
				Если ЕстьПодчиненные Тогда
					ИмяОбласти = ?(ЭтоДокумент, "ДокументЗаписанКоннекторЛевоНиз", "СправочникПВХКоннекторЛевоНиз");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				Иначе
					ИмяОбласти = ?(ЭтоДокумент, "ДокументЗаписан", "СправочникПВХКоннекторЛево");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				КонецЕсли;
			Иначе
				Если ЕстьПодчиненные Тогда
					ИмяОбласти = ?(ЭтоДокумент, "ДокументЗаписанКоннекторЛевоВерх", "СправочникПВХКоннекторЛевоВерх");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				Иначе
					ИмяОбласти = ?(ЭтоДокумент, "ДокументЗаписан", "СправочникПВХКоннекторЛево");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтоТекущийОбъект Тогда
			ТаблицаОтчета.Вывести(ОбластьКартинка) 
		Иначе
			ТаблицаОтчета.Присоединить(ОбластьКартинка);
		КонецЕсли;
		
		// Вывод объекта
		ОбластьОбъект = Макет.ПолучитьОбласть(?(ЭтоТекущийОбъект, "ТекущийОбъект", "Объект"));
		ОбластьОбъект.Параметры.ПредставлениеОбъекта = СтрокаДерева.Представление;
		ОбластьОбъект.Параметры.Объект = СтрокаДерева.Ссылка;
		ТаблицаОтчета.Присоединить(ОбластьОбъект);
		
	Исключение	
		
		ЭтоДокумент       = Истина;
		
		ЕстьРодителиСуммарно = _ДеревоРодительскиеОбъекты.ПолучитьЭлементы().Количество() > 0;
		ЕстьПодчиненныеСуммарно = _ДеревоПодчиненныеОбъекты.ПолучитьЭлементы().Количество() > 0;
		ЕстьПодчиненные = ТипЗнч(СтрокаДерева) = Тип("ДанныеФормыЭлементДерева")
			И СтрокаДерева.ПолучитьЭлементы().Количество() > 0;
			
		// Вывод картинки
		Если СтрокаДерева.Проведен Тогда
			Если ЭтоТекущийОбъект Тогда
				Если ЕстьПодчиненныеСуммарно И ЕстьРодителиСуммарно Тогда
					ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведенКоннекторВерхНиз");
				ИначеЕсли ЕстьПодчиненныеСуммарно Тогда
					ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведенКоннекторНиз");
				Иначе
					ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведенКоннекторВерх");
				КонецЕсли;
			ИначеЕсли ЭтоПодчиненный = Истина Тогда
				Если ЕстьПодчиненные Тогда
					ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведенКоннекторЛевоНиз");
				Иначе
					ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведен");
				КонецЕсли;
			Иначе
				Если ЕстьПодчиненные Тогда
					ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведенКоннекторЛевоВерх");
				Иначе
					ОбластьКартинка = Макет.ПолучитьОбласть("ДокументПроведен");
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли СтрокаДерева.ПометкаУдаления Тогда
			Если ЭтоТекущийОбъект Тогда
				Если ЕстьПодчиненныеСуммарно И ЕстьРодителиСуммарно  Тогда
					ИмяОбласти = ?(ЭтоДокумент, "ДокументПомеченНаУдалениеКоннекторВерхНиз", "СправочникПВХПомеченНаУдалениеКоннекторВерхНиз");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				ИначеЕсли ЕстьПодчиненныеСуммарно Тогда
					ИмяОбласти = ?(ЭтоДокумент, "ДокументПомеченНаУдалениеКоннекторНиз", "СправочникПВХПомеченНаУдалениеКоннекторНиз");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				Иначе
					ИмяОбласти = ?(ЭтоДокумент, "ДокументПомеченНаУдалениеКоннекторВерх", "СправочникПВХПомеченНаУдалениеКоннекторВерх");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				КонецЕсли;
			ИначеЕсли ЭтоПодчиненный = Истина Тогда
				Если ЕстьПодчиненные Тогда
					ИмяОбласти = ?(ЭтоДокумент, "ДокументПомеченНаУдалениеКоннекторЛевоНиз", "СправочникПВХПомеченНаУдалениеКоннекторЛевоНиз");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				Иначе
					ИмяОбласти = ?(ЭтоДокумент, "ДокументПомеченНаУдаление", "СправочникПВХПомеченНаУдалениеКоннекторЛево");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				КонецЕсли;
			Иначе
				Если ЕстьПодчиненные Тогда
					ИмяОбласти = ?(ЭтоДокумент, "ДокументПомеченНаУдалениеКоннекторЛевоВерх", "СправочникПВХПомеченНаУдалениеКоннекторЛевоВерх");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				Иначе
					ИмяОбласти = ?(ЭтоДокумент, "ДокументПомеченНаУдаление", "СправочникПВХПомеченНаУдалениеКоннекторЛево");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если ЭтоТекущийОбъект Тогда
				Если ЕстьПодчиненныеСуммарно И ЕстьРодителиСуммарно Тогда
					ИмяОбласти = ?(ЭтоДокумент, "ДокументЗаписанКоннекторВерхНиз", "СправочникПВХКоннекторВерхНиз");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				ИначеЕсли ЕстьПодчиненныеСуммарно Тогда
					ИмяОбласти = ?(ЭтоДокумент, "ДокументЗаписанКоннекторНиз", "СправочникПВХКоннекторНиз");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				Иначе
					ИмяОбласти = ?(ЭтоДокумент, "ДокументЗаписанКоннекторВерх", "СправочникПВХКоннекторВерх");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				КонецЕсли;
			ИначеЕсли ЭтоПодчиненный = Истина Тогда
				Если ЕстьПодчиненные Тогда
					ИмяОбласти = ?(ЭтоДокумент, "ДокументЗаписанКоннекторЛевоНиз", "СправочникПВХКоннекторЛевоНиз");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				Иначе
					ИмяОбласти = ?(ЭтоДокумент, "ДокументЗаписан", "СправочникПВХКоннекторЛево");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				КонецЕсли;
			Иначе
				Если ЕстьПодчиненные Тогда
					ИмяОбласти = ?(ЭтоДокумент, "ДокументЗаписанКоннекторЛевоВерх", "СправочникПВХКоннекторЛевоВерх");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				Иначе
					ИмяОбласти = ?(ЭтоДокумент, "ДокументЗаписан", "СправочникПВХКоннекторЛево");
					ОбластьКартинка = Макет.ПолучитьОбласть(ИмяОбласти);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;			
		
		Если ЭтоТекущийОбъект Тогда
			ТаблицаОтчета.Вывести(ОбластьКартинка) 
		Иначе
			ТаблицаОтчета.Присоединить(ОбластьКартинка);
		КонецЕсли;
		
		// Вывод объекта
		ОбластьОбъект = Макет.ПолучитьОбласть(?(ЭтоТекущийОбъект, "ТекущийОбъект", "Объект"));
		ОбластьОбъект.Параметры.ПредставлениеОбъекта = СтрокаДерева.Представление;
		ОбластьОбъект.Параметры.Объект = СтрокаДерева.Представление;
		ТаблицаОтчета.Присоединить(ОбластьОбъект);
		
	КонецПопытки;
		
КонецПроцедуры

&НаСервере
&Вместо("ДобавитьСтрокуВДерево")
Функция Расш1_ДобавитьСтрокуВДерево(Родитель, Данные, ВыведенныеОбъекты, ЭтоПодчиненный)
	
	УстановитьЧастотуВыводаОбъекта(Данные.Ссылка, ВыведенныеОбъекты, ЭтоПодчиненный);
	
	Если Не ВыводитьТекущийОбъект(Родитель, Данные.Ссылка, ВыведенныеОбъекты, ЭтоПодчиненный) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	НоваяСтрока = Родитель.ПолучитьЭлементы().Добавить();
	ОбщиеСвойства = "Ссылка, Представление, СуммаДокумента, Валюта, Проведен, ПометкаУдаления";
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Данные, ОбщиеСвойства);
	
	Попытка
		Если НоваяСтрока.Ссылка = Неопределено Тогда
			//НовыйТип = "ДокументСсылка._ЗаявкаНаДоставку";
			//НоваяСтрока.Ссылка = Новый ОписаниеТипов(НовыйТип);
			НоваяСтрока.Ссылка = Данные.Ссылка;
		КонецЕсли;
	Исключение
	КонецПопытки;	
	
	ПереопределенноеПредставление = ПредставлениеОбъектаДляВывода(Данные);
	Если ПереопределенноеПредставление <> Неопределено Тогда
		НоваяСтрока.Представление = ПереопределенноеПредставление;
	Иначе
		НоваяСтрока.Представление = ПредставлениеОбъектаДляВыводаВОтчет(Данные);
	КонецЕсли;
	
	Возврат НоваяСтрока;
	
	
КонецФункции

&НаСервере
&Вместо("ВывестиТабличныйДокумент")
Процедура Расш1_ВывестиТабличныйДокумент()
	
	ТаблицаОтчета.Очистить();
	
	Макет = ПолучитьОбщийМакет("Компит_СтруктураПодчиненности");
	
	ВывестиРодительскиеЭлементыДерева(_ДеревоРодительскиеОбъекты.ПолучитьЭлементы(), Макет);
	ВывестиТекущийОбъект(Макет);
	ВывестиПодчиненныеЭлементыДерева(_ДеревоПодчиненныеОбъекты.ПолучитьЭлементы(), Макет);
	
КонецПроцедуры

&НаСервере
&Вместо("ВыводитьВертикальныйКоннектор")
Функция Расш1_ВыводитьВертикальныйКоннектор(УровеньВверх, СтрокаДерева, ИщемСредиПодчиненных)

	ТекущаяСтрока = СтрокаДерева;
	
	Для инд = 1 По УровеньВверх Цикл
		
		ТекущаяСтрока = ТекущаяСтрока.ПолучитьРодителя();
		Если инд = УровеньВверх Тогда
			ИскомыйРодитель = ТекущаяСтрока;
		ИначеЕсли инд = (УровеньВверх-1) Тогда
			ИскомаяСтрока = ТекущаяСтрока;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИскомыйРодитель = Неопределено Тогда
		Если ИщемСредиПодчиненных Тогда
			ПодчиненныеЭлементыРодителя =  _ДеревоПодчиненныеОбъекты.ПолучитьЭлементы(); 
		Иначе
			ПодчиненныеЭлементыРодителя =  _ДеревоРодительскиеОбъекты.ПолучитьЭлементы();
		КонецЕсли;
	Иначе
		ПодчиненныеЭлементыРодителя =  ИскомыйРодитель.ПолучитьЭлементы(); 
	КонецЕсли;
	
	Возврат ПодчиненныеЭлементыРодителя.Индекс(ИскомаяСтрока) < (ПодчиненныеЭлементыРодителя.Количество()-1);
	
КонецФункции

&НаСервере
&Вместо("СформироватьДеревьяДокументов")
Процедура Расш1_СформироватьДеревьяДокументов()
	
	_ДеревоРодительскиеОбъекты.ПолучитьЭлементы().Очистить();
	_ДеревоПодчиненныеОбъекты.ПолучитьЭлементы().Очистить();
	
	ВыведенныеОбъекты = Новый Соответствие;
	
	ВывестиРодительскиеОбъекты(ОсновнойОбъект, _ДеревоРодительскиеОбъекты, ВыведенныеОбъекты);
	ВывестиПодчиненныеОбъекты(ОсновнойОбъект, _ДеревоПодчиненныеОбъекты, ВыведенныеОбъекты);
	
КонецПроцедуры

