
#Область ПечатьУПД

&НаКлиенте
Процедура СоздатьДокументыПечатиУПД(МассивДокументов, ПараметрыОткрытия) Экспорт
	
	Если МассивДокументов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресХранилища	 = _ОбработкаДоставкиТоваровКлиентСервер.ПечатьУПДКлиентСервер(МассивДокументов);
	МассивСФ		 = ПолучитьИзВременногоХранилища( АдресХранилища );
	
	_ОбработкаДоставкиТоваровКлиент.ВызовКомандыПечатьУПДКлиент(МассивСФ);
	
КонецПроцедуры // СоздатьЗаказПоставщикуНаОснованииПоГруппеСкладовПослеВыбораСклада()

&НаКлиенте
Процедура ВызовКомандыПечатьУПДКлиент(МассивДокументов) Экспорт
	
	ИмяМенеджераПечати	= "Обработка.ПечатьОбщихФорм";
	ИменаМакетов		= "УПД";
	МассивОбъектов		= Новый Массив;
	Для Каждого ТекДокумент Из МассивДокументов Цикл
		МассивОбъектов.Добавить(ТекДокумент.Ссылка)
	КонецЦикла;		// ТетДокумент
	ВладелецФормы		= Неопределено;
	Картинка			= Новый Картинка;
	
	ТипыОбъектовПечати  = Новый Массив;
	ТипыОбъектовПечати.Добавить(ТипЗнч(МассивОбъектов[0])); 
	
	ПараметрыПечати		= Новый Структура();
	ПараметрыПечати.Вставить("ДополнительныеПараметры",						Новый Структура("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь));
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами",	Ложь);
	ПараметрыПечати.Вставить("ЗаголовокФормы", 								"");
	ПараметрыПечати.Вставить("Идентификатор", 								"УПД");
	ПараметрыПечати.Вставить("ИмяКомандыНаФорме", 							"");
	ПараметрыПечати.Вставить("Картинка", 									Картинка);
	ПараметрыПечати.Вставить("МенеджерПечати", 								"Обработка.ПечатьОбщихФорм");
	ПараметрыПечати.Вставить("МестоРазмещения", 							"");
	ПараметрыПечати.Вставить("НеВыполнятьЗаписьВФорме", 					Истина);
	ПараметрыПечати.Вставить("Обработчик", 									"");
	ПараметрыПечати.Вставить("ОбъектыПечати", 								МассивОбъектов);
	ПараметрыПечати.Вставить("Отключена", 									Ложь);
	ПараметрыПечати.Вставить("ПереопределитьПользовательскиеНастройкиКоличества", Ложь);
	ПараметрыПечати.Вставить("Порядок", 									50);
	ПараметрыПечати.Вставить("Представление", 								"Универсальный передаточный документ (УПД)");
	ПараметрыПечати.Вставить("ПроверкаПроведенияПередПечатью", 				Истина);
	ПараметрыПечати.Вставить("СкрытаФункциональнымиОпциями", 				Ложь);
	ПараметрыПечати.Вставить("СписокФорм", 									"");
	ПараметрыПечати.Вставить("СразуНаПринтер", 								Ложь);
	ПараметрыПечати.Вставить("ТипыОбъектовПечати", 							ТипыОбъектовПечати);
	ПараметрыПечати.Вставить("ТребуетсяРасширениеРаботыСФайлами", 			Ложь);
	ПараметрыПечати.Вставить("УникальныйИдентификатор", 					Новый УникальныйИдентификатор);
	ПараметрыПечати.Вставить("УсловияВидимости", 							Новый Массив);
	ПараметрыПечати.Вставить("ФиксированныйКомплект", 						Ложь);
	ПараметрыПечати.Вставить("ФорматСохранения", 							Неопределено);
	ПараметрыПечати.Вставить("ФункциональныеОпции", 						"");
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ИмяМенеджераПечати, ИменаМакетов, МассивОбъектов, ВладелецФормы, ПараметрыПечати);
КонецПроцедуры	// ВызовКомандыПечатьУПДКлиент(МассивДокументов)()

#КонецОбласти


Процедура Компит_ЗаписьОткрытогоДокумента(Параметры) Экспорт
//	Оповестиь("Компит_ЗаписьОткрытогоДокумента", Параметры, "Доработки");
КонецПроцедуры	// Компит_ЗаписьОткрытогоДокумента()


#Область РаботаСБуферомОбмена

Функция ПолучитьТекстБуфераОбмена() Экспорт 
	
	#Если Клиент Тогда 
		Объект = Новый COMОбъект("htmlfile"); 
		Возврат Объект.ParentWindow.ClipboardData.Getdata("Text"); 
	#КонецЕсли 
	
КонецФункции 


Функция УстановитьТекстВБуферОбмена(Текст) Экспорт 
	
	#Если Клиент Тогда 
		Объект = Новый COMОбъект("htmlfile"); 
		Объект.ParentWindow.ClipboardData.Setdata("Text", Текст); 
		Возврат Текст; 
	#КонецЕсли 
	
КонецФункции 

#КонецОбласти


#Область СозданиеРасходныхОрдеровНаТавары

Процедура СоздатьРасходныйОрдерНаТоварыПоДоставке(МассивСсылок, ЗаявкаНаДоставку, НовыйОрдер = Ложь) Экспорт
	
	ОчиститьСообщения();
	
	МассивРаспоряжений = Новый Массив;
	МассивРаспоряжений = МассивСсылок;
	
	ОткрытьФорму("Обработка.УправлениеОтгрузкой.Форма.ФормаНастроекСозданияОрдеров",Новый Структура("МассивРаспоряжений, ЗаявкаНаДоставку, НовыйОрдер",МассивРаспоряжений, ЗаявкаНаДоставку, НовыйОрдер),,,,,);	
	
КонецПроцедуры



#КонецОбласти

