

&НаСервере
&После("УстановитьУсловноеОформление")
Процедура Расш1_УстановитьУсловноеОформление()

	//++ Сухарев Б.В. 05.08.2019
	 Если Объект.Закрыт Тогда
	 	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ПодменюСоздатьНаОсновании.Доступность = НЕ Объект.Закрыт;
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ПодменюЗаполнить.Доступность		   = НЕ Объект.Закрыт;
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаГруппаКомандыФормы.Доступность   = НЕ Объект.Закрыт;
	 КонецЕсли;
	//== Сухарев Б.В
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыДатаОтгрузки.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.НеОтгружатьЧастями");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ДатаОтгрузки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Отменено");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДатаОтгрузки.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.НеОтгружатьЧастями");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДатаОтгрузки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
КонецПроцедуры

&НаСервере
Процедура Кт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если УправлениеДоступом.ЕстьРоль("ПолныеПрава") Тогда
		
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Закрыт", Тип("ПолеФормы"),Элементы.Шапка);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.Закрыт";
		
	КонецЕсли;

	
	НовыйЭлемент  = Элементы.Добавить("_ЗаявкаНаЗакупку",Тип("ПолеФормы"),Элементы.Товары);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	НовыйЭлемент.ПутьКДанным = "Объект.Товары._ЗаявкаНаЗакупку";
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	УстановитьОбязательностьДатыОтгрузки();
	
КонецПроцедуры

&НаСервере
&После("ЗаполнитьСлужебныеРеквизитыФормыДокумента")
Процедура Кт_ЗаполнитьСлужебныеРеквизитыФормыДокументаПосле()
	
	УстановитьОбязательностьДатыОтгрузки();
	
КонецПроцедуры

&НаСервере
&После("УстановитьВидимостьЭлементовФормыДатОтгрузки")
Процедура Кт_УстановитьВидимостьЭлементовФормыДатОтгрузкиПосле()
	
	УстановитьОбязательностьДатыОтгрузки();
	
КонецПроцедуры

&НаСервере
&После("ПриИзмененииСтрок")
Процедура Кт_ПриИзмененииСтрокПосле(ИзмененныеСтроки)
	
	УстановитьОбязательностьДатыОтгрузки();
	
КонецПроцедуры

&НаСервере
&После("ПриДобавленииСтрокиТоваровНаСервере")
Процедура Кт_ПриДобавленииСтрокиТоваровНаСервереПосле(Строка)
	
	УстановитьОбязательностьДатыОтгрузки(Строка);
	
КонецПроцедуры

&НаКлиенте
&После("ТоварыНоменклатураПриИзменении")
Процедура Кт_ТоварыНоменклатураПриИзмененииПосле(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Или Не ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.НеТребуется");
	ТекущаяСтрока.Обособленно = Истина;
	
	ОбеспечениеВДокументахКлиентСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);
	
	Если Элементы.ТоварыДатаОтгрузки.Видимость Тогда
		Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыДатаОтгрузки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&После("ТоварыПриНачалеРедактирования")
Процедура Кт_ТоварыПриНачалеРедактированияПосле(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Или Копирование Тогда
		УстановитьОбязательностьДатыОтгрузки();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОбязательностьДатыОтгрузки(СтрокаТовары = Неопределено)
	
	Если СтрокаТовары = Неопределено Тогда
		
		Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
			ТекущаяСтрока.ДатаОтгрузкиОбязательна = Не Объект.НеОтгружатьЧастями;
		КонецЦикла;
		
	Иначе
		
		СтрокаТовары.ДатаОтгрузкиОбязательна = Не Объект.НеОтгружатьЧастями;
		
	КонецЕсли;
	
	ДатаОтгрузкиОбязательна = Объект.НеОтгружатьЧастями;
	Элементы.ДатаОтгрузки.АвтоОтметкаНезаполненного = Объект.НеОтгружатьЧастями;
	Элементы.ТоварыДатаОтгрузки.АвтоОтметкаНезаполненного = Не Объект.НеОтгружатьЧастями;
	
КонецПроцедуры
