

&НаСервере
&После("УстановитьУсловноеОформление")
Процедура Расш1_УстановитьУсловноеОформление()

	//++ Сухарев Б.В. 05.08.2019
	 Если Объект.Закрыт Тогда
	 	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ПодменюСоздатьНаОсновании.Доступность = НЕ Объект.Закрыт;
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ПодменюЗаполнить.Доступность		   = НЕ Объект.Закрыт;
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаГруппаКомандыФормы.Доступность   = НЕ Объект.Закрыт;
	 КонецЕсли;
	//== Сухарев Б.В
	
КонецПроцедуры

&НаСервере
Процедура Кт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если УправлениеДоступом.ЕстьРоль("ПолныеПрава") Тогда
		
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Закрыт", Тип("ПолеФормы"),Элементы.Шапка);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.Закрыт";
		
	КонецЕсли;

	
	НовыйЭлемент  = Элементы.Добавить("_ЗаявкаНаЗакупку",Тип("ПолеФормы"),Элементы.Товары);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	НовыйЭлемент.ПутьКДанным = "Объект.Товары._ЗаявкаНаЗакупку";
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	УстановитьОбязательностьДатыОтгрузки();
	
КонецПроцедуры

&НаСервере
&После("ЗаполнитьСлужебныеРеквизитыФормыДокумента")
Процедура Кт_ЗаполнитьСлужебныеРеквизитыФормыДокументаПосле()
	
	УстановитьОбязательностьДатыОтгрузки();
	
КонецПроцедуры

&НаСервере
&После("УстановитьВидимостьЭлементовФормыДатОтгрузки")
Процедура Кт_УстановитьВидимостьЭлементовФормыДатОтгрузкиПосле()
	
	УстановитьОбязательностьДатыОтгрузки();
	
КонецПроцедуры

&НаСервере
&После("ПриИзмененииСтрок")
Процедура Кт_ПриИзмененииСтрокПосле(ИзмененныеСтроки)
	
	УстановитьОбязательностьДатыОтгрузки();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОбязательностьДатыОтгрузки()
	
	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		СтрокаТовары.ДатаОтгрузкиОбязательна = Не Объект.НеОтгружатьЧастями;
	КонецЦикла;
	
	Элементы.ТоварыДатаОтгрузки.АвтоОтметкаНезаполненного = Не Объект.НеОтгружатьЧастями;
	
КонецПроцедуры
