
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Кт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//**ИЗМЕНЕНО Максимов
	Если НЕ РольДоступна("АдминистраторСистемы") Тогда
		Элементы.Статус.Видимость 						= Ложь;
		Элементы.Приоритет.Видимость 					= Ложь;
		Элементы.Договор.Видимость						= Ложь;
		Элементы.ХозяйственнаяОперация.Видимость 		= Ложь;
		Элементы.ГруппаСостояниеЭДО.Видимость 			= Ложь;
		Элементы.ЗакрытьЗаказ.Видимость					= Ложь;
		Элементы.Состояние.Видимость					= Ложь;
		Элементы.ПодменюОтчетыВажное.Видимость			= Ложь;
		Элементы.ПодменюОтчетыОбычное.Видимость			= Ложь;
		Элементы.ТоварыПоискПоШтрихкоду.Видимость		= Ложь;
		Элементы.ПодменюЭДО.Видимость 					= Ложь;
		Элементы.ЗачетОплатыФорма.Видимость				= Ложь;
		Элементы.ТоварыЗагрузитьДанныеИзТСД.Видимость 	= Ложь;
		
		КоманднаяПанель.ПодчиненныеЭлементы.ФормаСправка.Видимость				= Ложь;
		//КоманднаяПанель.ПодчиненныеЭлементы.ЗачетОплаты.Видимость 				= Ложь;
		КоманднаяПанель.ПодчиненныеЭлементы.ФормаГруппаКомандыФормы.Видимость	= Ложь;
		КоманднаяПанель.ПодчиненныеЭлементы.ПодменюСоздатьНаОсновании.Видимость = Ложь;
		
		Элементы.Товары.КоманднаяПанель.ПодчиненныеЭлементы.ГруппаЦеныСкидки.Видимость 			= Ложь;
		Элементы.Товары.КоманднаяПанель.ПодчиненныеЭлементы.ГруппаТоварыЗаполнить.Видимость 	= Ложь;
		Элементы.Товары.КоманднаяПанель.ПодчиненныеЭлементы.ТоварыРазбитьСтроку.Видимость 		= Ложь;
		Элементы.Товары.КоманднаяПанель.ПодчиненныеЭлементы.ГруппаДобавитьСтроки.Видимость 		= Истина;
		Элементы.Товары.КоманднаяПанель.ПодчиненныеЭлементы.ГруппаДобавитьСтроки.Доступность 	= Истина;
		Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.СтраницаДоставка.Видимость 					= Ложь;
		
		//Элементы.ПодменюПечать.ПодчиненныеЭлементы.ПодменюПечатьОбычное.ПодчиненныеЭлементы.ПодменюПечатьОбычное_1.Видимость = Ложь;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыДоступа.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|ГДЕ
	|	ГруппыДоступа.Пользователи.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	ГруппыДоступа = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Группа Из ГруппыДоступа Цикл
		Если Группа.Ссылка.Наименование = "Менеджер по закупкам" Тогда
			КоманднаяПанель.ПодчиненныеЭлементы.ПодменюСоздатьНаОсновании.Видимость = Истина;
		КонецЕсли;
	КонецЦикла;
	//*****************
	
	_РаботаСИнтерфейсомСервер.НастроитьФормуЗаказаПоставщикуДляМенеджераПоЗакупкам( ЭтаФорма );
	
КонецПроцедуры

&НаКлиенте
Процедура Кт_ПриОткрытииПосле(Отказ)
	
	//++ Сухарев Б.В. 08.02.2019
	ПолучитьДоступКПолям();
	//== Сухарев Б.В
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
&ИзменениеИКонтроль("ПередЗаписью")
Процедура Кт_ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если НеВыполнятьПроверкуПередЗаписью Тогда
		НеВыполнятьПроверкуПередЗаписью = Ложь;
		Возврат;
	КонецЕсли;

	// Если документ проводится, предложим дозаполнить данные, если они некорректны
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда

		Отказ = Истина;
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
		МногооборотнаяТараКлиент.ПредложитьПодобратьМногооборотнуюТару(
		ЭтаФорма,
		"Товары",
		"Номенклатура,Характеристика,Количество,Склад,ДатаПоступления",
		Новый ОписаниеОповещения("ПередЗаписьюПредложитьПодобратьМногооборотнуюТаруЗавершение", ЭтотОбъект, ДополнительныеПараметры));
#Вставка
		//++ Сухарев Б.В. 31.01.2019
		СписокЗаявокНаЗакупку = ЗаявкиНаЗакупку();
		Если СписокЗаявокНаЗакупку.Количество() > 0 Тогда
			Для Каждого ТекЗаявка Из СписокЗаявокНаЗакупку Цикл
				Парам  = Новый Структура("Ключ", ТекЗаявка);
				мФорма = ПолучитьФорму("Документ.ЗаявкаНаЗакупку.ФормаОбъекта", Парам);
				Если мФорма.Открыта() Тогда
					Попытка
						мФорма.Закрыть(0);
					Исключение
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Заявка на закупку '") + ТекЗаявка + НСтр("ru=' открыта другим пользователем или фоновым заданием'"));
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//== Сухарев Б.В.
#КонецВставки
		Возврат;

	КонецЕсли;

	ОбщегоНазначенияУТКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ПараметрыЗаписи, Отказ);

КонецПроцедуры


&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры

//КАВ начало
&НаСервере
Функция ПолучитьЗаказИзНазначения(Назначение)
	
	Заказ = Назначение.Заказ;
	Возврат Заказ;
	
КонецФункции

//++ Сухарев Б.В. 02.02.2019
&НаСервере
Функция ЗаявкиНаЗакупку()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Возврат  ДокументОбъект.ПолучитьЗаявкиНаЗакупку();
	
КонецФункции // ЗаявкиНаЗакупку()
 
&НаКлиенте
Процедура ПолучитьДоступКПолям()
	
	Если _ДоработкиСлужебный.ПолучитьДоступКполямДокумента() Тогда 
		//РИВ 01.07.24
		ЭтаФорма.Элементы.Товары_Отгрузка.ТолькоПросмотр		= Ложь;
		//==
		ЭтаФорма.Элементы.ТоварыЗаказКлиента.ТолькоПросмотр		= Ложь;
		ЭтаФорма.Элементы.Товары_ЗаявкаНаЗакупку.ТолькоПросмотр	= Ложь;
		ЭтаФорма.Элементы.Товары_УИДЗакупка.ТолькоПросмотр		= Ложь;
	Иначе
		//РИВ 01.07.24
		ЭтаФорма.Элементы.Товары_Отгрузка.ТолькоПросмотр		= Истина;
		//==
		ЭтаФорма.Элементы.ТоварыЗаказКлиента.ТолькоПросмотр		= Истина;
		ЭтаФорма.Элементы.Товары_ЗаявкаНаЗакупку.ТолькоПросмотр	= Истина;
		ЭтаФорма.Элементы.Товары_УИДЗакупка.ТолькоПросмотр		= Истина;
	КонецЕсли;
	
КонецПроцедуры	// ПолучитьДоступКПолям()

//-- Сухарев Б.В. 02.02.2019


