

&НаСервере
&ИзменениеИКонтроль("ОбновитьТаблицуНастроекФормНаСервере")
Процедура Кт_ОбновитьТаблицуНастроекФормНаСервере(Результат, ДополнительныеПараметры)

	НастройкиФорм.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь,
	|	Пользователи.ИдентификаторПользователяИБ
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	(Пользователи.Ссылка = &ПользовательДляОтбора
	|			ИЛИ &ПользовательДляОтбора = НЕОПРЕДЕЛЕНО)
	|	И НЕ Пользователи.Недействителен
	|	И НЕ Пользователи.Служебный
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователи.Наименование";

	Если НЕ Пользователь.Пустая() Тогда
		Запрос.УстановитьПараметр("ПользовательДляОтбора", Пользователь);
	ИначеЕсли НЕ Пользователи.ЭтоПолноправныйПользователь(,, Ложь) Тогда
		Запрос.УстановитьПараметр("ПользовательДляОтбора", Пользователи.ТекущийПользователь());
	Иначе
		Запрос.УстановитьПараметр("ПользовательДляОтбора", Неопределено);
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Если НЕ ЗначениеЗаполнено(Выборка.ИдентификаторПользователяИБ) Тогда
			Продолжить;
		КонецЕсли;

		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторПользователяИБ);
		Если ПользовательИБ = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ЭтоПолноправныйПользователь = ПользовательИБ.Роли.Содержит(Метаданные.Роли.ПолныеПрава);

		Для Каждого ПараметрыФормы Из ПараметрыФорм Цикл

			РольДоступна = ЭтоПолноправныйПользователь
			ИЛИ ПользовательИБ.Роли.Содержит(Метаданные.Роли[ПараметрыФормы.Значение.Роль]);

			#Вставка
			//**ИЗМЕНЕНО Максимов В.А.
			РольДоступна = ИСТИНА;
			//**
			#КонецВставки
			Если ОтображатьВсе ИЛИ РольДоступна Тогда

				НоваяСтрока = НастройкиФорм.Добавить();

				НоваяСтрока.Пользователь     = Выборка.Пользователь;
				НоваяСтрока.ОткрываемаяФорма = ПараметрыФормы.Ключ;
				НоваяСтрока.ФормаДоступна	 = РольДоступна;

				ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараметрыФормы.Значение, "ПараметрЗапуска, НеобходимыНастройки, ИмяФормыНастроек");

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаНастроекФорм.Пользователь,
	|	ТаблицаНастроекФорм.НеобходимыНастройки,
	|	ТаблицаНастроекФорм.ОткрываемаяФорма,
	|	ТаблицаНастроекФорм.ПараметрЗапуска,
	|	ТаблицаНастроекФорм.ИмяФормыНастроек,
	|	ТаблицаНастроекФорм.ФормаДоступна
	|ПОМЕСТИТЬ НастройкиФорм
	|ИЗ
	|	&ТаблицаНастроекФорм КАК ТаблицаНастроекФорм
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиФорм.Пользователь,
	|	НастройкиФорм.ОткрываемаяФорма,
	|	НастройкиФорм.НеобходимыНастройки,
	|	НастройкиФорм.ПараметрЗапуска,
	|	НастройкиФорм.ИмяФормыНастроек,
	|	НастройкиФорм.ФормаДоступна,
	|	ЕСТЬNULL(НастройкиОткрытияФормПриНачалеРаботыСистемы.ТекстовоеПредставлениеПараметров, """") КАК НастройкиФормы,
	|	ЕСТЬNULL(НастройкиОткрытияФормПриНачалеРаботыСистемы.ОткрыватьПоУмолчанию, ЛОЖЬ) КАК ОткрыватьПоУмолчанию,
	|	ВЫБОР
	|		КОГДА НастройкиОткрытияФормПриНачалеРаботыСистемы.Пользователь ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НастройкиУстановлены
	|ИЗ
	|	НастройкиФорм КАК НастройкиФорм
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиОткрытияФормПриНачалеРаботыСистемы КАК НастройкиОткрытияФормПриНачалеРаботыСистемы
	|		ПО НастройкиФорм.Пользователь = НастройкиОткрытияФормПриНачалеРаботыСистемы.Пользователь
	|			И НастройкиФорм.ОткрываемаяФорма = НастройкиОткрытияФормПриНачалеРаботыСистемы.ОткрываемаяФорма";

	Запрос.УстановитьПараметр("ТаблицаНастроекФорм", РеквизитФормыВЗначение("НастройкиФорм"));

	НастройкиФорм.Загрузить(Запрос.Выполнить().Выгрузить());

	Если Не НастройкиФорм.Количество() Тогда
		Элементы.ФормаИзменитьНастройку.Доступность = Ложь;
	КонецЕсли;

КонецПроцедуры
