

&Вместо ("__УстановкаВидимостиГруппыГосконтракта")
Процедура Кт_УстановкаВидимостиГруппыГосконтракта(Форма, ЭтоЗаказКлиента = Ложь, НаименованиеТЧТовары = "Товары") Экспорт

	ВидимостьНоменклатурыПартнера = Ложь;
	ИспользоватьЕИС = Истина;
	
	Если Не ЭлектронноеАктированиеЕИС.ИспользоватьЭлектронноеАктированиеВЕИС() Тогда
		ИспользоватьЕИС = Ложь;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Договор = Форма.Объект.Договор;
	Если ЗначениеЗаполнено(Договор.ГосударственныйКонтракт) И ИспользоватьЕИС Тогда
		Форма.Элементы.ГруппаГосКонтракт.Видимость = Истина;
		Форма.ГосКонтракт = Договор.ГосударственныйКонтракт;
		УстановитьВидимостьПоляВыбораЭтаповГосконтракта(Форма, Договор);
		Если ЗначениеЗаполнено(Договор.ГосударственныйКонтракт.ВнутреннийИдентификаторЕИС) Тогда
			Форма.ЭтоГосконтрактЕИС = Истина;
			ВидимостьНоменклатурыПартнера = Истина;
			Форма.Элементы.ГруппаФайлыЕИС.Видимость = Истина;
		КонецЕсли;
	Иначе
		Форма.Элементы.ГруппаГосКонтракт.Видимость = Ложь;
	КонецЕсли;
	
	ВидимостьНоменклатурыПартнера = Истина;
	
	Если ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
		НаименованиеТЧТовары = "Услуги";
	КонецЕсли;	
	НаименованиеПоляНоменклатурыПартнера = НаименованиеТЧТовары + "НоменклатураПартнера";
	Если Не ЭтоЗаказКлиента Тогда
		Форма.Элементы[НаименованиеПоляНоменклатурыПартнера].Видимость = ВидимостьНоменклатурыПартнера;
	Иначе
		Для Каждого ЭлементОформления Из Форма.УсловноеОформление.Элементы Цикл
			Если ЭлементОформления.Поля.Элементы[0].Поле = Новый ПолеКомпоновкиДанных(НаименованиеПоляНоменклатурыПартнера) Тогда
				ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", ВидимостьНоменклатурыПартнера);
			КонецЕсли;
		КонецЦикла
	КонецЕсли;
	
	Если ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		Если НаименованиеТЧТовары = "Товары" Тогда
			Форма.Элементы.РасхожденияНоменклатураПартнера.Видимость = ВидимостьНоменклатурыПартнера;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&Вместо ("ПередЗаписьюДокумента")
 Процедура Кт_ПередЗаписьюДокумента(Договор, ТаблицаТоваров) Экспорт
	 
	//## Не будем очищать, тк используем для подмены товара
	Возврат;
	
	ОчищатьНоменклатуруПартнера = Ложь;
	
	Если ЗначениеЗаполнено(Договор) Тогда 	
		ГосконтрактДоговора = ЭлектронноеАктированиеЕИС.ГосударственныйКонтрактДоговора(Договор);
		Если ЗначениеЗаполнено(ГосконтрактДоговора) И ЗначениеЗаполнено(ГосконтрактДоговора.ВнутреннийИдентификаторЕИС) Тогда
			ОчищатьНоменклатуруПартнера = Ложь;
		Иначе
			ОчищатьНоменклатуруПартнера = Истина;
		КонецЕсли;
	Иначе
		ОчищатьНоменклатуруПартнера = Истина;
	КонецЕсли;

	Если ОчищатьНоменклатуруПартнера Тогда
		Для Каждого СтрокаТовары Из ТаблицаТоваров Цикл
			СтрокаТовары.НоменклатураПартнера = Справочники.НоменклатураКонтрагентов.ПустаяСсылка();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
