
#Область ОбработчикиОсновныхСобытийЭлементовФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	УстановитьУсловноеОформлениеЗадач();
	УстановитьУсловноеОформлениеРеализация();
	УстановитьУсловноеОформлениеЗаказНаСборку();
	ЗаказыКлиентовСписок.Параметры.УстановитьЗначениеПараметра("ДатаАктуальности", НачалоДня(ТекущаяДатаСеанса()));
	
	ОбработкаЗадачПользователя();
	
	НомерЗаказа = "";
	ДатаЗаказа  = '00010101';
	Если Параметры.Свойство("НомерЗаказа", НомерЗаказа) И Параметры.Свойство("ДатаЗаказа", ДатаЗаказа) Тогда
		ПараметрыЗаказа = Новый Структура("НомерЗаказа, ДатаЗаказа", НомерЗаказа, ДатаЗаказа);
		Объект.ПараметрыЗаказа = ПараметрыЗаказа;
	КонецЕсли;
	
	//++ **ДОБАВЛЕНО Максимов В.А.
	Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаРеализация.Доступность   = Ложь;
	Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаПечатьТОРГ12.Доступность = Ложь;
	Элементы.ЗаказыКлиентов.ПодчиненныеЭлементы.ГруппаКолонокСПредопределеннымиЗначениями.ПодчиненныеЭлементы.ЗаказыКлиентовСогласован.Видимость = Истина;
	//-- *************************
	
	ОбновитьОтборыДинамическихСписков();
	
	_РаботаСИнтерфейсомСервер.СистемаНапоминанийПриСозданииНаСервере("ГруппаРазделыРабочегоСтола", ЭтаФорма);

	//РИВ +++ 14.10.25
	//Если Элементы.ПредставлениеСостояния.Родитель = Элементы.СписокДокументыПродажи Тогда
		//Расположение = Элементы.ПредставлениеСостояния;
	//Иначе
	//	Расположение = Элементы.ПредставлениеСостояния.Родитель;
	//КонецЕсли;
	
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	//УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаСписка(ЭтотОбъект,Элементы.РеализацияТоваровУслугСписок );//, Расположение);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	                                                   //ЗаказКлиента
	РеквизитЗаказКлиента = ЭтотОбъект.Элементы.Вставить("РеализацияТоваровУслугСписокЗаказКлиента", Тип("ПолеФормы"), Элементы.РеализацияТоваровУслугСписок, ЭтотОбъект.Элементы.РеализацияТоваровУслугСписокСуммаДокумента);//, Расположение);
	РеквизитЗаказКлиента.Вид = ВидПоляФормы.ПолеНадписи;
	//РеквизитЗаказКлиента.ГиперссылкаЯчейки = Истина; 
	РеквизитЗаказКлиента.Заголовок = НСтр("ru='Заказ клиента'");
	РеквизитЗаказКлиента.ПутьКДанным = Элементы.РеализацияТоваровУслугСписок.Имя + ".ЗаказКлиента";	
	
	
	// Создание колонок в динамическом списке
	РеквизитСписокСостояниеПолучен = Элементы.Вставить("РеализацияТоваровУслугСписокСостояниеОригиналПолучен",Тип("ПолеФормы"),Элементы.РеализацияТоваровУслугСписок);//,Расположение);
	РеквизитСписокСостояниеПолучен.Вид = ВидПоляФормы.ПолеКартинки;
	РеквизитСписокСостояниеПолучен.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет; 
	РеквизитСписокСостояниеПолучен.КартинкаЗначений = БиблиотекаКартинок.КоллекцияПиктограммНаличиеОригиналаПервичногоДокумента;
	РеквизитСписокСостояниеПолучен.КартинкаШапки = БиблиотекаКартинок.СостояниеОригиналаПервичногоДокументаОригиналПолучен;
	РеквизитСписокСостояниеПолучен.Заголовок = НСтр("ru='Состояние оригинал получен'");
	РеквизитСписокСостояниеПолучен.ПутьКДанным = Элементы.РеализацияТоваровУслугСписок.Имя + ".СостояниеОригиналПолучен";
	
	РеквизитСписокСостояние = Элементы.Вставить("РеализацияТоваровУслугСписокСостояниеОригиналаПервичногоДокумента",Тип("ПолеФормы"),Элементы.РеализацияТоваровУслугСписок);//,Расположение);
	РеквизитСписокСостояние.Вид = ВидПоляФормы.ПолеНадписи;
	РеквизитСписокСостояние.ГиперссылкаЯчейки = Истина; 
	РеквизитСписокСостояние.Заголовок = НСтр("ru='Состояние оригинала'");
	РеквизитСписокСостояние.ПутьКДанным = Элементы.РеализацияТоваровУслугСписок.Имя + ".СостояниеОригиналаПервичногоДокумента";
	//РИВ --- 14.10.25    
	
	//##+                  
	Если УправлениеДоступом.ЕстьРоль("ДобавлениеИзменениеЗаказовНаВнутреннееПотребление") ИЛИ УправлениеДоступом.ЕстьРоль("ДопПрава") Тогда
	     Элементы.ГруппаВнутренниеЗаказы.Видимость = Истина;
	ИНаче	
	     Элементы.ГруппаВнутренниеЗаказы.Видимость = Ложь;
	КонецЕсли;
	//##-
	
КонецПроцедуры
	   
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтменитьОтборЗаявокНаДоставку();
	ОбработкаНомераЗаказаКлиент();
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьДанныеТаблиц", 1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	ОбработкаНомераЗаказаКлиент();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	Настройки = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения");
	
	НастройкиИнтерфейса = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
	
	// Очистить настройки состава.
	НастройкиСостава = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	
	//восстановить панели
	НастройкиСостава.Верх.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельИнструментов"));
	НастройкиСостава.Верх.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых"));
	НастройкиСостава.Лево.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельРазделов"));
	НастройкиСостава.Низ.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельФункцийТекущегоРаздела"));
	НастройкиСостава.Низ.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельИзбранного"));
	НастройкиСостава.Низ.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельИстории"));
	
	// Загрузить настройки состава в пустой объект настроек.
	НастройкиИнтерфейса.УстановитьСостав(НастройкиСостава);
	
	// Положить объект настроек текущему пользователю в хранилище.
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", , Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЗаказыКлиентовПриАктивизацииСтроки(Элемент)
	
	//## +
	ПодключитьОбработчикОжидания("СобратьОбработатьДанныеЗаказа", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнутренниеЗаказыПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("СобратьОбработатьДанныеВнутреннегоЗаказа", 0.1, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СобратьДанныеПоЗаказуСервер(ЗаказСсылка)
	
	
	СтруктураСостоянияРасчетов = ПолучитьСостояниеЗаказаКлиента(ЗаказСсылка);
	
	ДанныеПоЗаказу = Новый Структура;
	ДанныеПоЗаказу.Вставить("Проведен",        ПроверитьДокументПроведен(ЗаказСсылка));  
	ДанныеПоЗаказу.Вставить("Закрыт",          ПроверитьДокументНаЗакрыт(ЗаказСсылка));
	ДанныеПоЗаказу.Вставить("ЕстьНабор",       ПроверитьЗаказКлиентаТоварыЕстьНабор(ЗаказСсылка));
	ДанныеПоЗаказу.Вставить("ЕстьКомплект",    ПроверитьЗаказКлиентаТоварыЕстьКомплект(ЗаказСсылка));
	ДанныеПоЗаказу.Вставить("СостояниеЗаказа", СтруктураСостоянияРасчетов.Состояние);
	ДанныеПоЗаказу.Вставить("ОстаткиКОформлениюПоКомплектам", ПроверитьОстаткиКОформлениюПоКомплектам(ЗаказСсылка));
	
	Возврат ДанныеПоЗаказу;
	
КонецФункции // СобратьДанныеПоЗаказуСервер()    

&НаСервереБезКонтекста
Функция СобратьДанныеПоВнутреннемуЗаказуСервер(ЗаказСсылка)
	
	ДанныеПоЗаказу = Новый Структура;
	ДанныеПоЗаказу.Вставить("Проведен",        ПроверитьДокументПроведен(ЗаказСсылка));  
	ДанныеПоЗаказу.Вставить("Закрыт",          ПроверитьДокументНаЗакрыт(ЗаказСсылка));
	
	Возврат ДанныеПоЗаказу;
	
КонецФункции // СобратьДанныеПоВнутреннемуЗаказуСервер()

&НаКлиенте
Процедура СобратьОбработатьДанныеЗаказа()
	
	Если ИдентификаторТекущейСтроки = Элементы.ЗаказыКлиентов.ТекущаяСтрока Тогда
	    Возврат;
	КонецЕсли;  
	
	ИдентификаторТекущейСтроки = Элементы.ЗаказыКлиентов.ТекущаяСтрока;
	
	ТекущиеДанные = Элементы.ЗаказыКлиентов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СсылкаНаДокумент = ТекущиеДанные.Ссылка;
	
	ДанныеЗаполнения = СобратьДанныеПоЗаказуСервер(СсылкаНаДокумент);
	
	ОбновитьДанныеТаблицыТоваровЗаказаНаСервереН(СсылкаНаДокумент);

	
	КнопкаДействияФормыСоздатьЗаявкуНаЗакупку = Элементы.Найти("ФормаСоздатьЗаявкуНаЗакупку");
	Если НЕ КнопкаДействияФормыСоздатьЗаявкуНаЗакупку = Неопределено Тогда
		// Установим доступность кнопки создания заявки на закупку
		КнопкаДействияФормыСоздатьЗаявкуНаЗакупку.Доступность = ДанныеЗаполнения.Проведен И ДанныеЗаполнения.Закрыт;
	КонецЕсли;
	
	КнопкаДействияФормыСоздатьЗаявкуНаДоставку = Элементы.Найти("ФормаСоздатьЗаявкуНаДоставку");
	Если НЕ КнопкаДействияФормыСоздатьЗаявкуНаДоставку = Неопределено Тогда
		// Установим доступность кнопки создания заявки на доставку
		КнопкаДействияФормыСоздатьЗаявкуНаДоставку.Доступность = ДанныеЗаполнения.Проведен И ДанныеЗаполнения.Закрыт;
	КонецЕсли;
	
	КнопкаДействияФормыСоздатьДокументСборкиРазборки = Элементы.Найти("ФормаСоздатьДокументСборкиРазборки");
	Если НЕ КнопкаДействияФормыСоздатьДокументСборкиРазборки = Неопределено Тогда
		
		// Проверим состояние заказа
		ДанныеОСостоянии = ДанныеЗаполнения.СостояниеЗаказа;
		
		АктивироватьКнопку = Ложь;
		Если  (ДанныеОСостоянии = ПредопределенноеЗначение("Перечисление.СостоянияЗаказовКлиентов.ГотовКОбеспечению")
			ИЛИ ДанныеОСостоянии = ПредопределенноеЗначение("Перечисление.СостоянияЗаказовКлиентов.ОжидаетсяОбеспечение")
			ИЛИ ДанныеОСостоянии = ПредопределенноеЗначение("Перечисление.СостоянияЗаказовКлиентов.ГотовКОтгрузке"))
			И (ДанныеЗаполнения.ЕстьКомплект ИЛИ ДанныеЗаполнения.ЕстьНабор) Тогда
			// нужно найти заказ поставщику и оценить его состояние, после чего будет решение о доступности кнопки
			АктивироватьКнопку = ДанныеЗаполнения.ОстаткиКОформлениюПоКомплектам;
		КонецЕсли;
		
		// Установим доступность кнопки создания заявки на закупку
		КнопкаДействияФормыСоздатьДокументСборкиРазборки.Доступность = АктивироватьКнопку И ДанныеЗаполнения.Проведен И ДанныеЗаполнения.Закрыт;
		
	КонецЕсли;
	
	КнопкаДействияФормыСоздатьЗаданиеНаПеревозку = Элементы.Найти("ФормаСоздатьЗаданиеНаПеревозку");
	Если НЕ КнопкаДействияФормыСоздатьЗаданиеНаПеревозку = Неопределено Тогда
		// Установим доступность кнопки создания заявки на доставку
		КнопкаДействияФормыСоздатьЗаданиеНаПеревозку.Доступность = ДанныеЗаполнения.Проведен И ДанныеЗаполнения.Закрыт; 
		
	КонецЕсли;
	
	Флаг = Ложь;
	
	УстановитьОтборПоЗаказу(СсылкаНаДокумент);

КонецПроцедуры

&НаКлиенте
Процедура СобратьОбработатьДанныеВнутреннегоЗаказа()
	                                                           
	//Если ИдентификаторТекущейСтроки = Элементы.ВнутренниеЗаказы.ТекущаяСтрока Тогда
	//    Возврат;
	//КонецЕсли;  
	//
	//ИдентификаторТекущейСтроки = Элементы.ВнутренниеЗаказы.ТекущаяСтрока;
	
	ТекущиеДанные = Элементы.ВнутренниеЗаказы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СсылкаНаДокумент = ТекущиеДанные.Ссылка;
	
	ДанныеЗаполнения = СобратьДанныеПоВнутреннемуЗаказуСервер(СсылкаНаДокумент);
	
	ОбновитьДанныеТаблицыТоваровЗаказаНаСервереН(СсылкаНаДокумент);

	
	КнопкаДействияФормыСоздатьЗаявкуНаЗакупку = Элементы.Найти("ФормаСоздатьЗаявкуНаЗакупку");
	Если НЕ КнопкаДействияФормыСоздатьЗаявкуНаЗакупку = Неопределено Тогда
		// Установим доступность кнопки создания заявки на закупку
		КнопкаДействияФормыСоздатьЗаявкуНаЗакупку.Доступность = ДанныеЗаполнения.Проведен И ДанныеЗаполнения.Закрыт;
	КонецЕсли;
	
	КнопкаДействияФормыСоздатьЗаявкуНаДоставку = Элементы.Найти("ФормаСоздатьЗаявкуНаДоставку");
	Если НЕ КнопкаДействияФормыСоздатьЗаявкуНаДоставку = Неопределено Тогда
		// Установим доступность кнопки создания заявки на доставку
		КнопкаДействияФормыСоздатьЗаявкуНаДоставку.Доступность = ДанныеЗаполнения.Проведен И ДанныеЗаполнения.Закрыт;
	КонецЕсли;
	
	КнопкаДействияФормыСоздатьЗаданиеНаПеревозку = Элементы.Найти("ФормаСоздатьЗаданиеНаПеревозку");
	Если НЕ КнопкаДействияФормыСоздатьЗаданиеНаПеревозку = Неопределено Тогда
		// Установим доступность кнопки создания заявки на доставку
		КнопкаДействияФормыСоздатьЗаданиеНаПеревозку.Доступность = ДанныеЗаполнения.Проведен И ДанныеЗаполнения.Закрыт; 
		
	КонецЕсли;
	
		
	
	Флаг = Ложь;
	
	УстановитьОтборПоЗаказу(СсылкаНаДокумент);

КонецПроцедуры



&НаКлиенте
Процедура ЗаказыКлиентовПередНачаломИзменения(Элемент, Отказ)
//	ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);
//	ТекСтрока = Элементы.ЗаказыКлиентов.ТекущаяСтрока.Ссылка;
	ТекСтрока = Элемент.ТекущиеДанные.Ссылка;
	ФЛ = Новый Структура("Ключ", ТекСтрока);
	Форма = ПолучитьФорму("Документ.ЗаказКлиента.ФормаОбъекта", ФЛ);
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаДоставкуСписокЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ( Поле.Имя = "ЗаявкиНаДоставкуСписокЗаказыЗаказКлиента" ) ИЛИ 
		 ( Поле.Имя = "ЗаявкиНаДоставкуСписокЗаказыНомерЗаказа"  ) ИЛИ
		 ( Поле.Имя = "ЗаявкиНаДоставкуСписокЗаказыДатаЗаказа"  ) Тогда
		 
 		СтандартнаяОбработка = Ложь;
		
		ТекДанн = Элементы.ЗаявкиНаДоставкуСписокЗаказы.ТекущиеДанные; 
		 Если ТекДанн <> Неопределено Тогда
		 	ОбъектСсылка = ТекДанн.ЗаказКлиента;
			ПоказатьЗначение(,ОбъектСсылка);
		 КонецЕсли;
		 
	 КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеНаПеревозкуСписокРаспоряженияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ( Поле.Имя = "ЗаданиеНаПеревозкуСписокРаспоряженияРаспоряжение" ) ИЛИ 
		 ( Поле.Имя = "ЗаданиеНаПеревозкуСписокРаспоряженияСклад"  ) ИЛИ
		 ( Поле.Имя = "ЗаданиеНаПеревозкуСписокРаспоряженияПолучательОтправитель"  ) ИЛИ
		 ( Поле.Имя = "ЗаданиеНаПеревозкуСписокРаспоряженияПеревозчик"  ) Тогда
		 
 		СтандартнаяОбработка = Ложь;
		
		ТекДанн = Элементы.ЗаданиеНаПеревозкуСписокРаспоряжения.ТекущиеДанные; 
		 Если ТекДанн <> Неопределено Тогда
		 	ОбъектСсылка = ТекДанн.Распоряжение;
			ПоказатьЗначение(,ОбъектСсылка);
		 КонецЕсли;
		 
	 КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиПользователяСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрокаСписка = ВыбраннаяСтрока;
	СтандартнаяОбработка	 = Ложь;
	
	Если Поле = Элементы.ЗадачиПользователяСписокПредмет Тогда
		ПоказатьЗначение(,Элементы.ЗадачиПользователяСписок.ТекущиеДанные.Предмет);
	Иначе
		ПоказатьЗначение(,Элементы.ЗадачиПользователяСписок.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаРазделыРабочегоСтолаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	//**ДОБАВЛЕНО Максимов В.А

	Если ТекущаяСтраница.Имя = "ГруппаЗадачиПльзователя" Тогда
		ОбновитьСписокЗадачНаСервере();
		Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаСчетНаОплату.Доступность = Ложь;
		Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаРеализация.Доступность 	= Ложь;		
		Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаПечатьТОРГ12.Доступность = Ложь;
		Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаСчетНаОплатуСФаксимиле.Доступность	= Ложь;
	КонецЕсли;
	
	Если ТекущаяСтраница.Имя = "ГруппаРеализацииТоваровУслуг" Тогда
		УстановитьОтменитьОтборРеализация(Неопределено);	
		Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаСчетНаОплату.Доступность = Ложь;
		Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаРеализация.Доступность 	= Истина;	
		Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаПечатьТОРГ12.Доступность = Истина;
		Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаСчетНаОплатуСФаксимиле.Доступность	= Ложь;
	КонецЕсли;	
	
	Если ТекущаяСтраница.Имя = "ГруппаЗаказыКлиентов" Тогда
		Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаРеализация.Доступность 	= Ложь;
		Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаСчетНаОплату.Доступность = Истина;
		Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаПечатьТОРГ12.Доступность = Ложь;
		Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаСчетНаОплатуСФаксимиле.Доступность	= Истина;
	КонецЕсли;
	
	Если ТекущаяСтраница.Имя = "ГруппаЗаказыНаСборку" Тогда
		УстановитьОтменитьОтборЗаказНаСборку(Неопределено);	
		Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаСчетНаОплату.Доступность = Ложь;
		Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаРеализация.Доступность 	= Ложь;
		Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаПечатьТОРГ12.Доступность = Ложь;
		Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаСчетНаОплатуСФаксимиле.Доступность	= Ложь;
	КонецЕсли;		
	
	Если ТекущаяСтраница.Имя = "ГруппаЗаявкиНаДоставку" Тогда	
		Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаСчетНаОплату.Доступность = Ложь;
		Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаРеализация.Доступность 	= Ложь;
		Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаПечатьТОРГ12.Доступность = Ложь;
		Элементы.ФормаГруппа1.ПодчиненныеЭлементы.ФормаСчетНаОплатуСФаксимиле.Доступность	= Ложь;		
	КонецЕсли;		
		
	//************************
	
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиКоманд

//**ДОБАВЛЕНО Максимов В.А.

&НаКлиенте
Процедура СчетНаОплату(Команда)
	
	ЗаявкаСсылка = Элементы.ЗаказыКлиентов.ТекущиеДанные.Ссылка;
	Если ( ЗаявкаСсылка = Неопределено ) Тогда
		Возврат;
	КонецЕсли;
		
	ПараметрКоманды = Новый Массив;
	ПараметрКоманды.Добавить(ЗаявкаСсылка);
	
	СписокДокументов = Новый СписокЗначений;
	СписокДокументов.Добавить(ЗаявкаСсылка);
	
	ПараметрыПечати  = Новый Структура;
	ПараметрыПечати.Вставить("СписокДокументов"		,  ПоместитьВоВременноеХранилище(СписокДокументов));
	ПараметрыПечати.Вставить("КоличествоЭкземпляров",  1);
	ПараметрыПечати.Вставить("СтруктураМакетаШаблона", Неопределено);
	
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Обработка.ПечатьСчетовНаОплату",
		"СчетНаОплату",
		ПараметрКоманды,,
		ПараметрыПечати);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетНаОплатуСФаксимиле(Команда)

	ЗаявкаСсылка = Элементы.ЗаказыКлиентов.ТекущиеДанные.Ссылка;
	Если ( ЗаявкаСсылка = Неопределено ) Тогда
		Возврат;
	КонецЕсли;
		
	ПараметрКоманды = Новый Массив;
	ПараметрКоманды.Добавить(ЗаявкаСсылка);
	
	СписокДокументов = Новый СписокЗначений;
	СписокДокументов.Добавить(ЗаявкаСсылка);
	
	ПараметрыПечати  = Новый Структура;
	ПараметрыПечати.Вставить("СписокДокументов"			,  ПоместитьВоВременноеХранилище(СписокДокументов));
	ПараметрыПечати.Вставить("КоличествоЭкземпляров"	,  1);
	ПараметрыПечати.Вставить("СтруктураМакетаШаблона"	, Неопределено);
	ПараметрыПечати.Вставить("ОтображатьФаксимиле"		, Истина);	
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Обработка.ПечатьСчетовНаОплату",
		"СчетНаОплату",
		ПараметрКоманды,,
		ПараметрыПечати);
	
КонецПроцедуры


&НаКлиенте
Процедура Реализация(Команда)

	ЗаявкаСсылка = Элементы.РеализацияТоваровУслугСписок.ТекущаяСтрока;
	Если ( ЗаявкаСсылка = Неопределено ) Тогда
		Возврат;
	КонецЕсли;
		
	ПараметрКоманды = Новый Массив;
	ПараметрКоманды.Добавить(ЗаявкаСсылка);
	
	СписокДокументов = Новый СписокЗначений;
	СписокДокументов.Добавить(ЗаявкаСсылка);
	
	ПараметрыПечати  = Новый Структура;
	ПараметрыПечати.Вставить("СписокДокументов"		,  ПоместитьВоВременноеХранилище(СписокДокументов));
	ПараметрыПечати.Вставить("КоличествоЭкземпляров",  1);
	ПараметрыПечати.Вставить("СтруктураМакетаШаблона", Неопределено);
	
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Обработка.ПечатьОбщихФорм",
		"УПД",
		ПараметрКоманды,,
		ПараметрыПечати);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьТОРГ12(Команда)

	ЗаявкаСсылка = Элементы.РеализацияТоваровУслугСписок.ТекущаяСтрока;
	Если ( ЗаявкаСсылка = Неопределено ) Тогда
		Возврат;
	КонецЕсли;
		
	ПараметрКоманды = Новый Массив;
	ПараметрКоманды.Добавить(ЗаявкаСсылка);
	
	СписокДокументов = Новый СписокЗначений;
	СписокДокументов.Добавить(ЗаявкаСсылка);
	
	ПараметрыПечати  = Новый Структура;
	ПараметрыПечати.Вставить("СписокДокументов"		,  ПоместитьВоВременноеХранилище(СписокДокументов));
	ПараметрыПечати.Вставить("КоличествоЭкземпляров",  1);
	ПараметрыПечати.Вставить("СтруктураМакетаШаблона", Неопределено);
	ПараметрыПечати.Вставить("ВыводитьУслуги"       , Ложь);
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Обработка.ПечатьОбщихФорм",
		"ТОРГ12",
		ПараметрКоманды,,
		ПараметрыПечати);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда,Элементы.ГруппаЗаказыКлиентов.ПодчиненныеЭлементы.ЗаказыКлиентов.ТекущиеДанные);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.ГруппаЗаказыКлиентов.ПодчиненныеЭлементы.ЗаказыКлиентов.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.ГруппаЗаказыКлиентов.ПодчиненныеЭлементы.ЗаказыКлиентов.ТекущиеДанные);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

//*************************

&НаКлиенте
Процедура СоздатьЗаказ(Команда)
	Если Элементы.ГруппаРазделыРабочегоСтола.ТекущаяСтраница = Элементы.ГруппаВнутренниеЗаказы Тогда
	
    ФормаДокументаЗаказКлиента = ПолучитьФорму("Документ.ЗаказНаВнутреннееПотребление.ФормаОбъекта");
	ДанныеФормы			       = ФормаДокументаЗаказКлиента.Объект;
	ПараметрыЗаполнения		   = Новый Структура("ДанныеФормы", ДанныеФормы);
	ЗаполнитьВнутреннийЗаказНаСервере(ПараметрыЗаполнения);
	КопироватьДанныеФормы(ПараметрыЗаполнения.ДанныеФормы, ФормаДокументаЗаказКлиента.Объект); // копируем наш объект в объект формы и далее открываем ее
    ФормаДокументаЗаказКлиента.Открыть();

	ИНачеЕсли Элементы.ГруппаРазделыРабочегоСтола.ТекущаяСтраница = Элементы.ГруппаЗаказыКлиентов Тогда
		
    ФормаДокументаЗаказКлиента = ПолучитьФорму("Документ.ЗаказКлиента.ФормаОбъекта");
	ДанныеФормы			       = ФормаДокументаЗаказКлиента.Объект;
	ПараметрыЗаполнения		   = Новый Структура("ДанныеФормы", ДанныеФормы);
	ЗаполнитьЗаказКлиентаНаСервере(ПараметрыЗаполнения);
	КопироватьДанныеФормы(ПараметрыЗаполнения.ДанныеФормы, ФормаДокументаЗаказКлиента.Объект); // копируем наш объект в объект формы и далее открываем ее
    ФормаДокументаЗаказКлиента.Открыть();
		
	КонецЕсли;

//	ОткрытьФорму("Документ.ЗаказКлиента.ФормаОбъекта");

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуНаЗакупку(Команда)
	
	Если Элементы.ГруппаРазделыРабочегоСтола.ТекущаяСтраница = Элементы.ГруппаВнутренниеЗаказы Тогда
	
		СтруктураДанных = Новый Структура("Основание, ДокументОснование, ОбработкаЗаказаКлиента", ПолучитьСсылкуНаДокументВнутреннийЗаказ(), ПолучитьСсылкуНаДокументВнутреннийЗаказ(), Истина);
		ПараметрыФормы 	= Новый Структура("ЗначенияЗаполнения", СтруктураДанных);
		ОткрытьФорму("Документ.ЗаявкаНаЗакупку.ФормаОбъекта", ПараметрыФормы);

	ИНачеЕсли Элементы.ГруппаРазделыРабочегоСтола.ТекущаяСтраница = Элементы.ГруппаЗаказыКлиентов Тогда
		
		СтруктураДанных = Новый Структура("Основание, ДокументОснование", ПолучитьСсылкуНаДокументЗаказКлиента(), ПолучитьСсылкуНаДокументЗаказКлиента());
		ПараметрыФормы 	= Новый Структура("ЗначенияЗаполнения", СтруктураДанных);
		ОткрытьФорму("Документ.ЗаявкаНаЗакупку.ФормаОбъекта", ПараметрыФормы);
		
	КонецЕсли;
	
	//ФормаДокументаЗаявкаНаЗакупку = ПолучитьФорму("Документ.ЗаявкаНаЗакупку.ФормаОбъекта");
	//
	//ДанныеФормы       = ФормаДокументаЗаявкаНаЗакупку.Объект; 	// Получаем объект формы в переменную
	//ДокументОснование = ПолучитьСсылкуНаДокументЗаказКлиента();	// Заказ клиента
	//
	//Если НЕ ПроверитьДокументПроведен(ДокументОснование) Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Если НЕ ПроверитьДокументНаЗакрыт(ДокументОснование) Тогда
	//	Возврат;
	//КонецЕсли; 
	//
	//// Заполняем документ на сервере
	//ПараметрыЗаполнения = Новый Структура("ДанныеФормы, ДокументОснование, ТипДокумента", ДанныеФормы, ДокументОснование, "Закупка");
	//ЗаполнитьДокументНаСервере(ПараметрыЗаполнения);
	//
	//КопироватьДанныеФормы(ПараметрыЗаполнения.ДанныеФормы, ФормаДокументаЗаявкаНаЗакупку.Объект); // копируем наш объект в объект формы и далее открываем ее
	//
	//ФормаДокументаЗаявкаНаЗакупку.Элементы.ГруппаОснование.Видимость = ЗначениеЗаполнено(ДокументОснование);
	//
	//ФормаДокументаЗаявкаНаЗакупку.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументСборкиРазборки(Команда)

	ФормаДокументаСборкаТоваров = ПолучитьФорму("Документ.ЗаказНаСборку.ФормаОбъекта");
	
	ДанныеФормы       = ФормаДокументаСборкаТоваров.Объект; 	// Получаем объект формы в переменную
	ДокументОснование = ПолучитьСсылкуНаДокументЗаказКлиента(); // Заказ клиента
	
	Если НЕ ПроверитьДокументПроведен(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	// Заполняем документ на сервере
	ПараметрыЗаполнения = Новый Структура("ДанныеФормы, ДокументОснование, ТипДокумента", ДанныеФормы, ДокументОснование, "Сборка");
//	СоздатьЗаказНаСборкуНаСервере(ПараметрыЗаполнения);
	ЗаполнитьДокументНаСервере(ПараметрыЗаполнения);
	
	КопироватьДанныеФормы(ПараметрыЗаполнения.ДанныеФормы, ФормаДокументаСборкаТоваров.Объект); // копируем наш объект в объект формы и далее открываем ее
	
	ФормаДокументаСборкаТоваров.Элементы.ДокументОснование.Видимость = Истина;
	ФормаДокументаСборкаТоваров.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуНаДоставку(Команда)
	
	Если Элементы.ГруппаРазделыРабочегоСтола.ТекущаяСтраница = Элементы.ГруппаВнутренниеЗаказы Тогда
		
		СтруктураДанных = Новый Структура("Основание, ДокументОснование", ПолучитьСсылкуНаДокументВнутреннийЗаказ(), ПолучитьСсылкуНаДокументВнутреннийЗаказ());
		
		ПараметрыФормы 	= Новый Структура("ЗначенияЗаполнения", СтруктураДанных);
		
		ФормаДокументаЗаявкаНаДоставку = ПолучитьФорму("Документ._ЗаявкаНаДоставку.ФормаОбъекта", ПараметрыФормы);
		
		Если Элементы.ВнутренниеЗаказы.ВыделенныеСтроки.Количество() > 1 Тогда
			ДанныеФормы        = ФормаДокументаЗаявкаНаДоставку.Объект; 	// Получаем объект формы в переменную
			ДокументОснование  = ПустойВнутреннийЗаказ();
			
			ПолучитьЗаказы	   = ВыбранныеЗаказы();
			Если ПолучитьЗаказы = Неопределено Тогда
				Возврат;
			Иначе
				СписокЗаказов  = ПолучитьЗаказы.СписокЗаказов;
			КонецЕсли;
		Иначе			// Элементы.ЗаказыКлиентов.ВыделенныеСтроки.Количество() > 1
			ДанныеФормы        = ФормаДокументаЗаявкаНаДоставку.Объект; 	// Получаем объект формы в переменную
			ДокументОснование  = ПолучитьСсылкуНаДокументВнутреннийЗаказ(); 	// Заказ клиента
			СписокЗаказов 	   = Неопределено;
			
			Если НЕ ПроверитьДокументПроведен(ДокументОснование) Тогда
				Возврат;
			КонецЕсли;
			
			Если НЕ ПроверитьДокументНаЗакрыт(ДокументОснование) Тогда
				Возврат;
			КонецЕсли; 
			
		КонецЕсли;		// Элементы.ЗаказыКлиентов.ВыделенныеСтроки.Количество() > 1 	 
		
		// Заполняем документ на сервере
		ПараметрыЗаполнения    = Новый Структура("ДанныеФормы, ДокументОснование, СписокЗаказов", ДанныеФормы, ДокументОснование, СписокЗаказов);
		ЗаполнитьЗаявкуНаСервере(ПараметрыЗаполнения);
		
		КопироватьДанныеФормы(ПараметрыЗаполнения.ДанныеФормы, ФормаДокументаЗаявкаНаДоставку.Объект); // копируем наш объект в объект формы и далее открываем ее

	ИНачеЕсли Элементы.ГруппаРазделыРабочегоСтола.ТекущаяСтраница = Элементы.ГруппаЗаказыКлиентов Тогда
		
		СтруктураДанных = Новый Структура("Основание, ДокументОснование", ПолучитьСсылкуНаДокументЗаказКлиента(), ПолучитьСсылкуНаДокументЗаказКлиента());
		
		ПараметрыФормы 	= Новый Структура("ЗначенияЗаполнения", СтруктураДанных);
		
		ФормаДокументаЗаявкаНаДоставку = ПолучитьФорму("Документ._ЗаявкаНаДоставку.ФормаОбъекта", ПараметрыФормы);
		
		Если Элементы.ЗаказыКлиентов.ВыделенныеСтроки.Количество() > 1 Тогда
			ДанныеФормы        = ФормаДокументаЗаявкаНаДоставку.Объект; 	// Получаем объект формы в переменную
			ДокументОснование  = ПустойЗаказ();
			
			ПолучитьЗаказы	   = ВыбранныеЗаказы();
			Если ПолучитьЗаказы = Неопределено Тогда
				Возврат;
			Иначе
				СписокЗаказов  = ПолучитьЗаказы.СписокЗаказов;
			КонецЕсли;
		Иначе			// Элементы.ЗаказыКлиентов.ВыделенныеСтроки.Количество() > 1
			ДанныеФормы        = ФормаДокументаЗаявкаНаДоставку.Объект; 	// Получаем объект формы в переменную
			ДокументОснование  = ПолучитьСсылкуНаДокументЗаказКлиента(); 	// Заказ клиента
			СписокЗаказов 	   = Неопределено;
			
			Если НЕ ПроверитьДокументПроведен(ДокументОснование) Тогда
				Возврат;
			КонецЕсли;
			
			Если НЕ ПроверитьДокументНаЗакрыт(ДокументОснование) Тогда
				Возврат;
			КонецЕсли; 
			
		КонецЕсли;		// Элементы.ЗаказыКлиентов.ВыделенныеСтроки.Количество() > 1 	 
		
		// Заполняем документ на сервере
		ПараметрыЗаполнения    = Новый Структура("ДанныеФормы, ДокументОснование, СписокЗаказов", ДанныеФормы, ДокументОснование, СписокЗаказов);
		ЗаполнитьЗаявкуНаСервере(ПараметрыЗаполнения);
		
		КопироватьДанныеФормы(ПараметрыЗаполнения.ДанныеФормы, ФормаДокументаЗаявкаНаДоставку.Объект); // копируем наш объект в объект формы и далее открываем ее
		
	КонецЕсли; 

	ФормаДокументаЗаявкаНаДоставку.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтменитьОтборЗаявокНаДоставку(Команда = Неопределено)
	
	Если НЕ Команда = Неопределено Тогда
		Если ВидимостьЗаявокНаДоставку Тогда
			ВидимостьЗаявокНаДоставку = Ложь;
//			ЭтаФорма.Элементы.ЗаявкиНаДоставкуСписок.КоманднаяПанель.ПодчиненныеЭлементы.ЗаявкиНаДоставкуСписокКнопка.Заголовок = "Показать все заявки";
		Иначе
			ВидимостьЗаявокНаДоставку = Истина;
//			ЭтаФорма.Элементы.ЗаявкиНаДоставкуСписок.КоманднаяПанель.ПодчиненныеЭлементы.ЗаявкиНаДоставкуСписокКнопка.Заголовок = "Только заявки заказа";
		КонецЕсли;
	КонецЕсли;		//  		 
	
	ЭтаФорма.Элементы.ЗаявкиНаДоставкуСписок.КоманднаяПанель.ПодчиненныеЭлементы.ЗаявкиНаДоставкуСписокКнопка.Заголовок = ?(ВидимостьЗаявокНаДоставку,"Только заявки заказа", "Показать все заявки");
	УстановитьОтборПоЗаказу(ТекущийЗаказКлиента);
	
КонецПроцедуры

//**ДОБАВЛЕНО Максимов В.А.
&НаКлиенте
Процедура УстановитьОтменитьОтборРеализация(Команда = Неопределено)
	
	Если НЕ Команда = Неопределено Тогда
		Если ВидимостьРеализаций Тогда
			ВидимостьРеализаций = Ложь;
		Иначе
			ВидимостьРеализаций = Истина;
		КонецЕсли;
	КонецЕсли;		//  		 
	
	ЭтаФорма.Элементы.РеализацияТоваровУслугСписок.КоманднаяПанель.ПодчиненныеЭлементы.РеализацияТоваровУслугСписокКнопка.Заголовок = ?(ВидимостьРеализаций, "Только реализации заказа", "Показать все реализации");
	
	УстановитьОтборПоЗаказуРеализации(ТекущийЗаказКлиента);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтменитьОтборЗаказНаСборку(Команда)
	
	Если НЕ Команда = Неопределено Тогда
		Если ВидимостьЗаказНаСборку Тогда
			ВидимостьЗаказНаСборку = Ложь;
		Иначе
			ВидимостьЗаказНаСборку = Истина;
		КонецЕсли;
	КонецЕсли;		//  		 
	
	ЭтаФорма.Элементы.ЗаказНаСборкуСписок.КоманднаяПанель.ПодчиненныеЭлементы.ЗаказНаСборкуСписокКнопка.Заголовок = ?(ВидимостьЗаказНаСборку, "Только заказ на сборку заказа", "Показать все заказы на сборку");
	
	УстановитьОтборПоЗаказуЗаказНаСборку(ТекущийЗаказКлиента);

КонецПроцедуры

//*************************

&НаКлиенте
Процедура СоздатьЗаданиеНаПеревозку(Команда)
	
	ФормаДокументаЗаданиеНаПеревозку = ПолучитьФорму("Документ.ЗаданиеНаПеревозку.Форма.ФормаДокумента");
	
//	ДанныеФормы       				 = ФормаДокументаЗаданиеНаПеревозку.Объект; 	// Получаем объект формы в переменную
////	ДокументОснование				 = ПолучитьСсылкуНаДокументЗаказКлиента(); 		// Заказ клиента
//	
//	Если Элементы.ЗаказыКлиентов.ВыделенныеСтроки.Количество() > 1 Тогда
////		ДанныеФормы        = ФормаДокументаЗаданиеНаПеревозку.Объект; 				// Получаем объект формы в переменную
//		ДокументОснование  = ПустойЗаказ();
//		
//		ПолучитьЗаказы	   = ВыбранныеЗаказы(Истина);
//		Если ПолучитьЗаказы = Неопределено Тогда
//			Возврат;
//		Иначе
//			СписокЗаказов  = ПолучитьЗаказы.СписокЗаказов;
//		КонецЕсли;
//	Иначе			// Элементы.ЗаказыКлиентов.ВыделенныеСтроки.Количество() > 1
////		ДанныеФормы        = ФормаДокументаЗаданиеНаПеревозку.Объект; 				// Получаем объект формы в переменную
//		ДокументОснование  = ПолучитьСсылкуНаДокументЗаказКлиента(); 				// Заказ клиента
//		СписокЗаказов 	   = Неопределено;
//		
//		Если НЕ ПроверитьДокументПроведен(ДокументОснование) Тогда
//			Возврат;
//		КонецЕсли;
//		
//		Если СокрЛП(Строка(ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.СпособДоставки)) = "Самовывоз" Тогда
//			Сообщение = Новый СообщениеПользователю;
//			Сообщение.Текст = " Заказ клиента  № " + ТекущийЭлемент.ТекущиеДанные.Номер + " - способ доставки : " + ТекущийЭлемент.ТекущиеДанные.СпособДоставки;
//			Сообщение.Сообщить();
//			Возврат;
//		КонецЕсли;
//	КонецЕсли;		// Элементы.ЗаказыКлиентов.ВыделенныеСтроки.Количество() > 1
//	
//	// Заполняем документ на сервере
//	ПараметрыЗаполнения    = Новый Структура("ДанныеФормы, ДокументОснование, СписокЗаказов", ДанныеФормы, ДокументОснование, СписокЗаказов);
// 	СоздатьЗаданиеНаПеревозкуНаСервере(ПараметрыЗаполнения);
//	
//	КопироватьДанныеФормы(ПараметрыЗаполнения.ДанныеФормы, ФормаДокументаЗаданиеНаПеревозку.Объект); // копируем наш объект в объект формы и далее открываем ее
	
	ФормаДокументаЗаданиеНаПеревозку.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму(Команда)
	
	Объект.ПараметрыЗаказа = Неопределено;
	ОбработкаНомераЗаказаКлиент();
	
	Элементы.ЗаказыКлиентов.Обновить();
	Элементы.ЗаявкиНаДоставкуСписок.Обновить();
	Элементы.РеализацияТоваровУслугСписок.Обновить();
	
	ОбновитьСписокЗадачНаСервере();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокЗадач(Команда)
	ОбновитьСписокЗадачНаСервере();
КонецПроцедуры

#КонецОбласти



#Область ОсновныеПроцедурыФункции

// Создаем новый заказ клиента
&НаСервере
Процедура ЗаполнитьЗаказКлиентаНаСервере(ПараметрыЗаполнения)
	НовыйДокументЗаказКлиента					 = Документы.ЗаказКлиента.СоздатьДокумент();
//    НовыйДокументЗаказКлиента.Статус			 = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению;		// Согласован
    НовыйДокументЗаказКлиента.Статус			 = Перечисления.СтатусыЗаказовКлиентов.НеСогласован;		// НЕ Согласован
    НовыйДокументЗаказКлиента.Приоритет			 = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
    НовыйДокументЗаказКлиента.Дата				 = ТекущаяДата();
	НовыйДокументЗаказКлиента._РабочийСтолПродаж = Истина;
	//**Изменено Максимов В.А. 19.10.20
	НовыйДокументЗаказКлиента.Менеджер			 = Пользователи.ТекущийПользователь();	
	НовыйДокументЗаказКлиента.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
	//*********************************	
	ЗначениеВДанныеФормы(НовыйДокументЗаказКлиента, ПараметрыЗаполнения.ДанныеФормы);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВнутреннийЗаказНаСервере(ПараметрыЗаполнения)
	НовыйДокументЗаказКлиента					 = Документы.ЗаказНаВнутреннееПотребление.СоздатьДокумент();
    НовыйДокументЗаказКлиента.Статус			 = Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;		// НЕ Согласован
    НовыйДокументЗаказКлиента.Приоритет			 = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
    НовыйДокументЗаказКлиента.Дата				 = ТекущаяДата();
	//**Изменено Максимов В.А. 19.10.20
	НовыйДокументЗаказКлиента.Автор  			    = Пользователи.ТекущийПользователь();	
	НовыйДокументЗаказКлиента.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
	//*********************************	
	ЗначениеВДанныеФормы(НовыйДокументЗаказКлиента, ПараметрыЗаполнения.ДанныеФормы);
КонецПроцедуры


// Создаем заявку на закупку  или документ сборки/разборкина основе заказа
&НаСервереБезКонтекста
Процедура ЗаполнитьДокументНаСервере(ПараметрыЗаполнения)

	Если ПараметрыЗаполнения.ТипДокумента = "Закупка" Тогда
		
		НовыйДокументЗаявкиНаЗакупку = Документы.ЗаявкаНаЗакупку.СоздатьДокумент();
		Если НЕ ТипЗнч(ПараметрыЗаполнения) = Тип("Структура")
			ИЛИ НЕ ПараметрыЗаполнения.Свойство("ДокументОснование")
		Тогда
			ЗначениеВДанныеФормы(НовыйДокументЗаявкиНаЗакупку, ПараметрыЗаполнения.ДанныеФормы);
			Возврат;
		КонецЕсли;
		
		ПараметрыЗаполнения.ДанныеФормы.ПоступлениеОднойДатой = Ложь;
		ПараметрыЗаполнения.ДанныеФормы.Дата				  = ТекущаяДата();
		ПараметрыЗаполнения.ДанныеФормы.ДатаСогласования	  = ТекущаяДата();
		ПараметрыЗаполнения.ДанныеФормы.Статус		 	 	  = Перечисления.СтатусыЗаказовПоставщикам.Согласован;
		ПараметрыЗаполнения.ДанныеФормы.ЦенаВключаетНДС 	  = Истина;
		
		НовыйДокументЗаявкиНаЗакупку.Дата				 	  = ТекущаяДата();
		НовыйДокументЗаявкиНаЗакупку.ДатаСогласования	      = ТекущаяДата();
		НовыйДокументЗаявкиНаЗакупку.ПоступлениеОднойДатой	  = Ложь;
		НовыйДокументЗаявкиНаЗакупку.Заполнить(ПараметрыЗаполнения.ДокументОснование);
		ЗначениеВДанныеФормы(НовыйДокументЗаявкиНаЗакупку, ПараметрыЗаполнения.ДанныеФормы);
		
	ИначеЕсли  ПараметрыЗаполнения.ТипДокумента = "Сборка" Тогда
		
		НовыйДокументСборкаТоваров = Документы.ЗаказНаСборку.СоздатьДокумент();
		Если НЕ ТипЗнч(ПараметрыЗаполнения) = Тип("Структура")
			ИЛИ НЕ ПараметрыЗаполнения.Свойство("ДокументОснование")
		Тогда
			ЗначениеВДанныеФормы(НовыйДокументСборкаТоваров, ПараметрыЗаполнения.ДанныеФормы);
			Возврат;
		КонецЕсли;
		
		ЗаполнитьПоЗаказуКлиента(НовыйДокументСборкаТоваров, ПараметрыЗаполнения);
		
		ЗначениеВДанныеФормы(НовыйДокументСборкаТоваров, ПараметрыЗаполнения.ДанныеФормы);
	КонецЕсли 

КонецПроцедуры

// Создаем заявку на доставку на основе заказов
&НаСервере
Функция ВыбранныеЗаказы(ПроверкаКлиента = Ложь)
	
	СтрОшибок = НСтр("ru = ''");
	
	СписокЗаказов = Новый ТаблицаЗначений;
	СписокЗаказов.Колонки.Добавить("Дата",    		 Новый ОписаниеТипов("Дата")); 
	СписокЗаказов.Колонки.Добавить("Номер",   		 Новый ОписаниеТипов("Строка")); 
	СписокЗаказов.Колонки.Добавить("Организация"); 
	СписокЗаказов.Колонки.Добавить("Партнер"); 
	СписокЗаказов.Колонки.Добавить("Склад"); 
	СписокЗаказов.Колонки.Добавить("СуммаДокумента", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2)); 
	СписокЗаказов.Колонки.Добавить("СпособДоставки"); 
	
	ВыделенныеСтроки = Элементы.ЗаказыКлиентов.ВыделенныеСтроки;
	
	Схема       = Элементы.ЗаказыКлиентов.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки   = Элементы.ЗаказыКлиентов.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
 
	КМ			= Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет	    = КМ.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
 
	ПК			= Новый ПроцессорКомпоновкиДанных;
	ПК.Инициализировать(Макет);
 
	ТЗ			= Новый ТаблицаЗначений;
	
	ПВ			= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПВ.УстановитьОбъект(ТЗ);
	ПВ.Вывести(ПК);	
	
	Контроль		 = Истина; 
	ОсновнойКлиент	 = Истина; 
	ОсновнойСклад	 = Истина;
	Для Каждого ТекСтрока Из ВыделенныеСтроки Цикл
		СтрДанных    = ТЗ.Получить(ТекСтрока - 1);
		ТекКлиент	 = СтрДанных.Партнер;
		ТекСклад	 = СтрДанных.Склад;
		
		Если Контроль Тогда
			Клиент   = ТекКлиент;
			Склад	 = ТекСклад;
			Контроль = Ложь;
		КонецЕсли;
		
		Если ( НЕ ТекКлиент = Клиент ) И ( НЕ ПроверкаКлиента )  Тогда
			Если ОсновнойКлиент Тогда
				СтрОшибок	   = СтрОшибок + ?( НЕ СтрОшибок = "", Символы.ПС, "" ) + "Основной клиент = " + Клиент.Наименование;
				ОсновнойКлиент = Ложь;
			КонецЕсли;		//  		 
			
			СтрОшибок = СтрОшибок + ?( НЕ СтрОшибок = "", Символы.ПС, "" ) + " Заказ клиента  № " + СтрДанных.Номер + " - по другому клиенту : " + СтрДанных.Партнер.Наименование;
			Продолжить;
		КонецЕсли;
		
		Если ( НЕ ТекСклад = Склад ) Тогда
			Если ОсновнойСклад Тогда
				СтрОшибок	  = СтрОшибок + ?( НЕ СтрОшибок = "", Символы.ПС, "" ) + "Основной склад = " + Склад.Наименование;
				ОсновнойСклад = Ложь;
			КонецЕсли;		//  		 
			СтрОшибок = СтрОшибок + ?( НЕ СтрОшибок = "", Символы.ПС, "" ) + " Заказ клиента  № " + СтрДанных.Номер + " - отгузка с другого склада: " + СтрДанных.Склад.Наименование;
			Продолжить;
		КонецЕсли;
		
		Если СтрДанных.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда
			СтрОшибок = " Заказ клиента  № " + СтрДанных.Номер + " - способ доставки : " + Перечисления.СпособыДоставки.Самовывоз;
			Продолжить;
		КонецЕсли;
		
		
		НоваяСтрока  = СписокЗаказов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрДанных);
	КонецЦикла;		// ТекСтрока  
	
	Если НЕ СтрОшибок = "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрОшибок);
	КонецЕсли;
	
	Если СписокЗаказов.Количество() > 0 Тогда
		мСписокЗаказов = _ДоработкиСлужебный.ПреобразоватьТаблицуЗначенийВМассив(СписокЗаказов);
		Возврат Новый Структура("СписокЗаказов", мСписокЗаказов);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ВыбранныеЗаказы()

&НаСервереБезКонтекста
Процедура ЗаполнитьЗаявкуНаСервере(ПараметрыЗаполнения)

	НовыйДокументЗаявкиНаДоставку	    = Документы._ЗаявкаНаДоставку.СоздатьДокумент();
	НовыйДокументЗаявкиНаДоставку.Дата  = ТекущаяДата();
	//НовыйДокументЗаявкиНаДоставку.Дата  = _ДоработкиСлужебный.ПолучитьСледующийДень(ТекущаяДата());
	
	Если НЕ ТипЗнч(ПараметрыЗаполнения) = Тип("Структура") ИЛИ НЕ ПараметрыЗаполнения.Свойство("ДокументОснование") Тогда
		ЗначениеВДанныеФормы(НовыйДокументЗаявкиНаДоставку, ПараметрыЗаполнения.ДанныеФормы);
		Возврат;
	КонецЕсли;
	
	Если ( ПараметрыЗаполнения.СписокЗаказов = Неопределено ) И ( НЕ ПараметрыЗаполнения.ДокументОснование = ПустойЗаказ() ) Тогда
		НовыйДокументЗаявкиНаДоставку.Заполнить(ПараметрыЗаполнения.ДокументОснование);
	Иначе			// ПараметрыЗаполнения.СписокЗаказов = Неопределено
		НовыйДокументЗаявкиНаДоставку.Заполнить(ПараметрыЗаполнения.СписокЗаказов);
	КонецЕсли;		// ПараметрыЗаполнения.СписокЗаказов = Неопределено 
	
	ЗначениеВДанныеФормы(НовыйДокументЗаявкиНаДоставку, ПараметрыЗаполнения.ДанныеФормы);

КонецПроцедуры

// Установка отбора заявок на доставку
&НаКлиенте
Процедура УстановитьОтборПоЗаказу(СсылкаНаДокумент)
	
	ТекДанные = Элементы.ЗаявкиНаДоставкуСписок.ТекущиеДанные;
	
	ЗаявкиНаДоставкуСписок.Отбор.Элементы.Очистить();
	Если НЕ ВидимостьЗаявокНаДоставку Тогда
		Отбор				  = ЗаявкиНаДоставкуСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ВидСравнения	  = ВидСравненияКомпоновкиДанных.Равно;
		Отбор.Использование	  = Истина;
		Отбор.ЛевоеЗначение	  = Новый ПолеКомпоновкиДанных("ДокументОснование");
		Отбор.ПравоеЗначение  = СсылкаНаДокумент;
	Иначе
		МассивОрганизаций  = Новый Массив;
		СписокГруппДоступа = Новый Массив;
		ГруппыДоступаДляЗаявкаНаДоставку(МассивОрганизаций, СписокГруппДоступа);		
	КонецЕсли;		// НЕ ВидимостьЗаявокНаДоставку 		  
	
КонецПроцедуры	// УстановитьОтборПоЗаказу(СсылкаНаДокумент)

//**ДОБАВЛЕНО Максимов В.А.
&НаКлиенте
Процедура УстановитьОтборПоЗаказуРеализации(СсылкаНаДокумент);

	ТекДан = Элементы.РеализацияТоваровУслугСписок.ТекущиеДанные;
	
	РеализацияТоваровУслугСписок.Отбор.Элементы.Очистить();
	
	Если НЕ ВидимостьРеализаций Тогда
		Отбор				  = РеализацияТоваровУслугСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ВидСравнения	  = ВидСравненияКомпоновкиДанных.Равно;
		Отбор.Использование	  = Истина;
		Отбор.ЛевоеЗначение	  = Новый ПолеКомпоновкиДанных("ЗаказКлиента");
		Отбор.ПравоеЗначение  = СсылкаНаДокумент;
	Иначе
		МассивОрганизаций = Новый Массив;
		СписокГруппДоступа = Новый Массив;		
		ПолучитьГруппуДоступаДляРеализаций(МассивОрганизаций, СписокГруппДоступа);
	КонецЕсли;		// НЕ ВидимостьРеализаций 		  
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьОтборПоЗаказуЗаказНаСборку(СсылкаНаДокумент)
	
	ТекДан = Элементы.ЗаказНаСборкуСписок.ТекущиеДанные;
	
	ЗаказНаСборкуСписок.Отбор.Элементы.Очистить();
	
	Если НЕ ВидимостьЗаказНаСборку Тогда
		Отбор				  = ЗаказНаСборкуСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ВидСравнения	  = ВидСравненияКомпоновкиДанных.Равно;
		Отбор.Использование	  = Истина;
		Отбор.ЛевоеЗначение	  = Новый ПолеКомпоновкиДанных("ДокументОснование");
		Отбор.ПравоеЗначение  = СсылкаНаДокумент;
	Иначе
		МассивОрганизаций  = Новый Массив;
		СписокГруппДоступа = Новый Массив;
		ГруппыДоступаДляЗаявкаНаСборку(МассивОрганизаций, СписокГруппДоступа);		
		
	КонецЕсли;		// НЕ ВидимостьЗаказНаСборку 		  
	
КонецПроцедуры	

//*************************

// Создание задания на перевозку
&НаСервере
Процедура СоздатьЗаданиеНаПеревозкуНаСервере(ПараметрыЗаполнения)
	
	НовыйДокументЗаданиеНаПеревозку		 = Документы.ЗаданиеНаПеревозку.СоздатьДокумент();
	НовыйДокументЗаданиеНаПеревозку.Дата = ТекущаяДата();
	
	Если НЕ ТипЗнч(ПараметрыЗаполнения)  = Тип("Структура") ИЛИ НЕ ПараметрыЗаполнения.Свойство("ДокументОснование") Тогда
		ЗначениеВДанныеФормы(НовыйДокументЗаданиеНаПеревозку, ПараметрыЗаполнения.ДанныеФормы);
		Возврат;
	КонецЕсли;
	
	Если ( ПараметрыЗаполнения.СписокЗаказов = Неопределено ) И ( НЕ ПараметрыЗаполнения.ДокументОснование = ПустойЗаказ() ) Тогда
		ЗначениеВДанныеФормы(НовыйДокументЗаданиеНаПеревозку, ПараметрыЗаполнения.ДанныеФормы);
		НовыйДокументЗаданиеНаПеревозку.Заполнить(ПараметрыЗаполнения);
	Иначе			// ПараметрыЗаполнения.СписокЗаказов = Неопределено
		НовыйДокументЗаданиеНаПеревозку.Заполнить(ПараметрыЗаполнения);
	КонецЕсли;		// ПараметрыЗаполнения.СписокЗаказов = Неопределено 
	
	ЗначениеВДанныеФормы(НовыйДокументЗаданиеНаПеревозку, ПараметрыЗаполнения.ДанныеФормы);
	
КонецПроцедуры

// Обновить список задач пользователю
&НаСервере
Процедура ОбновитьСписокЗадачНаСервере()
	
	БизнесПроцессыИЗадачиСервер.УстановитьПараметрыСпискаМоихЗадач(ЗадачиПользователяСписок);
	// Цвет просроченных задач зависит от значения текущей даты,
	// поэтому нужно переинициализировать условное оформление.
	УстановитьУсловноеОформлениеЗадач();
	Элементы.ЗадачиПользователяСписок.Обновить();
	//РИВ +++ 14.10.25
	Элементы.Удалить(Элементы.ГруппаРеализацииТоваровУслуг.ПодчиненныеЭлементы.РеализацияТоваровУслугСписок.ПодчиненныеЭлементы.РеализацияТоваровУслугСписокЗаказКлиента); 
	
	//РеквизитЗаказКлиента = Элементы.ГруппаРеализацииТоваровУслуг.ПодчиненныеЭлементы.РеализацияТоваровУслугСписок.ПодчиненныеЭлементы.РеализацияТоваровУслугСписокЗаказКлиента;//.Вставить("РеализацияТоваровУслугСписокЗаказКлиента", Тип("ПолеФормы"), Элементы.РеализацияТоваровУслугСписок, Элементы.РеализацияТоваровУслугСписокСуммаДокумента);//, Расположение);
	РеквизитЗаказКлиента = ЭтотОбъект.Элементы.Вставить("РеализацияТоваровУслугСписокЗаказКлиента", Тип("ПолеФормы"), Элементы.РеализацияТоваровУслугСписок, ЭтотОбъект.Элементы.РеализацияТоваровУслугСписокСуммаДокумента);//, Расположение);
	РеквизитЗаказКлиента.Вид = ВидПоляФормы.ПолеНадписи;
	////РеквизитЗаказКлиента.ГиперссылкаЯчейки = Истина; 
	РеквизитЗаказКлиента.Заголовок = НСтр("ru='Заказ клиента'");
	РеквизитЗаказКлиента.ПутьКДанным = Элементы.РеализацияТоваровУслугСписок.Имя + ".ЗаказКлиента";	
	
	Элементы.Удалить(Элементы.ГруппаРеализацииТоваровУслуг.ПодчиненныеЭлементы.РеализацияТоваровУслугСписок.ПодчиненныеЭлементы.РеализацияТоваровУслугСписокСостояниеОригиналаПервичногоДокумента);
	РеквизитСписокСостояние = Элементы.Вставить("РеализацияТоваровУслугСписокСостояниеОригиналаПервичногоДокумента",Тип("ПолеФормы"),Элементы.РеализацияТоваровУслугСписок);//,Расположение);
	РеквизитСписокСостояние.Вид = ВидПоляФормы.ПолеНадписи;
	РеквизитСписокСостояние.ГиперссылкаЯчейки = Истина; 
	РеквизитСписокСостояние.Заголовок = НСтр("ru='Состояние оригинала'");
	РеквизитСписокСостояние.ПутьКДанным = Элементы.РеализацияТоваровУслугСписок.Имя + ".СостояниеОригиналаПервичногоДокумента";

	//РИВ --- 14.10.25	
КонецПроцедуры

&НаСервере
Процедура ОбработкаЗадачПользователя()
	
	БизнесПроцессыИЗадачиСервер.УстановитьПараметрыСпискаМоихЗадач(ЗадачиПользователяСписок);
	ПараметрыОтбора = Новый Соответствие();
	ПараметрыОтбора.Вставить("ПоказыватьВыполненные", ПоказыватьВыполненные);
	УстановитьОтбор(ПараметрыОтбора);
	
	ПараметрыОтбораФормы = Новый Структура( ); //ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Параметры.Отбор);
	//Параметры.Отбор.Очистить();
	
	ИспользоватьДатуИВремяВСрокахЗадач = ПолучитьФункциональнуюОпцию("ИспользоватьДатуИВремяВСрокахЗадач");
	Элементы.ЗадачиПользователяСписокСрокИсполнения.Формат = ?(ИспользоватьДатуИВремяВСрокахЗадач, "ДЛФ=DT", "ДЛФ=D");
	Элементы.ЗадачиПользователяСписокДатаНачала.Формат = ?(ИспользоватьДатуИВремяВСрокахЗадач, "ДЛФ=DT", "ДЛФ=D");
	Элементы.ЗадачиПользователяСписокДата.Формат = ?(ИспользоватьДатуИВремяВСрокахЗадач, "ДЛФ=DT", "ДЛФ=D");
	
	
КонецПроцедуры	// ОбработкаЗадачПользователя()


&НаСервере
Процедура УстановитьОтбор(ПараметрыОтбора)
	
	Если ПараметрыОтбора["ПоказыватьВыполненные"] Тогда
		СгруппироватьПоКолонкеНаСервере("");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ЗадачиПользователяСписок, "Выполнена", Ложь, , , Не ПараметрыОтбора["ПоказыватьВыполненные"]);
		
КонецПроцедуры

&НаСервере
Процедура СгруппироватьПоКолонкеНаСервере(Знач ИмяКолонкиРеквизита)
	РежимГруппировки = ИмяКолонкиРеквизита;
	Если НЕ ПустаяСтрока(РежимГруппировки) Тогда
		ПоказыватьВыполненные = Ложь;
		ПараметрыОтбора = Новый Соответствие();
		ПараметрыОтбора.Вставить("ПоказыватьВыполненные", ПоказыватьВыполненные);	
		УстановитьОтбор(ПараметрыОтбора);	
	КонецЕсли;
	ЗадачиПользователяСписок.Группировка.Элементы.Очистить();
	Если НЕ ПустаяСтрока(ИмяКолонкиРеквизита) Тогда
		ПолеГруппировки = ЗадачиПользователяСписок.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(ИмяКолонкиРеквизита);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНомераЗаказаКлиент()
	
	Если ТипЗнч(Объект.ПараметрыЗаказа) = Тип("Структура") Тогда
		
		Если  Объект.ПараметрыЗаказа.Свойство("НомерЗаказа") И  Объект.ПараметрыЗаказа.Свойство("НомерЗаказа") Тогда
			
			ЭлементДобавлен = Ложь;
			Для Каждого ЭлементНастройки Из ЗаказыКлиентовСписок.Отбор.Элементы Цикл
				Если Строка(ЭлементНастройки.ЛевоеЗначение) = "Номер" Тогда
					ЭлементДобавлен                      = Истина;
					ЭлементНастройки.ВидСравнения        = ВидСравненияКомпоновкиДанных.Равно;
					Номер       			             = Объект.ПараметрыЗаказа.НомерЗазаза;
					ЭлементНастройки.ПравоеЗначение      = Номер;
					ЭлементНастройки.Использование       = Истина;
				КонецЕсли;
			КонецЦикла;		// ЭлементНастройки Из ЗаказыКлиентовСписок.Отбор.Элементы 
			
			Если НЕ ЭлементДобавлен Тогда
				НовЭлементОтбора                         = ЗаказыКлиентовСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовЭлементОтбора.ЛевоеЗначение           = Новый ПолеКомпоновкиДанных("Номер"); 
				НовЭлементОтбора.ВидСравнения			 = ВидСравненияКомпоновкиДанных.Равно;
				Номер       			         	     = Объект.ПараметрыЗаказа.НомерЗаказа;
				НовЭлементОтбора.ПравоеЗначение 	     = Номер;
				НовЭлементОтбора.Использование           = Истина;
			КонецЕсли;
			
		Иначе
			
			Для Каждого ЭлементНастройки Из ЗаказыКлиентовСписок.Отбор.Элементы Цикл
				Если Строка(ЭлементНастройки.ЛевоеЗначение) = "Номер" Тогда
					ЭлементДобавлен                      = Истина;
					ЭлементНастройки.ВидСравнения        = ВидСравненияКомпоновкиДанных.Равно;
					Номер       			             = Объект.ПараметрыЗаказа.НомерЗазаза;
					ЭлементНастройки.ПравоеЗначение      = Номер;
					ЭлементНастройки.Использование       = Ложь;
				КонецЕсли;
			КонецЦикла;		// ЭлементНастройки Из ЗаказыКлиентовСписок.Отбор.Элементы 
			
		КонецЕсли;	
		
	Иначе
		
		Для Каждого ЭлементНастройки Из ЗаказыКлиентовСписок.Отбор.Элементы Цикл
			Если Строка(ЭлементНастройки.ЛевоеЗначение) = "Номер" Тогда
				ЭлементДобавлен                      = Истина;
				ЭлементНастройки.ВидСравнения        = ВидСравненияКомпоновкиДанных.Равно;
				Номер       			             = "";
				ЭлементНастройки.ПравоеЗначение      = Номер;
				ЭлементНастройки.Использование       = Ложь;
			КонецЕсли;
		КонецЦикла;		// ЭлементНастройки Из ЗаказыКлиентовСписок.Отбор.Элементы 
		
	КонецЕсли;
	
КонецПроцедуры	// ОбработкаНомераЗаказаКлиент()

#КонецОбласти



#Область СозданиеСборки

&НаСервереБезКонтекста
Процедура ЗаполнитьПоЗаказуКлиента(НовыйДокументСборкаТоваров, ПараметрыЗаполнения)
	
	Реквизиты	 = ПолучитьДанныеПоЗаказуКлиента(ПараметрыЗаполнения.ДокументОснование);
	ЗаказКлиента = ПараметрыЗаполнения.ДокументОснование;
	
	Документы.ЗаказКлиента.ПроверитьВозможностьВводаНаОсновании(
		ЗаказКлиента,
		Реквизиты.СтатусДокумента,
		НЕ Реквизиты.Проведен);
	
	// Заполнение шапки
	НовыйДокументСборкаТоваров.Дата					   = ТекущаяДата();
	НовыйДокументСборкаТоваров.ДокументОснование       = ЗаказКлиента;
	НовыйДокументСборкаТоваров.Организация             = Реквизиты.Организация;
	НовыйДокументСборкаТоваров.Сделка                  = Реквизиты.Сделка;
	НовыйДокументСборкаТоваров.Подразделение           = Реквизиты.Подразделение;
	НовыйДокументСборкаТоваров.НаправлениеДеятельности = Реквизиты.НаправлениеДеятельности;
	НовыйДокументСборкаТоваров.Статус		 	 	   = Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;
	НовыйДокументСборкаТоваров.ХозяйственнаяОперация   = Перечисления.ХозяйственныеОперации.СборкаТоваров;
	НовыйДокументСборкаТоваров.Ответственный		   = ПользователиКлиентСервер.ТекущийПользователь();
	НовыйДокументСборкаТоваров.ВариантПриемкиТоваров   = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	НовыйДокументСборкаТоваров.НачалоСборкиРазборки	   = ТекущаяДата();
	НовыйДокументСборкаТоваров.ОкончаниеСборкиРазборки = ТекущаяДата();
	НовыйДокументСборкаТоваров.Приоритет               = ЗначениеНастроекПовтИсп.ПолучитьПриоритетПоУмолчанию();

//	НовыйДокументСборкаТоваров.СборкаПодДеятельность   = Перечисления.ТипыНалогообложенияНДС;
	
//	ПараметрыЗаполнения = Документы.ЗаказНаСборку.ПараметрыЗаполненияВидаДеятельностиНДС(НовыйДокументСборкаТоваров);
	
	// Заполнение табличной части.
	//ПараметрыТаблицыТовары							   = ПараметрыТаблицыОстатковПоЗаказу();
	//ПараметрыТаблицыТовары.ПолучатьУслуги			   = Ложь;
	//ПараметрыТаблицыТовары.ПолучатьРаботы			   = Ложь;
	//ТаблицаТовары									   = ТаблицаОстатковКЗаказу(ЗаказКлиента, ПараметрыТаблицыТовары);
	
	ПараметрыСоздания = Документы.ЗаказНаСборку.ПараметрыСозданияНаОснованииОбеспечивающегоЗаказа();
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ЗаказКлиента);
	МенеджерДокумента.ТоварыДокументаДляСозданияОбеспечивающегоЗаказа(
		ЗаказКлиента,
		ПараметрыСоздания,
		МенеджерВременныхТаблиц);
		
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Склады", ЗаказКлиента.Склад);
	Запрос.УстановитьПараметр("ВсеСклады", Не ЗначениеЗаполнено(ЗаказКлиента.Склад));

	ВариантыОбеспечения = Новый Массив;
	ВариантыОбеспечения.Добавить(Перечисления.ВариантыОбеспечения.КОбеспечению);
	
	Запрос.УстановитьПараметр("ВариантыОбеспечения", ВариантыОбеспечения);
	Запрос.УстановитьПараметр("ВсеДействия", ВариантыОбеспечения.Количество() = 0);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(Товары.НомерСтроки) КАК НомерСтрокиВДокументе,
		|	Товары.Номенклатура КАК Номенклатура,
		|	МИНИМУМ(Товары.Номенклатура.ТипНоменклатуры) КАК ТипНоменклатуры,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Упаковка КАК Упаковка,
		|	Товары.Склад КАК Склад,
		|	Товары.Подразделение КАК Подразделение,
		|	Товары.Назначение КАК Назначение,
		|	Товары.ВариантОбеспечения КАК ВариантОбеспечения,
		|	Товары.Обособленно КАК Обособленно,
		|	Товары.ДатаОтгрузки КАК ДатаОтгрузки,
		|	СУММА(Товары.КоличествоПоДокументу) КАК КоличествоУпаковок,
		|	ИСТИНА КАК Отметка,
		|	СУММА(Товары.КоличествоПоДокументу) КАК Количество
		|ИЗ
		|	ТоварыДокумента КАК Товары
		|ГДЕ
		|	(&ВсеСклады ИЛИ Товары.Склад = &Склады)
		|		И (&ВсеДействия ИЛИ Товары.ВариантОбеспечения В(&ВариантыОбеспечения))
		|СГРУППИРОВАТЬ ПО
		|	Товары.Номенклатура,
		|	Товары.Характеристика,
		|	Товары.Упаковка,
		|	Товары.Склад,
		|	Товары.Подразделение,
		|	Товары.Назначение,
		|	Товары.ВариантОбеспечения,
		|	Товары.Обособленно,
		|	Товары.ДатаОтгрузки
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтрокиВДокументе";
	
	УстановитьПривилегированныйРежим(Истина);
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаТовары = ПакетРезультатов[0].Выгрузить();
	
	//**ИЗМЕНЕНО Максимов В.А.
	
	Если ТаблицаТовары.Количество() > 0 Тогда
		
		Для Каждого Строка Из ТаблицаТовары Цикл
			
			Если Строка.Номенклатура.ВидНоменклатуры.Наименование = "Комплекты" Тогда
				НовыйДокументСборкаТоваров.Упаковка			   = ПолучитьУпаковку(ЗаказКлиента, Строка.Номенклатура, Строка.Характеристика);
				ЗаполнитьЗначенияСвойств(НовыйДокументСборкаТоваров, Строка);
				
				НовыйДокументСборкаТоваров.ВариантКомплектации = Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьОсновнуюКомплектацию(
					НовыйДокументСборкаТоваров.Номенклатура, НовыйДокументСборкаТоваров.Характеристика);
				
				ЗаполнитьТоварыПоВариантуКомплектации(НовыйДокументСборкаТоваров);
				
				Прервать;

			КонецЕсли;		
							
		КонецЦикла;	
		
		//НовыйДокументСборкаТоваров.Упаковка			   = ПолучитьУпаковку(ЗаказКлиента, ТаблицаТовары[0].Номенклатура, ТаблицаТовары[0].Характеристика);
		//ЗаполнитьЗначенияСвойств(НовыйДокументСборкаТоваров, ТаблицаТовары[0]);
		//
		//НовыйДокументСборкаТоваров.ВариантКомплектации = Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьОсновнуюКомплектацию(
		//	НовыйДокументСборкаТоваров.Номенклатура, НовыйДокументСборкаТоваров.Характеристика);
		//
		//ЗаполнитьТоварыПоВариантуКомплектации(НовыйДокументСборкаТоваров);
		
	КонецЕсли;
	
	//*********************
	
	ИнициализироватьДокумент(НовыйДокументСборкаТоваров, Реквизиты, ЗаказКлиента);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьТоварыПоВариантуКомплектации(НовыйДокументСборкаТоваров)
	
	НовыйДокументСборкаТоваров.Товары.Загрузить(Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьКомплектующиеНоменклатуры(НовыйДокументСборкаТоваров.ВариантКомплектации, , НовыйДокументСборкаТоваров.Количество));
	Для Каждого ТекСтрока Из НовыйДокументСборкаТоваров.Товары Цикл
//		ТекСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно; 
	КонецЦикла;		// ТекСтрока Из НовыйДокументСборкаТоваров.Товары.Загрузить

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоЗаказуКлиента(ЗаказКлиента)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаказКлиента.Статус КАК СтатусДокумента,
	                      |	ЗаказКлиента.Проведен КАК Проведен,
	                      |	ЗаказКлиента.Организация КАК Организация,
	                      |	ЗаказКлиента.Сделка КАК Сделка,
	                      |	ЗаказКлиента.Подразделение КАК Подразделение,
	                      |	ВЫБОР
	                      |		КОГДА ЗаказКлиента.НаправлениеДеятельности.УчетЗатрат
	                      |			ТОГДА ЗаказКлиента.НаправлениеДеятельности
	                      |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	                      |	КОНЕЦ КАК НаправлениеДеятельности
	                      |ИЗ
	                      |	Документ.ЗаказКлиента КАК ЗаказКлиента
	                      |ГДЕ
	                      |	ЗаказКлиента.Ссылка = &ЗаказКлиента");
	
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	Возврат Реквизиты;
	
КонецФункции // ПолучитьДанныеПоЗаказуКлиента()

&НаСервереБезКонтекста
Функция ПолучитьУпаковку(ЗаказКлиента, Номенклатура, Характеристика)
	
	СтруктураПоиска = Новый Структура("Номенклатура, Характеристика", Номенклатура, Характеристика);
	МассивСтрок = ЗаказКлиента.Товары.НайтиСтроки(СтруктураПоиска);
	Если НЕ МассивСтрок.Количество() = 0 Тогда
		Возврат МассивСтрок[0].Упаковка;
	Иначе
		Возврат Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции // ПолучитУпаковку()

&НаСервереБезКонтекста
Процедура ИнициализироватьДокумент(НовыйДокументСборкаТоваров, Реквизиты, ДанныеЗаполнения = Неопределено)

	НовыйДокументСборкаТоваров.Ответственный = Пользователи.ТекущийПользователь();
	НовыйДокументСборкаТоваров.Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Реквизиты.Организация);
	НовыйДокументСборкаТоваров.Склад = ЗначениеНастроекПовтИсп.ПолучитьСкладПоУмолчанию(НовыйДокументСборкаТоваров.Склад);
	НовыйДокументСборкаТоваров.Подразделение = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Пользователи.ТекущийПользователь());
	НовыйДокументСборкаТоваров.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
	
	Статус = Перечисления.СтатусыВнутреннихЗаказов.Закрыт;
	
	ОбеспечениеВДокументахСервер.ЗаполнитьВариантОбеспеченияПоУмолчанию(НовыйДокументСборкаТоваров.Товары);
	
	ВариантОбеспечения = Неопределено;
	Если НовыйДокументСборкаТоваров.Товары.Количество() > 0 Тогда
		ВариантОбеспечения = НовыйДокументСборкаТоваров.Товары[0].ВариантОбеспечения;
	КонецЕсли;
	
	Если НЕ ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
		 ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
	КонецЕсли;
	 
	Для Каждого ТекСтрока Из НовыйДокументСборкаТоваров.Товары Цикл
		ТекСтрока.ВариантОбеспечения = ВариантОбеспечения;
		ТекСтрока.Обособленно = Истина;
	КонецЦикла;		// ТекСтрока Из НовыйДокументСборкаТоваров.Товары 
	
	// Заполнение варианта обеспечения разбираемого комплекта.
	ТаблицаИзОбъекта = Новый ТаблицаЗначений();
	ТаблицаИзОбъекта.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ЗаполнитьЗначенияСвойств(ТаблицаИзОбъекта.Добавить(), НовыйДокументСборкаТоваров);
	
	ТаблицаИзОбъекта.Колонки.Добавить("ВариантОбеспечения");
	ТаблицаИзОбъекта.Колонки.Добавить("Обособленно");
	ОбеспечениеВДокументахСервер.ЗаполнитьВариантОбеспеченияПоУмолчанию(ТаблицаИзОбъекта);
	
	ВариантОбеспечения = ТаблицаИзОбъекта[0].ВариантОбеспечения;
	
	ОбосабливатьПоНазначениюЗаказа = Константы.ВариантОбособленияТоваровВСборке.Получить()
		<> Перечисления.ВариантыОбособленияТоваровВСборке.НазначениеСобираемогоКомплекта;
	
	ВариантПриемкиТоваров = ЗакупкиСервер.ПолучитьВариантПриемкиТоваров();
	
	ПараметрыЗаполнения = Документы.ЗаказНаСборку.ПараметрыЗаполненияВидаДеятельностиНДС(НовыйДокументСборкаТоваров);
	УчетНДСУП.ЗаполнитьВидДеятельностиНДС(НовыйДокументСборкаТоваров.СборкаПодДеятельность, ПараметрыЗаполнения);
	
КонецПроцедуры


#КонецОбласти

#Область ПечатьСчетНаОплату

&НаСервере
Функция Компит_ПечатьСчетНаОплатуСервер(ЗаказКлиента)
	
	ПараметрыПечати = Неопределено;
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ЗаказКлиента.Ссылка);	
	
	Если ПараметрыПечати <> Неопределено И ПараметрыПечати.Свойство("ОтображатьСкидки") Тогда
		ОтображатьСкидки = ПараметрыПечати.ОтображатьСкидки;
	Иначе
		ОтображатьСкидки = (Константы.ОтображениеСкидокВПечатныхФормахДокументовПродажи.Получить()
			<> Перечисления.ВариантыВыводаСкидокВПечатныхФормах.НеВыводитьСкидки);
	КонецЕсли; 
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Документы.Ссылка КАК Ссылка,
	|	Документы.Номер КАК Номер,
	|	Документы.Дата КАК Дата,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОснование,
	|	ЕСТЬNULL(Документы.БанковскийСчет.Владелец, Документы.Организация) КАК Организация,
	|	Документы.Организация КАК ОрганизацияПоставщик,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителя,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	ВЫБОР
	|		КОГДА Документы.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|				ИЛИ Документы.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УчитыватьНДС,
	|	Документы.Контрагент КАК Контрагент,
	|	Документы.Контрагент.ЮрФизЛицо КАК КонтрагентЮрФизЛицо,
	|	Документы.БанковскийСчет КАК БанковскийСчет,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.ИностранныйБанк
	|				ИЛИ Документы.БанковскийСчет.ВалютаДенежныхСредств <> Константы.ВалютаРегламентированногоУчета
	|				ИЛИ Документы.БанковскийСчетКонтрагента.ИностранныйБанк
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПлатежЗаРубеж,
	|	Документы.БанковскийСчет.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	Документы.БанковскийСчет.СВИФТБанка КАК СВИФТБанка,
	|	Документы.БанковскийСчет.СВИФТБанкаДляРасчетов КАК СВИФТБанкаДляРасчетов,
	|	Документы.БанковскийСчет.АдресБанка КАК АдресБанка,
	|	Документы.БанковскийСчет.АдресБанкаДляРасчетов КАК АдресБанкаДляРасчетов,
	|	Документы.БанковскийСчет.СчетВБанкеДляРасчетов КАК СчетВБанкеДляРасчетов,
	|	Документы.БанковскийСчет.НомерСчета КАК НомерБанковскогоСчета,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка
	|			ТОГДА Документы.БанковскийСчет.БИКБанка
	|		ИНАЧЕ КлассификаторБанков.Код
	|	КОНЕЦ КАК БИКБанк,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка
	|			ТОГДА Документы.БанковскийСчет.НаименованиеБанка
	|		ИНАЧЕ КлассификаторБанков.Наименование
	|	КОНЕЦ КАК НаименованиеБанка,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка
	|			ТОГДА Документы.БанковскийСчет.КоррСчетБанка
	|		ИНАЧЕ КлассификаторБанков.КоррСчет
	|	КОНЕЦ КАК КоррСчетБанка,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанка
	|			ТОГДА Документы.БанковскийСчет.ГородБанка
	|		ИНАЧЕ КлассификаторБанков.Город
	|	КОНЕЦ КАК ГородБанка,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА Документы.БанковскийСчет.БИКБанкаДляРасчетов
	|		ИНАЧЕ КлассификаторБанковКорреспондентовРФ.Код
	|	КОНЕЦ КАК БИКБанкаДляРасчетов,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА Документы.БанковскийСчет.НаименованиеБанкаДляРасчетов
	|		ИНАЧЕ КлассификаторБанковКорреспондентовРФ.Наименование
	|	КОНЕЦ КАК НаименованиеБанкаДляРасчетов,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА Документы.БанковскийСчет.КоррСчетБанкаДляРасчетов
	|		ИНАЧЕ КлассификаторБанковКорреспондентовРФ.КоррСчет
	|	КОНЕЦ КАК КоррСчетБанкаДляРасчетов,
	|	ВЫБОР
	|		КОГДА Документы.БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов
	|			ТОГДА Документы.БанковскийСчет.ГородБанкаДляРасчетов
	|		ИНАЧЕ КлассификаторБанковКорреспондентовРФ.Город
	|	КОНЕЦ КАК ГородБанкаДляРасчетов,
	|	Документы.БанковскийСчет.ТекстКорреспондента КАК БанковскийСчетТекстКорреспондента,
	|	Документы.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	Документы.Валюта КАК Валюта,
	|	Документы.Менеджер.ФизическоеЛицо КАК Менеджер,
	|	Документы.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	Документы.СуммаДокумента КАК СуммаКВозврату,
	|	ЛОЖЬ КАК ЧастичнаяОплата,
	|	Документы.НазначениеПлатежа КАК НазначениеПлатежа,
	|	100 КАК ПроцентОплаты,
	|	Документы.СуммаДокумента КАК СуммаДокумента,
	|	Документы.Грузоотправитель КАК Грузоотправитель,
	|	Документы.Грузополучатель КАК Грузополучатель,
	|	Документы.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	|	ЛОЖЬ КАК СчетКВозврату
	|ИЗ
	|	Документ.ЗаказКлиента КАК Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО Документы.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
	|		ПО Документы.БанковскийСчет.Банк = КлассификаторБанков.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанковКорреспондентовРФ
	|		ПО Документы.БанковскийСчет.БанкДляРасчетов = КлассификаторБанковКорреспондентовРФ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Документы.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ЭтапыГрафикаОплаты.Ссылка КАК Ссылка,
	|	ЭтапыГрафикаОплаты.НомерСтроки КАК НомерСтроки,
	|	ЭтапыГрафикаОплаты.ДатаПлатежа КАК ДатаПлатежа,
	|	ЭтапыГрафикаОплаты.ПроцентПлатежа КАК ПроцентПлатежа,
	|	ЭтапыГрафикаОплаты.СуммаПлатежа КАК СуммаПлатежа,
	|	ЛОЖЬ КАК ЭтоЗалогЗаТару
	|ИЗ
	|	Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЭтапыГрафикаОплаты
	|ГДЕ
	|	ЭтапыГрафикаОплаты.Ссылка В(&МассивОбъектов)
	|	И ЭтапыГрафикаОплаты.СуммаПлатежа <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ЭтапыГрафикаОплаты.Ссылка,
	|	ЭтапыГрафикаОплаты.НомерСтроки,
	|	ЭтапыГрафикаОплаты.ДатаПлатежа,
	|	ЭтапыГрафикаОплаты.ПроцентЗалогаЗаТару,
	|	ЭтапыГрафикаОплаты.СуммаЗалогаЗаТару,
	|	ИСТИНА
	|ИЗ
	|	Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЭтапыГрафикаОплаты
	|ГДЕ
	|	ЭтапыГрафикаОплаты.Ссылка В(&МассивОбъектов)
	|	И ЭтапыГрафикаОплаты.Ссылка.ТребуетсяЗалогЗаТару
	|	И ЭтапыГрафикаОплаты.СуммаЗалогаЗаТару <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка,
	|	ВариантыКомплектацииНоменклатуры.Ссылка КАК ВариантКомплектацииНоменклатуры,
	|	ВариантыКомплектацииНоменклатуры.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
	|	ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора,
	|	Таблица.НоменклатураНабора КАК НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Характеристика КАК Характеристика,
	|	Таблица.Упаковка КАК Упаковка,
	|	Таблица.Количество КАК Количество,
	|	Таблица.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА &ОтображатьСкидки
	|			ТОГДА Таблица.Цена
	|		ИНАЧЕ Таблица.Сумма / Таблица.КоличествоУпаковок
	|	КОНЕЦ КАК Цена,
	|	Таблица.Сумма КАК Сумма,
	|	Таблица.СтавкаНДС КАК СтавкаНДС,
	|	Таблица.СуммаНДС КАК СуммаНДС,
	|	Таблица.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ВЫБОР
	|		КОГДА Таблица.Ссылка.ВернутьМногооборотнуюТару
	|				И Таблица.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратнаяТара,
	|	ВЫБОР
	|		КОГДА &ОтображатьСкидки
	|			ТОГДА Таблица.СуммаРучнойСкидки + Таблица.СуммаАвтоматическойСкидки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаСкидки,
	|	Таблица.Сумма + Таблица.СуммаРучнойСкидки + Таблица.СуммаАвтоматическойСкидки КАК СуммаБезСкидки,
	|	Таблица.Содержание КАК Содержание
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	|		ПО (ВариантыКомплектацииНоменклатуры.Владелец = Таблица.НоменклатураНабора)
	|			И (ВариантыКомплектацииНоменклатуры.Характеристика = Таблица.ХарактеристикаНабора)
	|			И (ВариантыКомплектацииНоменклатуры.Основной)
	|ГДЕ
	|	Таблица.Ссылка В(&МассивОбъектов)
	|	И Таблица.Отменено = ЛОЖЬ
	|	И (Таблица.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИЛИ Таблица.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|				И (НЕ Таблица.Ссылка.ВернутьМногооборотнуюТару
	|					ИЛИ Таблица.Ссылка.ТребуетсяЗалогЗаТару))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.НоменклатураНабора КАК НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	МИНИМУМ(Таблица.НомерСтроки) КАК НомерСтроки,
	|	СУММА(Таблица.Сумма) КАК Сумма,
	|	СУММА(Таблица.СуммаНДС) КАК СуммаНДС,
	|	МАКСИМУМ(Таблица.ДатаОтгрузки) КАК ДатаОтгрузки,
	|	СУММА(Таблица.СуммаСкидки) КАК СуммаСкидки,
	|	СУММА(Таблица.СуммаБезСкидки) КАК СуммаБезСкидки
	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыПодготовка
	|ИЗ
	|	Товары КАК Таблица
	|ГДЕ
	|	Таблица.НоменклатураНабора <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.Ссылка,
	|	Таблица.НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.ВариантКомплектацииНоменклатуры КАК ВариантКомплектацииНоменклатуры,
	|	Товары.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
	|	Товары.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора,
	|	Товары.НоменклатураНабора КАК НоменклатураНабора,
	|	Товары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА Товары.ВариантКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = Товары.Номенклатура
	|				И Товары.ВариантКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = Товары.Характеристика
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОсновнаяКомплектующая,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	0 КАК КоличествоПоУмолчанию,
	|	Товары.Количество КАК Количество
	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыДополнительноЧастьПервая
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	Товары.НоменклатураНабора <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантПредставленияНабораВПечатныхФормах,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантРасчетаЦеныНабора,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
	|	ЛОЖЬ,
	|	NULL,
	|	СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество),
	|	0
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Т.Ссылка КАК Ссылка
	|		ИЗ
	|			Товары КАК Т) КАК Т
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Т.ВариантКомплектацииНоменклатуры
	|			ИЗ
	|				Товары КАК Т)
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Упаковка,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантПредставленияНабораВПечатныхФормах,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантРасчетаЦеныНабора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.ВариантКомплектацииНоменклатуры КАК ВариантКомплектацииНоменклатуры,
	|	Таблица.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора,
	|	Таблица.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
	|	Таблица.НоменклатураНабора КАК НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Характеристика КАК Характеристика,
	|	МАКСИМУМ(Таблица.СтавкаНДС) КАК СтавкаНДС,
	|	МАКСИМУМ(Таблица.ОсновнаяКомплектующая) КАК ОсновнаяКомплектующая,
	|	СУММА(Таблица.КоличествоПоУмолчанию) КАК КоличествоПоУмолчанию,
	|	СУММА(Таблица.Количество) КАК Количество
	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыДополнительноЧастьВторая
	|ИЗ
	|	ВременнаяТаблицаНаборыДополнительноЧастьПервая КАК Таблица
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.Ссылка,
	|	Таблица.ВариантКомплектацииНоменклатуры,
	|	Таблица.ВариантРасчетаЦеныНабора,
	|	Таблица.ВариантПредставленияНабораВПечатныхФормах,
	|	Таблица.НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора,
	|	Таблица.Номенклатура,
	|	Таблица.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Результат.Ссылка КАК Ссылка,
	|	Результат.ВариантКомплектацииНоменклатуры КАК ВариантКомплектацииНоменклатуры,
	|	Результат.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора,
	|	Результат.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
	|	Результат.НоменклатураНабора КАК НоменклатураНабора,
	|	Результат.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Результат.ОсновнаяКомплектующая
	|				ТОГДА Результат.СтавкаНДС
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК СтавкаНДС,
	|	(ВЫРАЗИТЬ(МИНИМУМ(ВЫБОР
	|				КОГДА Результат.КоличествоПоУмолчанию <> 0
	|						И Результат.ОсновнаяКомплектующая
	|					ТОГДА Результат.Количество / Результат.КоличествоПоУмолчанию
	|				ИНАЧЕ NULL
	|			КОНЕЦ) + 0.5 КАК ЧИСЛО(10, 0))) - 1 КАК Количество
	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыДополнительно
	|ИЗ
	|	ВременнаяТаблицаНаборыДополнительноЧастьВторая КАК Результат
	|
	|СГРУППИРОВАТЬ ПО
	|	Результат.Ссылка,
	|	Результат.ВариантКомплектацииНоменклатуры,
	|	Результат.ВариантРасчетаЦеныНабора,
	|	Результат.ВариантПредставленияНабораВПечатныхФормах,
	|	Результат.НоменклатураНабора,
	|	Результат.ХарактеристикаНабора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаНаборыДополнительно.ВариантКомплектацииНоменклатуры КАК ВариантКомплектацииНоменклатуры,
	|	ВЫБОР
	|		КОГДА Таблица.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах = ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоНабор)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие)
	|					ИНАЧЕ ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах
	|				КОНЕЦ
	|		ИНАЧЕ ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах
	|	КОНЕЦ КАК ВариантПредставленияНабораВПечатныхФормах,
	|	ВЫБОР
	|		КОГДА Таблица.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫБОР
	|								КОГДА ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах = ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоНабор)
	|									ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие)
	|								ИНАЧЕ ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах
	|							КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие)
	|							И ВременнаяТаблицаНаборыДополнительно.ВариантРасчетаЦеныНабора В (ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам), ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям))
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих)
	|					ИНАЧЕ ВременнаяТаблицаНаборыДополнительно.ВариантРасчетаЦеныНабора
	|				КОНЕЦ
	|		ИНАЧЕ ВременнаяТаблицаНаборыДополнительно.ВариантРасчетаЦеныНабора
	|	КОНЕЦ КАК ВариантРасчетаЦеныНабора,
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.НоменклатураНабора КАК НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.Количество, 1) КАК КоличествоУпаковок,
	|	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.Количество, 1) КАК Количество,
	|	Таблица.Сумма КАК Сумма,
	|	Таблица.СуммаНДС КАК СуммаНДС,
	|	Таблица.ДатаОтгрузки КАК ДатаОтгрузки,
	|	Таблица.СуммаСкидки КАК СуммаСкидки,
	|	Таблица.СуммаБезСкидки КАК СуммаБезСкидки,
	|	ВременнаяТаблицаНаборыДополнительно.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ ВременнаяТаблицаНаборы
	|ИЗ
	|	ВременнаяТаблицаНаборыПодготовка КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНаборыДополнительно КАК ВременнаяТаблицаНаборыДополнительно
	|		ПО Таблица.НоменклатураНабора = ВременнаяТаблицаНаборыДополнительно.НоменклатураНабора
	|			И Таблица.ХарактеристикаНабора = ВременнаяТаблицаНаборыДополнительно.ХарактеристикаНабора
	|			И Таблица.Ссылка = ВременнаяТаблицаНаборыДополнительно.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
	|	Товары.ВариантРасчетаЦеныНабора КАК ВариантРасчетаЦеныНабора,
	|	Товары.НоменклатураНабора КАК НоменклатураНабора,
	|	Товары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	Товары.ЭтоНабор КАК ЭтоНабор,
	|	Товары.ЭтоКомплектующие КАК ЭтоКомплектующие,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Номенклатура.Код КАК Код,
	|	Товары.Номенклатура.Артикул КАК Артикул,
	|	Товары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	&ТекстЗапросаНаименованиеЕдиницыИзмерения КАК ЕдиницаИзмерения,
	|	Товары.КоличествоУпаковок КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	НЕОПРЕДЕЛЕНО КАК ВидЦеныИсполнителя,
	|	Товары.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЕСТЬNULL(Товары.Характеристика.НаименованиеПолное, """") КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) = 1
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Товары.Упаковка.Наименование
	|	КОНЕЦ КАК Упаковка,
	|	Товары.СуммаСкидки КАК СуммаСкидки,
	|	Товары.СуммаБезСкидки КАК СуммаБезСкидки,
	|	Товары.Содержание КАК Содержание,
	|	Товары.ЭтоВозвратнаяТара КАК ЭтоВозвратнаяТара
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.Ссылка КАК Ссылка,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0
	|				ТОГДА ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ПустаяСсылка)
	|		КОНЕЦ КАК ВариантПредставленияНабораВПечатныхФормах,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0
	|				ТОГДА ВременнаяТаблицаНаборы.ВариантРасчетаЦеныНабора
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка)
	|		КОНЕЦ КАК ВариантРасчетаЦеныНабора,
	|		Таблица.НоменклатураНабора КАК НоменклатураНабора,
	|		Таблица.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЭтоКомплектующие,
	|		ЛОЖЬ КАК ЭтоНабор,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0
	|				ТОГДА ВременнаяТаблицаНаборы.НомерСтроки
	|			ИНАЧЕ Таблица.НомерСтроки
	|		КОНЕЦ КАК НомерСтроки,
	|		Таблица.Номенклатура КАК Номенклатура,
	|		Таблица.Количество КАК Количество,
	|		Таблица.КоличествоУпаковок КАК КоличествоУпаковок,
	|		Таблица.Цена КАК Цена,
	|		Таблица.Сумма КАК Сумма,
	|		Таблица.СтавкаНДС КАК СтавкаНДС,
	|		Таблица.СуммаНДС КАК СуммаНДС,
	|		Таблица.ДатаОтгрузки КАК ДатаОтгрузки,
	|		Таблица.Характеристика КАК Характеристика,
	|		Таблица.Упаковка КАК Упаковка,
	|		Таблица.СуммаСкидки КАК СуммаСкидки,
	|		Таблица.СуммаБезСкидки КАК СуммаБезСкидки,
	|		Таблица.Содержание КАК Содержание,
	|		Таблица.ЭтоВозвратнаяТара КАК ЭтоВозвратнаяТара
	|	ИЗ
	|		Товары КАК Таблица
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНаборы КАК ВременнаяТаблицаНаборы
	|			ПО (ВременнаяТаблицаНаборы.НоменклатураНабора = Таблица.НоменклатураНабора)
	|				И (ВременнаяТаблицаНаборы.ХарактеристикаНабора = Таблица.ХарактеристикаНабора)
	|				И (ВременнаяТаблицаНаборы.Ссылка = Таблица.Ссылка)
	|	ГДЕ
	|		(Таблица.НоменклатураНабора = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ИЛИ Таблица.НоменклатураНабора <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|					И ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах В (ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоКомплектующие), ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие)))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВременнаяТаблицаНаборы.Ссылка,
	|		ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах,
	|		ВременнаяТаблицаНаборы.ВариантРасчетаЦеныНабора,
	|		ВременнаяТаблицаНаборы.НоменклатураНабора,
	|		ВременнаяТаблицаНаборы.ХарактеристикаНабора,
	|		ЛОЖЬ,
	|		ИСТИНА,
	|		ВременнаяТаблицаНаборы.НомерСтроки,
	|		ВременнаяТаблицаНаборы.НоменклатураНабора,
	|		ВременнаяТаблицаНаборы.Количество,
	|		ВременнаяТаблицаНаборы.КоличествоУпаковок,
	|		ВЫБОР
	|			КОГДА &ОтображатьСкидки
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.КоличествоУпаковок, 1) <> 0
	|							ТОГДА ВременнаяТаблицаНаборы.СуммаБезСкидки / ЕСТЬNULL(ВременнаяТаблицаНаборы.КоличествоУпаковок, 1)
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.КоличествоУпаковок, 1) <> 0
	|						ТОГДА ВременнаяТаблицаНаборы.Сумма / ЕСТЬNULL(ВременнаяТаблицаНаборы.КоличествоУпаковок, 1)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ,
	|		ВременнаяТаблицаНаборы.Сумма,
	|		ВременнаяТаблицаНаборы.СтавкаНДС,
	|		ВременнаяТаблицаНаборы.СуммаНДС,
	|		ВременнаяТаблицаНаборы.ДатаОтгрузки,
	|		ВременнаяТаблицаНаборы.ХарактеристикаНабора,
	|		ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
	|		ВременнаяТаблицаНаборы.СуммаСкидки,
	|		ВременнаяТаблицаНаборы.СуммаБезСкидки,
	|		"""",
	|		ЛОЖЬ
	|	ИЗ
	|		ВременнаяТаблицаНаборы КАК ВременнаяТаблицаНаборы
	|	ГДЕ
	|		ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах В (ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоНабор), ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие))) КАК Товары
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.НомерСтроки,
	|	ЭтоНабор УБЫВ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ТекстЗапросаКоэффициентУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"Товары.Упаковка",
			"Товары.Номенклатура"));
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ТекстЗапросаНаименованиеЕдиницыИзмерения",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
			"Наименование",
			"Товары.Упаковка",
			"Товары.Номенклатура"));
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ОтображатьСкидки", ОтображатьСкидки);
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДанныхДляПечати = Новый Структура;
	СтруктураДанныхДляПечати.Вставить("РезультатПоШапке", ПакетРезультатовЗапроса[0]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоЭтапамОплаты", ПакетРезультатовЗапроса[1]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоТабличнойЧасти", ПакетРезультатовЗапроса[ПакетРезультатовЗапроса.Количество() - 1]);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции	

#КонецОбласти


#Область ВспомогательныеПроцедурыФункции

// добавим реквизиты и элементы формы
&НаСервере
Процедура ДополнитьФормуПриСозданииНаСервере(ФормаОбъекта)

	// YuS, добавляем поле быстрого отбора
	ГруппаБыстрыхОтборовФормы = ФормаОбъекта.Элементы.Найти("ГруппаЗаказыКлиентовБыстрыеОтборы");
	
	// Поле "Документы возвращены"
	Если ФормаОбъекта.Элементы.Найти("ЗаказыКлиентовМенеджерКонтрагента") = Неопределено Тогда
		
		// найдем реквизит
		РеквизитДобавляемыйНаФорму = Неопределено;
		РеквизитыФормыМассив = ФормаОбъекта.ПолучитьРеквизиты();
		Для Каждого ЭлементМассиваРеквизитФормы Из РеквизитыФормыМассив Цикл
			
			Если ЭлементМассиваРеквизитФормы.Имя = "ЗаказыКлиентовМенеджерКонтрагента" Тогда
				
				РеквизитДобавляемыйНаФорму = ЭлементМассиваРеквизитФормы;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// добавим реквизит
		Если РеквизитДобавляемыйНаФорму = Неопределено Тогда
			РеквизитыФормыМассив = Новый Массив;
			РеквизитыФормыМассив.Добавить(Новый РеквизитФормы("ЗаказыКлиентовМенеджерКонтрагента", Новый ОписаниеТипов("СправочникСсылка.Пользователи", , , , , , ), , "Менеджер клиента", Ложь));
			ФормаОбъекта.ИзменитьРеквизиты(РеквизитыФормыМассив);
		КонецЕсли;
		
		// элемент формы
		ЭлементФормыМенеджерКонтрагента = ФормаОбъекта.Элементы.Добавить("ЗаказыКлиентовМенеджерКонтрагента", Тип("ПолеФормы"), ГруппаБыстрыхОтборовФормы);
		ЭлементФормыМенеджерКонтрагента.Заголовок          = НСтр("ru = 'Менеджер клиента'");
		ЭлементФормыМенеджерКонтрагента.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		ЭлементФормыМенеджерКонтрагента.Вид                = ВидПоляФормы.ПолеВвода;
		ЭлементФормыМенеджерКонтрагента.ПутьКДанным        = "ЗаказыКлиентовСписок.МенеджерКонтрагента";
		
		// расширение элемента
		ЭлементФормыМенеджерКонтрагента.КнопкаОткрытия          = Ложь;
		ЭлементФормыМенеджерКонтрагента.КнопкаВыпадающегоСписка = Истина;
		ЭлементФормыМенеджерКонтрагента.КнопкаОчистки           = Истина;
		ЭлементФормыМенеджерКонтрагента.РежимВыбораИзСписка     = Ложь;
		
		ЭлементФормыМенеджерКонтрагента.УстановитьДействие("ПриИзменении", "ЗаказыКлиентовМенеджерКонтрагентаПриИзменении");
		
	КонецЕсли;
	
	// Поле "Документы возвращены"
	Если ФормаОбъекта.Элементы.Найти("ЗаказыКлиентовДокументыВозвращены") = Неопределено Тогда
		
		// найдем реквизит
		РеквизитДобавляемыйНаФорму = Неопределено;
		РеквизитыФормыМассив = ФормаОбъекта.ПолучитьРеквизиты();
		Для Каждого ЭлементМассиваРеквизитФормы Из РеквизитыФормыМассив Цикл
			
			Если ЭлементМассиваРеквизитФормы.Имя = "ЗаказыКлиентовДокументыВозвращены" Тогда
				
				РеквизитДобавляемыйНаФорму = ЭлементМассиваРеквизитФормы;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// добавим реквизит
		Если РеквизитДобавляемыйНаФорму = Неопределено Тогда
			РеквизитыФормыМассив = Новый Массив;
			РеквизитыФормыМассив.Добавить(Новый РеквизитФормы("ЗаказыКлиентовДокументыВозвращены", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная), , ), , "Документы возвращены", Ложь));
			ФормаОбъекта.ИзменитьРеквизиты(РеквизитыФормыМассив);
		КонецЕсли;
		
		// элемент формы
		ЭлементФормыДокументыВозвращены = ФормаОбъекта.Элементы.Добавить("ЗаказыКлиентовДокументыВозвращены", Тип("ПолеФормы"), ГруппаБыстрыхОтборовФормы);
		ЭлементФормыДокументыВозвращены.Заголовок          = НСтр("ru = 'Документы возвращены'");
		ЭлементФормыДокументыВозвращены.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		ЭлементФормыДокументыВозвращены.Вид                = ВидПоляФормы.ПолеВвода;
		ЭлементФормыДокументыВозвращены.ПутьКДанным        = "ЗаказыКлиентовСписок.ДокументыВозвращены";
		
		// расширение элемента
		ЭлементФормыДокументыВозвращены.КнопкаВыпадающегоСписка = Истина;
		ЭлементФормыДокументыВозвращены.КнопкаОчистки           = Истина;
		ЭлементФормыДокументыВозвращены.РежимВыбораИзСписка     = Истина;
		
		// список значений элемента
		СписокВыбораЗначений = ЭлементФормыДокументыВозвращены.СписокВыбора;
		СписокВыбораЗначений.Добавить("Да",  "Да", , );
		СписокВыбораЗначений.Добавить("Нет", "Нет", , );
		
		ЭлементФормыДокументыВозвращены.УстановитьДействие("ПриИзменении", "ЗаказыКлиентовДокументыВозвращеныПриИзменении");
		
	КонецЕсли;

КонецПроцедуры

// действие "При изменении" добавленного поля формы
&НаКлиенте
Процедура ЗаказыКлиентовМенеджерКонтрагентаПриИзменении(Элемент)

	ДанныеРеквизитаФормы = ЭтаФорма[Элемент.Имя];
	Если ДанныеРеквизитаФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//УстановитьЭлементОтбораДинамическогоСписка(	ДинамическийСписок,
	//												ИмяПоля,
	//												ПравоеЗначение = Неопределено,
	//												ВидСравнения = Неопределено,
	//												Представление = Неопределено,
	//												Использование = Неопределено,
	//												РежимОтображения = Неопределено,
	//												ИдентификаторПользовательскойНастройки = Неопределено)
	
	Если ЗначениеЗаполнено(ДанныеРеквизитаФормы) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказыКлиентовСписок, "ЗаказыКлиентовСписок.МенеджерКонтрагента", ДанныеРеквизитаФормы, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказыКлиентовСписок, "ЗаказыКлиентовСписок.МенеджерКонтрагента", ДанныеРеквизитаФормы, ВидСравненияКомпоновкиДанных.Равно, , Ложь);
	КонецЕсли;

КонецПроцедуры

// действие "При изменении" добавленного поля формы
&НаКлиенте
Процедура ЗаказыКлиентовДокументыВозвращеныПриИзменении(Элемент)

	ДанныеРеквизитаФормы = ЭтаФорма[Элемент.Имя];
	Если ДанныеРеквизитаФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеРеквизитаФормы = "Да" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказыКлиентовСписок, "ЗаказыКлиентовСписок.ДокументыВозвращены", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	ИначеЕсли ДанныеРеквизитаФормы = "Нет" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказыКлиентовСписок, "ЗаказыКлиентовСписок.ДокументыВозвращены", Истина, ВидСравненияКомпоновкиДанных.НеЗаполнено, , Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаказыКлиентовСписок, "ЗаказыКлиентовСписок.ДокументыВозвращены", Истина, ВидСравненияКомпоновкиДанных.Равно, , Ложь);
	КонецЕсли;

КонецПроцедуры

// расширение условного оформления
// Получить заказ клиента по данным списка документов
&НаКлиенте
Функция ПолучитьСсылкуНаДокументЗаказКлиента()
    
	ТекущиеДанные = Элементы.ЗаказыКлиентов.ТекущиеДанные; // Возвращает структуру с данными
	Если ТипЗнч(ТекущиеДанные) = Тип("ДанныеФормыСтруктура")
		И ТекущиеДанные.Свойство("Ссылка")
	Тогда
		СсылкаНаДокумент = ТекущиеДанные.Ссылка;
	Иначе
		СсылкаНаДокумент = ПолучитьПустуюСсылкуНаЗаказКлиента();
	КонецЕсли;
	ТекущийЗаказКлиента = СсылкаНаДокумент;
	Возврат СсылкаНаДокумент;
	
	//ИдентификаторТекущейСтроки = Элементы.ЗаказыКлиентов.ТекущаяСтрока;
	//
	//Возврат ИдентификаторТекущейСтроки;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСсылкуНаДокументВнутреннийЗаказ()

	ТекущиеДанные = Элементы.ВнутренниеЗаказы.ТекущиеДанные; // Возвращает структуру с данными
	Если ТипЗнч(ТекущиеДанные) = Тип("ДанныеФормыСтруктура")
		И ТекущиеДанные.Свойство("Ссылка")
	Тогда
		СсылкаНаДокумент = ТекущиеДанные.Ссылка;
	Иначе
		СсылкаНаДокумент = ПолучитьПустуюСсылкуНаВнутреннийЗаказ();
	КонецЕсли;
	
	ТекущийЗаказКлиента = СсылкаНаДокумент;
	Возврат СсылкаНаДокумент;

КонецФункции


// Пустая ссылка на документ заказа клиента    
&НаСервереБезКонтекста
Функция ПолучитьПустуюСсылкуНаЗаказКлиента()

	Возврат Документы.ЗаказКлиента.ПустаяСсылка();

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПустуюСсылкуНаВнутреннийЗаказ()

	Возврат Документы.ЗаказНаВнутреннееПотребление.ПустаяСсылка();

КонецФункции


// Проверить проведен или нет
&НаСервереБезКонтекста
Функция ПроверитьДокументПроведен(СсылкаНаДокумент)
	
	
	Возврат СсылкаНаДокумент.Проведен;

КонецФункции
//Проверить возможность создания заявки на доставку
&НаСервереБезКонтекста
Функция ПроверитьДокументНаЗакрыт(СсылкаНаДокумент)

	Возврат НЕ СсылкаНаДокумент.Закрыт;

КонецФункции

// Проверить варианты комплектации по товарной позиции
&НаСервереБезКонтекста
Функция ПроверитьЗаказКлиентаТоварыЕстьКомплект(СсылкаНаДокумент)

	Если НЕ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатуры.Ссылка КАК Ссылка,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО ВариантыКомплектацииНоменклатуры.Владелец = ЗаказКлиентаТовары.Номенклатура
	|			И (ЗаказКлиентаТовары.Ссылка = &СсылкаНаДокумент)";
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();

КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьЗаказКлиентаТоварыЕстьНабор(СсылкаНаДокумент)
	
	//Если НЕ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Возврат Ложь;
	//КонецЕсли;
	//
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//				|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	//				|	ЗаказКлиентаТовары.НоменклатураНабора КАК НоменклатураНабора
	//				|ИЗ
	//				|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	//				|ГДЕ
	//				|	ЗаказКлиентаТовары.Ссылка = &СсылкаНаДокумент
	//				|	И НЕ ЗаказКлиентаТовары.НоменклатураНабора = &НоменклатураНабора";
	//
	//Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
	//Запрос.УстановитьПараметр("НоменклатураНабора", Справочники.Номенклатура.ПустаяСсылка());
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции // ПроверитьЗаказКлиентаТоварыЕстьНабор()


// Проверить варианты комплектации по товарной позиции
&НаСервереБезКонтекста
Функция ПроверитьОстаткиКОформлениюПоКомплектам(СсылкаНаДокумент)

	Если НЕ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатуры.Ссылка КАК Ссылка,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО ВариантыКомплектацииНоменклатуры.Владелец = ЗаказКлиентаТовары.Номенклатура
	|			И ВариантыКомплектацииНоменклатуры.Характеристика = ЗаказКлиентаТовары.Характеристика
	|			И (ЗаказКлиентаТовары.Ссылка = &СсылкаНаДокумент)
	|ГДЕ
	|	ВариантыКомплектацииНоменклатуры.Основной";
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
	КомплектыЗаказа		= Запрос.Выполнить().Выгрузить();
	МассивКомплектов	= КомплектыЗаказа.ВыгрузитьКолонку("Номенклатура");
	
	
	
	ТекстЗапросаПоТоварамНаСкладах 		= ТекстЗапросаТоварыНаСкладах();
	ЗапросПоТоварамПоТоварамНаСкладах 	= Новый Запрос(ТекстЗапросаПоТоварамНаСкладах);
	НазначениеТовара					= ПолучитьНазначение(СсылкаНаДокумент).Ссылка;
	ЗапросПоТоварамПоТоварамНаСкладах.УстановитьПараметр("Назначение", НазначениеТовара);
	
	ТаблицаОстатков = ЗапросПоТоварамПоТоварамНаСкладах.Выполнить().Выгрузить();
	ТаблицаКонтроля = ТаблицаОстатков.СкопироватьКолонки();
	
	Для Каждого ТекКомплкт Из КомплектыЗаказа Цикл
		Для Каждого ТекСтрока Из ТекКомплкт.Ссылка.Товары Цикл
			СтрутураПоиска  = Новый Структура("Номенклатура, Характеристика, Назначение", ТекСтрока.Номенклатура, ТекСтрока.Характеристика, НазначениеТовара);
			НайденныеСтроки = ТаблицаОстатков.НайтиСтроки(СтрутураПоиска);
			Если НЕ НайденныеСтроки.Количество() = 0 Тогда
				Для Каждого СтрОстатков Из НайденныеСтроки Цикл
					СтрОстатков.Остаток = СтрОстатков.Остаток - ТекСтрока.КоличествоУпаковок * ТекКомплкт.КоличествоУпаковок;
					НоваяСтрока = ТаблицаКонтроля.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрОстатков);
				КонецЦикла;		// СтрОстатков Из НайденныеСтроки 
			КонецЕсли;
		КонецЦикла;		// ТекСтрока Из ТекКомплкт.Ссылка.Товары
	КонецЦикла;		// ТекКомплкт Из КомплектыЗаказа 
	
	//ОбщееКоличество = ТаблицаОстатков.Итог("Остаток");
	ОбщееКоличество = ТаблицаКонтроля.Итог("Остаток");
	
	Возврат (ОбщееКоличество >= 0);

КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаТоварыНаСкладах()
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	|	ТоварыНаСкладахОстатки.Назначение КАК Назначение,
	|	ТоварыНаСкладахОстатки.Склад КАК Склад,
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	|	ТоварыНаСкладахОстатки.КОтгрузкеОстаток КАК КОтгрузкеОстаток,
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	|ГДЕ
	|	ТоварыНаСкладахОстатки.Назначение = &Назначение";
	
	Возврат ТекстЗапроса;
КонецФункции // ТекстЗапросаТоварыНаСкладах()

&НаСервереБезКонтекста
Функция ПолучитьНазначение(Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Назначения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Назначения КАК Назначения
	|ГДЕ
	|	Назначения.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат[0];
	
КонецФункции // ПолучитьНазначение()


// Получим данные о состоянии заказа клиента
&НаСервереБезКонтекста
Функция ПолучитьСостояниеЗаказаКлиента(СсылкаНаДокумент)

	СтруктураСостоянияРасчетов = Новый Структура;
	СтруктураСостоянияРасчетов.Вставить("Состояние",           Перечисления.СостоянияЗаказовКлиентов.ПустаяСсылка());
	СтруктураСостоянияРасчетов.Вставить("СостояниеПросрочено", Ложь);
	СтруктураСостоянияРасчетов.Вставить("СуммаОплаты",         0);
	СтруктураСостоянияРасчетов.Вставить("СуммаОтгрузки",       0);
	СтруктураСостоянияРасчетов.Вставить("ПроцентОплаты",       0);
	СтруктураСостоянияРасчетов.Вставить("ПроцентОтгрузки",     0);
	СтруктураСостоянияРасчетов.Вставить("СуммаДолга",          0);
	СтруктураСостоянияРасчетов.Вставить("ПроцентДолга",        0);
	СтруктураСостоянияРасчетов.Вставить("СуммаКОплате",        0);
	
	Документы.ЗаказКлиента.РассчитатьСостояние(СсылкаНаДокумент, СсылкаНаДокумент.Договор, СтруктураСостоянияРасчетов);
	
	Возврат СтруктураСостоянияРасчетов;

КонецФункции

// Получим данные о состоянии заказа поставщику
&НаСервереБезКонтекста
Функция ПолучитьСостояниеЗаказаПоставщику(СсылкаНаДокумент)

	СтруктураСостоянияРасчетов = Новый Структура;
	СтруктураСостоянияРасчетов.Вставить("Состояние",           Перечисления.СостоянияЗаказовПоставщикам.ПустаяСсылка());
	СтруктураСостоянияРасчетов.Вставить("СостояниеПросрочено", Ложь);
	СтруктураСостоянияРасчетов.Вставить("СуммаОплаты",         0);
	СтруктураСостоянияРасчетов.Вставить("СуммаОтгрузки",       0);
	СтруктураСостоянияРасчетов.Вставить("ПроцентОплаты",       0);
	СтруктураСостоянияРасчетов.Вставить("ПроцентОтгрузки",     0);
	СтруктураСостоянияРасчетов.Вставить("СуммаДолга",          0);
	СтруктураСостоянияРасчетов.Вставить("ПроцентДолга",        0);
	СтруктураСостоянияРасчетов.Вставить("СуммаКОплате",        0);
	
	Документы.ЗаказПоставщику.РассчитатьСостояние(СсылкаНаДокумент, СсылкаНаДокумент.Договор, СтруктураСостоянияРасчетов);
	
	Возврат СтруктураСостоянияРасчетов;

КонецФункции

// Заполнение таблицы формы по товарам клиента
&НаКлиенте
Процедура ОбновитьДанныеТаблицыТоваровЗаказаПокупателя(СсылкаНаДокумент)

	ДанныеЗаполнения = ПолучитьДанныеПоТоварамЗаказаКлиента(СсылкаНаДокумент);
	
	// Заполним данные по товарам заказа клиента
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив")
		И НЕ ДанныеЗаполнения.Количество() = 0
	Тогда
		
		ЗаказыКлиентовТовары.Очистить(); // очистим таблицу перед заполнением
		Для Каждого СтрокаДанных Из ДанныеЗаполнения Цикл
			
			// Данные не соответствуют ожидаемым
			Если НЕ ТипЗнч(СтрокаДанных) = Тип("Структура") Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДанныхПоТоварамЗаказаКлиента = ЗаказыКлиентовТовары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДанныхПоТоварамЗаказаКлиента, СтрокаДанных);
			
			//Если СтрокаДанных.Комплектующая И НЕ ЭтаФорма.Элементы.ЗаказыКлиентовТовары.ТекущийЭлемент = Неопределено Тогда
			//	ЭтаФорма.Элементы.ЗаказыКлиентовТовары.ЦветФона = Новый Цвет(205,255,200);
			//КонецЕсли;
			//
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

//**Изменено 07.10.19 Максимов
&НаСервере
Процедура ОбновитьДанныеТаблицыТоваровЗаказаНаСервере(СсылкаНаДокумент)

	ДанныеЗаполнения = ПолучитьДанныеПоТоварамЗаказаКлиента(СсылкаНаДокумент);
	
	//ЗаказыКлиентовТовары = РеквизитФормыВЗначение("ЗаказыКлиентовТовары");
	
	ЭтотОбъект.ЗаказыКлиентовТовары.Очистить(); // очистим таблицу перед заполнением                     
	
	
	// Заполним данные по товарам заказа клиента
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") И НЕ ДанныеЗаполнения.Количество() = 0 Тогда
		
		
		Для Каждого СтрокаДанных Из ДанныеЗаполнения Цикл
			
			// Данные не соответствуют ожидаемым
			Если НЕ ТипЗнч(СтрокаДанных) = Тип("Структура") Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДанныхПоТоварамЗаказаКлиента = ЭтотОбъект.ЗаказыКлиентовТовары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДанныхПоТоварамЗаказаКлиента, СтрокаДанных);
			
			//Если СтрокаДанных.Комплектующая И НЕ ЭтаФорма.Элементы.ЗаказыКлиентовТовары.ТекущийЭлемент = Неопределено Тогда
			//	ЭтаФорма.Элементы.ЗаказыКлиентовТовары.ЦветФона = Новый Цвет(205,255,200);
			//КонецЕсли;
			//
		КонецЦикла;
		
	КонецЕсли;
	//ЗначениеВРеквизитФормы(ЗаказыКлиентовТовары,"ЗаказыКлиентовТовары");
КонецПроцедуры
//****************************

// Получим данные о товарах в заказе клиента
&НаСервереБезКонтекста
Функция ПолучитьДанныеПоТоварамЗаказаКлиента(СсылкаНаДокумент)

	МассивРезультатаЗапроса = Новый Массив;
	
	// Проверка типа
	Если НЕ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Возврат МассивРезультатаЗапроса;
	КонецЕсли;
	
	// Проверка на пустую ссылку
	Если СсылкаНаДокумент.Пустая() Тогда
		Возврат МассивРезультатаЗапроса;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПоставщику.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.ДокументОснование = &ДокументОснование
	|	И ЗаказПоставщику.ПометкаУдаления = ЛОЖЬ
	|	И ЗаказПоставщику.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("ДокументОснование", СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборПоОснованию = Истина;
	Иначе
		ВыборПоОснованию = Ложь;
	КонецЕсли;
	
	// данные периода в запрос, от начала дня даты заказа до тек. даты
	ЗапросОтгрузки = Новый Запрос;
	ЗапросОтгрузки.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ЗаказКлиентаТовары.ДатаОтгрузки) КАК ДатаОтгрузки
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика";
	
	ЗапросОтгрузки.УстановитьПараметр("ЗаказКлиента", СсылкаНаДокумент);
	
	Попытка
		ДатаОтгрузки = ЗапросОтгрузки.Выполнить().Выгрузить()[0].ДатаОтгрузки;
	Исключение
		ДатаОтгрузки = ТекущаяДата();
	КонецПопытки;
	
	КонецПериода = ?(ЗначениеЗаполнено(СсылкаНаДокумент.ДатаОтгрузки), СсылкаНаДокумент.ДатаОтгрузки, ТекущаяДата()); 
	КонецПериода = ?(КонецПериода >= ДатаОтгрузки, КонецПериода, ДатаОтгрузки);
	КонецПериода = ?(КонецПериода >= ТекущаяДата(), КонецПериода, ТекущаяДата());
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиентаСсылка,
	|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Ссылка.Склад
	|		ИНАЧЕ ЗаказКлиентаТовары.Склад
	|	КОНЕЦ КАК Склад,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	ЗаказКлиентаТовары.Количество КАК Количество,
	|	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ЗаказКлиентаТовары.Упаковка КАК Упаковка,
	|	ЗаказКлиентаТовары.Цена КАК Цена,
	|	ЗаказКлиентаТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ЗаказКлиентаТовары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	ЗаказКлиентаТовары.Сумма КАК Сумма,
	|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
	|	ЗаказКлиентаТовары.СуммаСНДС КАК СуммаСНДС
	|ПОМЕСТИТЬ ВТ_ДанныеТабличнойЧасти
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиентаТовары.ЗаказКлиентаСсылка КАК ЗаказКлиентаСсылка,
	|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаказКлиентаТовары.Склад КАК Склад,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	ЗаказКлиентаТовары.Количество КАК Количество,
	|	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ЗаказКлиентаТовары.Упаковка КАК Упаковка,
	|	ЗаказКлиентаТовары.Цена КАК Цена,
	|	ЗаказКлиентаТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ЗаказКлиентаТовары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	ЗаказКлиентаТовары.Сумма КАК Сумма,
	|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
	|	ЗаказКлиентаТовары.СуммаСНДС КАК СуммаСНДС,
	|	0 КАК КоличествоВНаличииПодЗаказ,
	|	0 КАК КоличествоВНаличииНаСкладе,
	|	0 КАК КоличествоНаСкладе,
	|	0 КАК КоличествоКОтгрузке,
	|	0 КАК КоличествоОтгружено,
	|	0 КАК КоличествоЗаказано,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК ДатаОтгрузки,
	|	ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка) КАК Поставщик,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК НомерЗаказаПоставщику
	|ИЗ
	|	ВТ_ДанныеТабличнойЧасти КАК ЗаказКлиентаТовары
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказКлиентаТовары.НомерСтроки";
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ЗаказКлиента",  СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат МассивРезультатаЗапроса;
	КонецЕсли;
	
	// результат запроса
	ТаблицаДокумента  = РезультатЗапроса.Выгрузить();
	ТаблицаДокумента.Колонки.Добавить("Комплектующая", Новый ОписаниеТипов("Булево"));
	ТаблицаДокумента  = ОбработатьКомплекты(ТаблицаДокумента);
	
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();
	ТаблицаРезультата.Колонки.Добавить("Комплектующая", Новый ОписаниеТипов("Булево"));
	ТаблицаРезультата = ОбработатьКомплекты(ТаблицаРезультата);
	
	//ТаблицаРезультата.Свернуть("ЗаказКлиентаСсылка, Номенклатура, Склад, СтавкаНДС, Упаковка, Цена, 
	//						   |ПроцентАвтоматическойСкидки, ПроцентРучнойСкидки, Комплектующая  
	//						   |",
	//						   "Количество, КоличествоУпаковок, Сумма, СуммаНДС, СуммаСНДС,
	//                           |КоличествоВНаличииНаСкладе, КоличествоВНаличииПодЗаказ, КоличествоЗаказано, КоличествоКОтгрузке, 
	//						   |КоличествоНаСкладе, КоличествоОтгружено
	//						   |");
	
	// Наименования ключей структуры из имен колонок
	ПоляСтруктурыРезультата = "";
	Для Каждого КолонкаТаблицы Из ТаблицаДокумента.Колонки Цикл
		ПоляСтруктурыРезультата = ПоляСтруктурыРезультата + "," + КолонкаТаблицы.Имя;
	КонецЦикла;
	
	ПоляСтруктурыРезультата = Прав(ПоляСтруктурыРезультата, СтрДлина(ПоляСтруктурыРезультата) - 1); // уберем первую запятайку
	
	// Заполним массив необходимыми данными, а все потому, что на клиента нельзя передать таб. значений
	Для Каждого СтрокаДанных Из ТаблицаРезультата Цикл
		СтруктураРезультата = Новый Структура(ПоляСтруктурыРезультата);
		//////СтруктураРезультата.Вставить("Поставщик",Справочники.Партнеры.ПустаяСсылка());
		//////СтруктураРезультата.Вставить("НомерЗаказаПоставщику","");
		
		ЗаполнитьЗначенияСвойств(СтруктураРезультата, СтрокаДанных);
		
		////////**ИЗМЕНЕНО Максимов В.А.
		////////МассивСтрок = ТаблицаДокумента.НайтиСтроки(Новый Структура("ЗаказКлиентаСсылка, Номенклатура, Цена ", СтруктураРезультата.ЗаказКлиентаСсылка, СтруктураРезультата.Номенклатура, СтруктураРезультата.Цена));
		//////МассивСтрок = ТаблицаДокумента.НайтиСтроки(Новый Структура("ЗаказКлиентаСсылка, Номенклатура, Цена, Количество ", СтруктураРезультата.ЗаказКлиентаСсылка, СтруктураРезультата.Номенклатура, СтруктураРезультата.Цена, СтруктураРезультата.Количество));
		////////************************
		//////
		//////Если НЕ МассивСтрок.Количество() = 0 Тогда
		//////	СтруктураРезультата.НомерСтроки = МассивСтрок[0].НомерСтроки;
		//////Иначе
		//////	СтруктураРезультата.НомерСтроки = 0;
		//////КонецЕсли;
		
		ПараметраЗаказа = Новый Структура("СтруктураРезультата, КонецПериода, ЗаказКлиента", СтруктураРезультата, КонецПериода, СсылкаНаДокумент);
		
		СтруктураРезультата.КоличествоЗаказано			= ЗаказаноПоставщику(ПараметраЗаказа);
		
		//**ИЗМЕНЕНО Максимов В.А.
		Если НЕ ЗначениеЗаполнено(СтруктураРезультата.НомерЗаказаПоставщику) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗаказПоставщикуТовары.Ссылка КАК Ссылка,
			|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
			|	ЗаказПоставщикуТовары.ДатаПоступления КАК ДатаПоступления,
			|	ЗаказПоставщикуТовары.Ссылка.Партнер КАК Поставщик,
			|	ЗаказПоставщикуТовары.Ссылка.Номер КАК НомерЗаказаПоставщику,
			|	ЗаказПоставщикуТовары.КоличествоУпаковок КАК КоличествоУпаковок,
			|	ЗаказПоставщикуТовары.Количество КАК Количество
			|ИЗ
			|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
			|ГДЕ
			|	ЗаказПоставщикуТовары.Назначение.Заказ = &Заказ
			|	И ЗаказПоставщикуТовары.Номенклатура = &Номенклатура
			|	И ЗаказПоставщикуТовары.Количество = &Количество
			|
			|УПОРЯДОЧИТЬ ПО
			|	Количество";
			
			Запрос.УстановитьПараметр("Номенклатура", СтруктураРезультата.Номенклатура);
			Запрос.УстановитьПараметр("Заказ", СтруктураРезультата.ЗаказКлиентаСсылка);
			Запрос.УстановитьПараметр("Количество", СтруктураРезультата.Количество);
			
			Результат = Запрос.Выполнить().Выгрузить();
			КоличествоЗаказовПоставщику = Результат.Количество();
			
			Если КоличествоЗаказовПоставщику = 1 Тогда
				СтруктураРезультата.ДатаОтгрузки          = Формат(Результат[0].ДатаПоступления, "ДЛФ=Д"); 
				СтруктураРезультата.Поставщик             = Результат[0].Поставщик;
				СтруктураРезультата.НомерЗаказаПоставщику = Результат[0].НомерЗаказаПоставщику;
			ИначеЕсли КоличествоЗаказовПоставщику > 1 Тогда
				Отбор = Новый Структура("Номенклатура,Количество", СтруктураРезультата.Номенклатура, СтруктураРезультата.Количество);
				Строки = ТаблицаРезультата.НайтиСтроки(Отбор);
				Для нн = 0 По Строки.ВГраница() Цикл
					Если нн < КоличествоЗаказовПоставщику Тогда
						Строки[нн].ДатаОтгрузки          = Формат(Результат[нн].ДатаПоступления, "ДЛФ=Д");
						Строки[нн].Поставщик             = Результат[нн].Поставщик;
						Строки[нн].НомерЗаказаПоставщику = Результат[нн].НомерЗаказаПоставщику;
					КонецЕсли;
				КонецЦикла;
				СтруктураРезультата.ДатаОтгрузки          = СтрокаДанных.ДатаОтгрузки;
				СтруктураРезультата.Поставщик             = СтрокаДанных.Поставщик;
				СтруктураРезультата.НомерЗаказаПоставщику = СтрокаДанных.НомерЗаказаПоставщику;
			Иначе
				СтруктураРезультата.ДатаОтгрузки = "";
			КонецЕсли;
		КонецЕсли;
		
		//МассивКолЗаказа  = СтруктураРезультата.ЗаказКлиентаСсылка.Товары.НайтиСтроки(Новый Структура("Номенклатура", СтруктураРезультата.Номенклатура));
		МассивКолЗаказа  = СтруктураРезультата.ЗаказКлиентаСсылка.Товары.НайтиСтроки(Новый Структура("Номенклатура, Количество", СтруктураРезультата.Номенклатура, СтруктураРезультата.Количество));
		//************************
		КолЗаказа = 0;
		Для Каждого ТекЗнач Из МассивКолЗаказа Цикл
			КолЗаказа = КолЗаказа + ТекЗнач.КоличествоУпаковок;
		КонецЦикла;		// ТекЗнач Из 
		
		Если СтрокаДанных.Комплектующая Тогда
			КолЗаказа = СтрокаДанных.КоличествоУпаковок;
		КонецЕсли;
		
		Если СтруктураРезультата.КоличествоУпаковок < КолЗаказа Тогда
			СтруктураРезультата.Количество		   	= СтрокаДанных.КоличествоУпаковок;
			СтруктураРезультата.КоличествоУпаковок 	= СтрокаДанных.КоличествоУпаковок;
		Иначе	
			СтруктураРезультата.КоличествоУпаковок 	= КолЗаказа;
			СтруктураРезультата.Количество			= КолЗаказа;
		КонецЕсли;			
		
		СтруктураОстатков = ОстаткиНаСкладе(ПараметраЗаказа);
		СтруктураРезультата.КоличествоВНаличииПодЗаказ	= СтруктураОстатков.ВНаличииПодЗаказ;
		СтруктураРезультата.КоличествоВНаличииНаСкладе	= СтруктураОстатков.ВНаличииНаСкладе;
		СтруктураРезультата.КоличествоНаСкладе			= СтруктураОстатков.ВНаличииНаСкладе + СтруктураОстатков.ВНаличииПодЗаказ;
		
		Если НЕ СтрокаДанных.Комплектующая Тогда
			СтруктураОтгрузки = ДанныеПоОтгрузке(ПараметраЗаказа);
			СтруктураРезультата.КоличествоКОтгрузке			= СтруктураОтгрузки.КОтгрузке;
			СтруктураРезультата.КоличествоОтгружено			= СтруктураОтгрузки.Отгружено;
		КонецЕсли;
		
		МассивРезультатаЗапроса.Добавить(СтруктураРезультата);
	КонецЦикла;
	
	Возврат МассивРезультатаЗапроса;

КонецФункции

&НаСервереБезКонтекста
Функция ОбработатьКомплекты(ТаблицаОбработки)
	//**Изменено Максимов
	Кол = 0;
	Для Каждого ТекСтрока Из ТаблицаОбработки Цикл
		Если ТекСтрока.Номенклатура.ВидНоменклатуры.Наименование = "Комплекты" Тогда
			Если  ТекСтрока.НомерСтроки = Неопределено Тогда
				НомерСтроки = ТекСтрока.НомерСтроки;
				ТЗКомплекта = _ОбработкаЗакупкиСервер.ПолучитьНоборКомплекта(ТекСтрока.Номенклатура, ТекСтрока.Характеристика);
				Если ТЗКомплекта.Количество() > 0 Тогда
					ДоляСтоимости = ТЗКомплекта.Итог("ДоляСтоимости");
					Если ДоляСтоимости = 0 Тогда
						ДоляСтоимости = 1;
					КонецЕсли;
					к = 0;
					Для Каждого СтрКомплекта Из ТЗКомплекта Цикл
						к = к + 1;
						НоваяСтрока = ТаблицаОбработки.Вставить(НомерСтроки + к);
//						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока,"ЗаказКлиентаСсылка, Склад, СтавкаНДС, ПроцентАвтоматическойСкидки, ПроцентРучнойСкидки");
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока,"ЗаказКлиентаСсылка, Склад");
						НоваяСтрока.Номенклатура					= СтрКомплекта.Номенклатура;
						НоваяСтрока.Характеристика					= СтрКомплекта.Характеристика;
						НоваяСтрока.Количество						= СтрКомплекта.Количество * ТекСтрока.Количество;
						НоваяСтрока.КоличествоУпаковок				= СтрКомплекта.КоличествоУпаковок * ТекСтрока.КоличествоУпаковок;
						НоваяСтрока.Упаковка						= СтрКомплекта.Упаковка;
//						НоваяСтрока.Цена							= ТекСтрока.Цена / ДоляСтоимости * СтрКомплекта.ДоляСтоимости;
						НоваяСтрока.Комплектующая					= Истина;
					
					КонецЦикла;		// СтрКомплекта Из ТЗКомплекта
				КонецЕсли;
			Иначе	
				НомерСтроки = ТекСтрока.НомерСтроки - 1;
				ТЗКомплекта = _ОбработкаЗакупкиСервер.ПолучитьНоборКомплекта(ТекСтрока.Номенклатура, ТекСтрока.Характеристика);
				Если ТЗКомплекта.Количество() > 0 Тогда
					ДоляСтоимости = ТЗКомплекта.Итог("ДоляСтоимости");
					Если ДоляСтоимости = 0 Тогда
						ДоляСтоимости = 1;
					КонецЕсли;
					к = 0;
					Для Каждого СтрКомплекта Из ТЗКомплекта Цикл
						к = к + 1;
						НоваяСтрока = ТаблицаОбработки.Вставить(ТекСтрока.НомерСтроки - 1 + к + Кол);
	//					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока,"ЗаказКлиентаСсылка, Склад, СтавкаНДС, ПроцентАвтоматическойСкидки, ПроцентРучнойСкидки");
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока,"ЗаказКлиентаСсылка, Склад");
						НоваяСтрока.Номенклатура					= СтрКомплекта.Номенклатура;
						НоваяСтрока.Характеристика					= СтрКомплекта.Характеристика;
						НоваяСтрока.Количество						= СтрКомплекта.Количество * ТекСтрока.Количество;
						НоваяСтрока.КоличествоУпаковок				= СтрКомплекта.КоличествоУпаковок * ТекСтрока.КоличествоУпаковок;
						НоваяСтрока.Упаковка						= СтрКомплекта.Упаковка;
	//					НоваяСтрока.Цена							= ТекСтрока.Цена / ДоляСтоимости * СтрКомплекта.ДоляСтоимости;
						НоваяСтрока.Комплектующая					= Истина;						
					КонецЦикла;		// СтрКомплекта Из ТЗКомплекта
				Кол = Кол + ТЗКомплекта.Количество();	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;		// ТекСтрока Из ТаблицаДокумента
	//*******************
	Возврат ТаблицаОбработки;
	
КонецФункции // ОбработатьКомплекты()

&НаСервереБезКонтекста
Функция ЗаказаноПоставщику(ПараметрыЗаказа)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ЗапасыИПотребности.Заказано) КАК Заказано,
	|	ЗапасыИПотребности.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрНакопления.ЗапасыИПотребности КАК ЗапасыИПотребности
	|ГДЕ
	|	ЗапасыИПотребности.ТипЗаписи = &ТипЗаписи
	|	И ЗапасыИПотребности.Номенклатура = &Номенклатура
	|	И ЗапасыИПотребности.Склад = &Склад
	|	И ЗапасыИПотребности.Характеристика = &Характеристика
	|	И ЗапасыИПотребности.Назначение.Заказ = &ЗаказКлиента
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыИПотребности.Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура"  , ПараметрыЗаказа.СтруктураРезультата.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", ?(ПараметрыЗаказа.СтруктураРезультата.Характеристика = Неопределено, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), ПараметрыЗаказа.СтруктураРезультата.Характеристика));
	Запрос.УстановитьПараметр("ЗаказКлиента"  , ПараметрыЗаказа.ЗаказКлиента);
	Запрос.УстановитьПараметр("Склад"         , ПараметрыЗаказа.ЗаказКлиента.Склад);
	Запрос.УстановитьПараметр("ТипЗаписи"     , Перечисления.ТипыЗаписейЗапасыИПотребности.ПервичнаяЗапись);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Заказано;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаказаноПоставщику_СТАР(ПараметраЗаказа)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	               |	ОбеспечениеЗаказов.Номенклатура КАК Номенклатура,
	               |	ОбеспечениеЗаказов.Характеристика КАК Характеристика,
	               |	ОбеспечениеЗаказов.Склад КАК Склад,
	               |	СУММА(ОбеспечениеЗаказов.Потребность) КАК Потребность,
	               |	СУММА(ОбеспечениеЗаказов.КЗаказу) КАК КЗаказу,
	               |	СУММА(ОбеспечениеЗаказов.НаличиеПодЗаказ) КАК НаличиеПодЗаказ
	               |ИЗ
	               |	РегистрНакопления.ОбеспечениеЗаказов КАК ОбеспечениеЗаказов
	               |ГДЕ
	               |	ОбеспечениеЗаказов.Номенклатура = &Номенклатура
	               |	И ОбеспечениеЗаказов.Характеристика = &Характеристика
	               |	И ОбеспечениеЗаказов.Назначение.Заказ = &ЗаказКлиента
	               |	И ОбеспечениеЗаказов.Склад = &Склад
	               |	И ОбеспечениеЗаказов.ВидДвижения = &ВидДвижения
	               |	И ТИПЗНАЧЕНИЯ(ОбеспечениеЗаказов.Регистратор) = ТИП(Документ.ЗаказПоставщику)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОбеспечениеЗаказов.Номенклатура,
	               |	ОбеспечениеЗаказов.Характеристика,
	               |	ОбеспечениеЗаказов.Склад";
	
	
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ОбеспечениеЗаказовОстатки.Номенклатура КАК Номенклатура,
	//               |	ОбеспечениеЗаказовОстатки.Характеристика КАК Характеристика,
	//               |	ОбеспечениеЗаказовОстатки.Склад КАК Склад,
	//               |	ОбеспечениеЗаказовОстатки.Назначение КАК Назначение,
	//               |	ОбеспечениеЗаказовОстатки.ПотребностьОстаток КАК ПотребностьОстаток,
	//               |	ОбеспечениеЗаказовОстатки.КЗаказуОстаток КАК КЗаказуОстаток,
	//               |	ОбеспечениеЗаказовОстатки.НаличиеПодЗаказОстаток КАК НаличиеПодЗаказОстаток
	//               |ИЗ
	//               |	РегистрНакопления.ОбеспечениеЗаказов.Остатки(
	//               |			&КонецПериода,
	//               |			Номенклатура = &Номенклатура
	//               |				И Характеристика = &Характеристика
	//               |				И Назначение.Заказ = &ЗаказКлиента) КАК ОбеспечениеЗаказовОстатки";
	
	//Запрос.УстановитьПараметр("КонецПериода",   КонецДня(ПараметраЗаказа.КонецПериода));	// + 60*60*24));
	Запрос.УстановитьПараметр("Номенклатура",   ПараметраЗаказа.СтруктураРезультата.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", ?(ПараметраЗаказа.СтруктураРезультата.Характеристика = Неопределено, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), ПараметраЗаказа.СтруктураРезультата.Характеристика));
	Запрос.УстановитьПараметр("ЗаказКлиента",   ПараметраЗаказа.ЗаказКлиента);
	Запрос.УстановитьПараметр("Склад",   		ПараметраЗаказа.ЗаказКлиента.Склад);
	Запрос.УстановитьПараметр("ВидДвижения",    ВидДвиженияНакопления.Приход);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда
		Возврат 0;
	Иначе
		Возврат Результат[0].КЗаказу * -1;
//Возврат Результат[0].ПотребностьОстаток - Результат[0].КЗаказуОстаток;
	КонецЕсли;
	
КонецФункции // ЗаказаноПоставщику()

&НаСервереБезКонтекста
Функция ОстаткиНаСкладе(ПараметраЗаказа)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеПоОстаткуНаСкладе.Номенклатура КАК Номенклатура,
	|	ДанныеПоОстаткуНаСкладе.Характеристика КАК Характеристика,
	|	ДанныеПоОстаткуНаСкладе.Склад КАК Склад,
	|	СУММА(ДанныеПоОстаткуНаСкладе.ВНаличииПодЗаказ) КАК ВНаличииПодЗаказ,
	|	СУММА(ДанныеПоОстаткуНаСкладе.ВНаличииНаСкладе) КАК ВНаличииНаСкладе
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыНаСкладахОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|		ТоварыНаСкладахОстаткиИОбороты.Характеристика КАК Характеристика,
	|		ТоварыНаСкладахОстаткиИОбороты.Назначение КАК Назначение,
	|		ТоварыНаСкладахОстаткиИОбороты.Склад КАК Склад,
	|		ТоварыНаСкладахОстаткиИОбороты.ВНаличииКонечныйОстаток КАК ВНаличииПодЗаказ,
	|		0 КАК ВНаличииНаСкладе
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				Период,
	|				ДвиженияИГраницыПериода,
	|				Номенклатура = &Номенклатура
	|					И Характеристика = &Характеристика
	|					И Назначение.Заказ = &ЗаказКлиента) КАК ТоварыНаСкладахОстаткиИОбороты
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	|		ТоварыНаСкладахОстаткиИОбороты.Характеристика,
	|		ТоварыНаСкладахОстаткиИОбороты.Назначение,
	|		ТоварыНаСкладахОстаткиИОбороты.Склад,
	|		0,
	|		ТоварыНаСкладахОстаткиИОбороты.ВНаличииКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				Период,
	|				ДвиженияИГраницыПериода,
	|				Номенклатура = &Номенклатура
	|					И Характеристика = &Характеристика
	|					И Склад = &Склад
	|					И Назначение = &Назначение) КАК ТоварыНаСкладахОстаткиИОбороты) КАК ДанныеПоОстаткуНаСкладе
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоОстаткуНаСкладе.Номенклатура,
	|	ДанныеПоОстаткуНаСкладе.Характеристика,
	|	ДанныеПоОстаткуНаСкладе.Склад";

	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПараметраЗаказа.ЗаказКлиента.Дата));
	Запрос.УстановитьПараметр("КонецПериода",   КонецДня(ПараметраЗаказа.КонецПериода + 60*60*24*181));
	Запрос.УстановитьПараметр("Номенклатура",   ПараметраЗаказа.СтруктураРезультата.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", ?(ПараметраЗаказа.СтруктураРезультата.Характеристика = Неопределено, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), ПараметраЗаказа.СтруктураРезультата.Характеристика));
	Запрос.УстановитьПараметр("ЗаказКлиента",   ПараметраЗаказа.ЗаказКлиента);
	Запрос.УстановитьПараметр("Склад",   ПараметраЗаказа.СтруктураРезультата.Склад);
	Запрос.УстановитьПараметр("Назначение",   Справочники.Назначения.ПустаяСсылка());
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СтруктураВозврата =  Новый Структура("ВНаличииПодЗаказ, ВНаличииНаСкладе", 0, 0);
	
	Если Результат.Количество() = 0 Тогда
		Возврат СтруктураВозврата;
	Иначе
		СтруктураВозврата.ВНаличииПодЗаказ = Результат[0].ВНаличииПодЗаказ;
		СтруктураВозврата.ВНаличииНаСкладе = Результат[0].ВНаличииНаСкладе;
		Возврат СтруктураВозврата;
	КонецЕсли;
	
КонецФункции // ОстаткиНаСкладе()

&НаСервереБезКонтекста
Функция ДанныеПоОтгрузке(ПараметраЗаказа)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыКОтгрузкеОстаткиИОбороты.Склад КАК Склад,
	|	ТоварыКОтгрузкеОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузкеОстаткиИОбороты.Характеристика КАК Характеристика,
	|	ТоварыКОтгрузкеОстаткиИОбороты.Назначение.Заказ КАК ЗаказКлиентаСсылка,
	|	ТоварыКОтгрузкеОстаткиИОбороты.КОтгрузкеКонечныйОстаток КАК КОтгрузке,
	|	ТоварыКОтгрузкеОстаткиИОбороты.КОтгрузкеРасход КАК Отгружено
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|			ДвиженияИГраницыПериода,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Назначение.Заказ = &ЗаказКлиента) КАК ТоварыКОтгрузкеОстаткиИОбороты";

	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПараметраЗаказа.ЗаказКлиента.Дата));
	Запрос.УстановитьПараметр("КонецПериода",   КонецДня(ПараметраЗаказа.КонецПериода + 60*60*24*181));
	Запрос.УстановитьПараметр("Номенклатура",   ПараметраЗаказа.СтруктураРезультата.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", ?(ПараметраЗаказа.СтруктураРезультата.Характеристика = Неопределено, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), ПараметраЗаказа.СтруктураРезультата.Характеристика));
	Запрос.УстановитьПараметр("ЗаказКлиента",   ПараметраЗаказа.ЗаказКлиента);
	Запрос.УстановитьПараметр("Склад",   ПараметраЗаказа.СтруктураРезультата.Склад);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СтруктураВозврата =  Новый Структура("КОтгрузке, Отгружено", 0, 0);
	
	Если Результат.Количество() = 0 Тогда
		Возврат СтруктураВозврата;
	Иначе
		СтруктураВозврата.КОтгрузке = Результат[0].КОтгрузке;
		СтруктураВозврата.Отгружено = Результат[0].Отгружено;
		Возврат СтруктураВозврата;
	КонецЕсли;
	
КонецФункции // ДанныеПоОтгрузке()

&НаСервереБезКонтекста
Функция ПустойЗаказ()
	Возврат Документы.ЗаказКлиента.ПустаяСсылка();
КонецФункции // ПустойЗаказ()

&НаСервереБезКонтекста
Функция ПустойВнутреннийЗаказ()
	Возврат Документы.ЗаказНаВнутреннееПотребление.ПустаяСсылка();
КонецФункции // ПустойЗаказ()

//++ 2025-04-25 Ниронов
&НаСервереБезКонтекста
Функция ОбработатьКомплектыН(ТаблицаОбработки)
	
	Для Каждого ТекСтрока Из ТаблицаОбработки Цикл
		Если ТекСтрока.Комплект Тогда
			ТЗКомплекта = _ОбработкаЗакупкиСервер.ПолучитьНоборКомплекта(ТекСтрока.Номенклатура, ТекСтрока.Характеристика);
			Если ТЗКомплекта.Количество() > 0 Тогда
				ДоляСтоимости = ТЗКомплекта.Итог("ДоляСтоимости");
				Если ДоляСтоимости = 0 Тогда
					ДоляСтоимости = 1;
				КонецЕсли;
				Для Каждого СтрКомплекта Из ТЗКомплекта Цикл
					НоваяСтрока = ТаблицаОбработки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока, "ЗаказКлиента, ЗаявкаНаЗакупку, НомерСтроки");
					НоваяСтрока.Номенклатура					= СтрКомплекта.Номенклатура;
					НоваяСтрока.Характеристика					= СтрКомплекта.Характеристика;
					НоваяСтрока.Количество						= СтрКомплекта.Количество * ТекСтрока.Количество;
					//НоваяСтрока.КоличествоУпаковок				= СтрКомплекта.КоличествоУпаковок * ТекСтрока.КоличествоУпаковок;
					//НоваяСтрока.Упаковка						= СтрКомплекта.Упаковка;
					НоваяСтрока.Комплектующая					= Истина;
					НоваяСтрока.Цена                            = 0;
					НоваяСтрока.Комплект = (НоваяСтрока.Номенклатура.ВидНоменклатуры.Наименование = "Комплекты");
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат ТаблицаОбработки;
	
КонецФункции // ОбработатьКомплекты()

&НаСервереБезКонтекста
Функция ПолучитьТекстЗапросаРаспределения(ВидДокумента)
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
	|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаказКлиентаТовары.КодСтроки КАК КодСтроки,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Номенклатура.Артикул КАК Артикул,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	ЗаказКлиентаТовары.Количество КАК Количество,
	|	"+?(ВидДокумента = "ЗаказКлиента","ЗаказКлиентаТовары.Цена","0")+" КАК Цена,
	|	ЗаказКлиентаТовары._ЗаявкаНаЗакупку КАК ЗаявкаНаЗакупку,
	|	ЛОЖЬ КАК Комплектующая,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Номенклатура.ВидНоменклатуры.Наименование = ""Комплекты""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Комплект
	|ИЗ
	|	Документ."+ВидДокумента+".Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
	|	И ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	НомерСтроки
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Ссылка КАК ЗаказПоставщику,
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
	|	ЗаказПоставщикуТовары.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЗаказПоставщикуТовары._ЗаявкаНаЗакупку КАК ЗаявкаНаЗакупку,
	|	ЗаказПоставщикуТовары.Ссылка.Партнер КАК Поставщик,
	|	ЗаказПоставщикуТовары.Ссылка.Номер КАК НомерЗаказаПоставщику,
	|	ЗаказПоставщикуТовары.Количество КАК КоличествоЗаказано
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка.Проведен
	|	И ЗаказПоставщикуТовары.Назначение.Заказ = &ЗаказКлиента
	|	И ЗаказПоставщикуТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И ЗаказПоставщикуТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ЗаказПоставщику
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриобретениеТоваровУслуг_ТоварыТ.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ПриобретениеТоваровУслуг_ТоварыТ.Назначение КАК Назначение,
	|	ПриобретениеТоваровУслуг_ТоварыТ.Номенклатура КАК Номенклатура,
	|	ПриобретениеТоваровУслуг_ТоварыТ.Характеристика КАК Характеристика,
	|	СУММА(ПриобретениеТоваровУслуг_ТоварыТ.Количество) КАК Количество
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслуг_ТоварыТ
	|ГДЕ
	|	ПриобретениеТоваровУслуг_ТоварыТ.Ссылка.Проведен = ИСТИНА
	|	И ПриобретениеТоваровУслуг_ТоварыТ.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И ПриобретениеТоваровУслуг_ТоварыТ.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|	И ПриобретениеТоваровУслуг_ТоварыТ.Назначение.Заказ = &ЗаказКлиента
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеТоваровУслуг_ТоварыТ.ЗаказПоставщику,
	|	ПриобретениеТоваровУслуг_ТоварыТ.Назначение,
	|	ПриобретениеТоваровУслуг_ТоварыТ.Номенклатура,
	|	ПриобретениеТоваровУслуг_ТоварыТ.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказПоставщику
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|"; 
	
	Если ВидДокумента = "ЗаказНаВнутреннееПотребление" Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнутреннееПотреблениеТовары.Номенклатура КАК Номенклатура,
		|	ВнутреннееПотреблениеТовары.Характеристика КАК Характеристика,
		|	ВнутреннееПотреблениеТовары.АналитикаРасходов КАК Статус,
		|	СУММА(ВнутреннееПотреблениеТовары.Количество) КАК Количество
		|ИЗ
		|	Документ.ВнутреннееПотребление.Товары КАК ВнутреннееПотреблениеТовары
		|ГДЕ
		|	ВнутреннееПотреблениеТовары.Ссылка.Проведен = ИСТИНА
		|	И ВнутреннееПотреблениеТовары.Назначение.Заказ = &ЗаказКлиента
		|
		|СГРУППИРОВАТЬ ПО
		|	ВнутреннееПотреблениеТовары.Номенклатура,
		|	ВнутреннееПотреблениеТовары.Характеристика,
		|	ВнутреннееПотреблениеТовары.АналитикаРасходов
		|;";  
		
	ИНачеЕсли ВидДокумента = "ЗаказКлиента" Тогда	
		
		ТекстЗапроса = ТекстЗапроса + "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ОтгрузкаПоЗаданиюНаПеревозку = ИСТИНА
		|			ТОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ЗаданиеНаПеревозку.Статус
		|		ИНАЧЕ ""Самовывоз""
		|	КОНЕЦ КАК Статус,
		|	СУММА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Количество) КАК Количество
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		|ГДЕ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен = ИСТИНА
		|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Отгружен)
		|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Назначение.Заказ = &ЗаказКлиента
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика,
		|	ВЫБОР
		|		КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ОтгрузкаПоЗаданиюНаПеревозку = ИСТИНА
		|			ТОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ЗаданиеНаПеревозку.Статус
		|		ИНАЧЕ ""Самовывоз""
		|	КОНЕЦ
		|;";
		
	КонецЕсли;    
	
	ТекстЗапроса = ТекстЗапроса + "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СборкаТоваров.Номенклатура КАК Номенклатура,
	|	СборкаТоваров.Количество КАК Количество,
	|	СборкаТоваров.Характеристика КАК Характеристика
	|ИЗ
	|	Документ.СборкаТоваров КАК СборкаТоваров
	|ГДЕ
	|	СборкаТоваров.Проведен = ИСТИНА
	|	И СборкаТоваров.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСборокТоваров.СобраноРазобрано)
	|	И СборкаТоваров.Назначение.Заказ = &ЗаказКлиента";
	
	Возврат ТекстЗапроса;
	
КонецФункции


&НаСервереБезКонтекста 
Функция РаспределитьНаСервере(ЗаказКлиента)
	
	Запрос = Новый Запрос;
	Запрос.Текст =  ПолучитьТекстЗапросаРаспределения(ЗаказКлиента.Метаданные().Имя);
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	РезультатЗапроса  = Запрос.ВыполнитьПакет();
	тзЗаказКлиента    = РезультатЗапроса[0].Выгрузить();
	тзЗаказПоставщику = РезультатЗапроса[1].Выгрузить();
	тзПТиУ            = РезультатЗапроса[2].Выгрузить();
	тзРО              = РезультатЗапроса[3].Выгрузить();
	тзСборка          = РезультатЗапроса[4].Выгрузить();
	
	Если ЛОЖЬ Тогда 
		тзЗаказКлиента    = Новый ТаблицаЗначений;
		тзЗаказПоставщику = Новый ТаблицаЗначений;
		тзПТиУ            = Новый ТаблицаЗначений;
		тзРО              = Новый ТаблицаЗначений;
		тзСборка          = Новый ТаблицаЗначений;
	КонецЕсли;
	
	ОбработатьКомплектыН(тзЗаказКлиента);
	
	//***************************************************************************************************
	// распределим Заказ клиента по Заказам поставщикам
	тзРаспределено = тзЗаказКлиента.СкопироватьКолонки();
	тзРаспределено.Колонки.Добавить("КоличествоЗаказано", Новый ОписаниеТипов("Число"));
	тзРаспределено.Колонки.Добавить("ЗаказПоставщику");
	тзРаспределено.Колонки.Добавить("Поставщик");
	тзРаспределено.Колонки.Добавить("НомерЗаказаПоставщику");
	тзРаспределено.Колонки.Добавить("ДатаОтгрузки");
	
	Для каждого СтрЗаказКлиента Из тзЗаказКлиента Цикл
		
		Отбор = Новый Структура("Номенклатура, ЗаявкаНаЗакупку", СтрЗаказКлиента.Номенклатура, СтрЗаказКлиента.ЗаявкаНаЗакупку);
		СтрокиЗаказыПоставщику = тзЗаказПоставщику.НайтиСтроки(Отбор);
		Для каждого СтрЗаказПокупателя Из СтрокиЗаказыПоставщику Цикл
			
			Если СтрЗаказПокупателя.КоличествоЗаказано = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			КРаспределению = СтрЗаказПокупателя.КоличествоЗаказано;
			Если КРаспределению >= СтрЗаказКлиента.Количество Тогда
				Распределено = СтрЗаказКлиента.Количество;
			Иначе
				Распределено = КРаспределению;
			КонецЕсли;
			
			Если Распределено > 0 Тогда
				//***********************************
				НовСтрока = тзРаспределено.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрока, СтрЗаказКлиента);
				ЗаполнитьЗначенияСвойств(НовСтрока, СтрЗаказПокупателя);
				НовСтрока.КоличествоЗаказано = Распределено;
				НовСтрока.Количество  = Распределено;
				
				СтрЗаказКлиента.Количество     = СтрЗаказКлиента.Количество - Распределено;
				СтрЗаказПокупателя.КоличествоЗаказано = СтрЗаказПокупателя.КоличествоЗаказано - Распределено;
				КРаспределению                        = КРаспределению - Распределено;
			КонецЕсли;
			
			Если КРаспределению = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрЗаказКлиента.Количество = 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтрЗаказКлиента.Количество > 0 Тогда
			// остались незаказанные позиции
			//***********************************
			НовСтрока = тзРаспределено.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, СтрЗаказКлиента);
		КонецЕсли;
		
	КонецЦикла;
	
	//***************************************************************************************************
	// распределелим поступления товаров
	
	тзРаспределено.Колонки.Добавить("КоличествоВНаличииПодЗаказ", Новый ОписаниеТипов("Число"));
	Для Каждого Стр Из тзРаспределено Цикл
		
		Если Стр.Комплект = Истина Тогда
			Отбор = Новый Структура("Номенклатура,Характеристика", Стр.Номенклатура, Стр.Характеристика);
			СтрокиПоступления = тзСборка.НайтиСтроки(Отбор);
			Для каждого Поступление Из СтрокиПоступления Цикл
				Если Поступление.Количество = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Поступило = Мин(Стр.Количество - Стр.КоличествоВНаличииПодЗаказ, Поступление.Количество);
				Стр.КоличествоВНаличииПодЗаказ = Стр.КоличествоВНаличииПодЗаказ + Поступило;
				Поступление.Количество = Поступление.Количество - Поступило;
				
				Если Стр.Количество <= Стр.КоличествоВНаличииПодЗаказ Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Если Стр.КоличествоЗаказано = 0 Тогда
				Продолжить;
			КонецЕсли;
		
			Отбор = Новый Структура("Номенклатура,Характеристика,ЗаказПоставщику", Стр.Номенклатура, Стр.Характеристика, Стр.ЗаказПоставщику);
			СтрокиПоступления = тзПТиУ.НайтиСтроки(Отбор);
			Для каждого Поступление Из СтрокиПоступления Цикл
				Если Поступление.Количество = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Поступило = Мин(Стр.КоличествоЗаказано - Стр.КоличествоВНаличииПодЗаказ, Поступление.Количество);
				Стр.КоличествоВНаличииПодЗаказ = Стр.КоличествоВНаличииПодЗаказ + Поступило;
				Поступление.Количество = Поступление.Количество - Поступило;
				
				Если Стр.КоличествоЗаказано <= Стр.КоличествоВНаличииПодЗаказ Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	//***************************************************************************************************
	// распределим отгрузку
	
	тзРаспределено.Колонки.Добавить("КоличествоОтгружено", Новый ОписаниеТипов("Число"));
	тзРаспределено.Колонки.Добавить("Статус", Новый ОписаниеТипов("Строка"));
	Для Каждого Стр Из тзРаспределено Цикл
		
		Если Стр.КоличествоВНаличииПодЗаказ = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("Номенклатура,Характеристика", Стр.Номенклатура, Стр.Характеристика);
		СтрокиРО = тзРО.НайтиСтроки(Отбор);
		Для каждого РО Из СтрокиРО Цикл
			Если РО.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Расход = Мин(РО.Количество, Стр.КоличествоВНаличииПодЗаказ - Стр.КоличествоОтгружено);
			Стр.КоличествоОтгружено = Стр.КоличествоОтгружено + Расход;
			Стр.Статус              = Строка(РО.Статус);
			РО.Количество = РО.Количество - Расход;
			
			Если Стр.КоличествоВНаличииПодЗаказ <= Стр.КоличествоОтгружено Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЦикла;
	
	тзРаспределено.Свернуть("ЗаказКлиента, КодСтроки, НомерСтроки, Номенклатура, Цена, Артикул, ЗаявкаНаЗакупку, ЗаказПоставщику, Поставщик, НомерЗаказаПоставщику, ДатаОтгрузки, Комплектующая, Комплект, Статус", "Количество, КоличествоЗаказано, КоличествоВНаличииПодЗаказ, КоличествоОтгружено");
	тзРаспределено.Сортировать("НомерСтроки, Комплектующая");
	
	тзРаспределено.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Для каждого Стр Из тзРаспределено Цикл
		Стр.Сумма = Стр.Количество * Стр.Цена;
	КонецЦикла;
	
	Возврат тзРаспределено;
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеТаблицыТоваровЗаказаНаСервереН(СсылкаНаДокумент)
	
	ЭтотОбъект.ЗаказыКлиентовТовары.Очистить();
	
	Если ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		
		ДанныеЗаполнения = РаспределитьНаСервере(СсылкаНаДокумент);
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ТаблицаЗначений") Тогда
			ЭтотОбъект.ЗаказыКлиентовТовары.Загрузить(ДанныеЗаполнения);
		КонецЕсли;
		
	КонецЕсли;  
	
	
КонецПроцедуры

//--

#КонецОбласти



#Область НастройкиИнтерфейса

&НаКлиенте
Процедура НастройкаИнтерфейсаНачало()
	НастройкаИнтерфейсаСервер(Истина);
	ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
КонецПроцедуры	// НастройкаИнтерфейсаНачало()
 
&НаКлиенте 
Процедура НастройкаИнтерфейсаКонец()
  	НастройкаИнтерфейсаСервер(Ложь);
	ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
КонецПроцедуры	// НастройкаИнтерфейсаКонец()

&НаСервере
Процедура НастройкаИнтерфейсаСервер(Минимальный)
	
	Настройки = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения");
	
	Если Минимальный Тогда
		Настройки = МинимальныйИнтерфейс(Настройки);
	Иначе
		Настройки = РабочийИнтерфейс();
	КонецЕсли;
	
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", , Настройки);
	
КонецПроцедуры	// НастройкаМинимальногоИнтерфейса()

&НаСервере
Функция МинимальныйИнтерфейс(Настройки)
	Настройки				 = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
	ГруппаНастроек			 = Новый ГруппаНастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	НастройкиСостава		 = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	ГруппаВерх				 = Новый ГруппаНастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	ГруппаВерх.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельИнструментов"));
	ГруппаВерх.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых"));
	НастройкиСостава.Верх.Добавить(ГруппаВерх);
	Настройки.УстановитьСостав(НастройкиСостава);
    Возврат Настройки;	
КонецФункции	// МинимальныйИнтерфейс()()
 
&НаСервере
Функция РабочийИнтерфейс()
	Настройки				 = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
	НастройкиСостава		 = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	ГруппаВерх				 = Новый ГруппаНастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	ГруппаВерх.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельИнструментов"));
	ГруппаВерх.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых"));
	НастройкиСостава.Верх.Добавить(ГруппаВерх);
	НастройкиСостава.Лево.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельРазделов"));
	Настройки.УстановитьСостав(НастройкиСостава);
    Возврат Настройки;	
КонецФункции	// РабочийИнтерфейс()

#КонецОбласти



#Область Раскраска

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Условное оформление динамического списка "Список"
	СписокУсловноеОформление = ЗаказыКлиентовСписок.КомпоновщикНастроек.Настройки.УсловноеОформление;
	СписокУсловноеОформление.Элементы.Очистить();
	
	//**ИЗМЕНЕНО Максимов В.А.
	
	Если НЕ РольДоступна("АдминистраторСистемы") Тогда
		Если НЕ РольДоступна("Администрирование") Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ГруппыДоступа.Ссылка КАК Ссылка,
			|	ГруппыДоступа.Пользователи.(
			|		Пользователь КАК Пользователь
			|	) КАК Пользователи,
			|	ГруппыДоступа.ЗначенияДоступа.(
			|		ЗначениеДоступа КАК ЗначениеДоступа
			|	) КАК ЗначенияДоступа
			|ИЗ
			|	Справочник.ГруппыДоступа КАК ГруппыДоступа
			|ГДЕ
			|	ГруппыДоступа.Пользователи.Пользователь = &Пользователь";
			
			Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
			
			ГруппыДоступа = Запрос.Выполнить().Выгрузить();

			МассивОрганизаций = Новый Массив;
			СписокГруппДоступа = Новый Массив;
			Для Каждого Группа Из ГруппыДоступа Цикл
				Для Каждого Стр Из Группа.ЗначенияДоступа Цикл			
			 		СписокГруппДоступа.Добавить(Стр.ЗначениеДоступа);					
					Если ТипЗнч(Стр.ЗначениеДоступа) = Тип("СправочникСсылка.Организации") Тогда
						МассивОрганизаций.Добавить(Стр.ЗначениеДоступа);
					КонецЕсли;	
				КонецЦикла;
			КонецЦикла;	
				
			НовыйЗапрос = Новый Запрос;
			НовыйЗапрос.Текст = 
			"ВЫБРАТЬ
			|	ДокументЗаказКлиента.Ссылка КАК Ссылка,
			|	ДокументЗаказКлиента.ПометкаУдаления КАК ПометкаУдаления,
			|	ДокументЗаказКлиента.Номер КАК Номер,
			|	ДокументЗаказКлиента.Дата КАК Дата,
			|	ДокументЗаказКлиента.Проведен КАК Проведен,
			|	ДокументЗаказКлиента.Приоритет КАК Приоритет,
			|	ВЫБОР
			|		КОГДА ДокументЗаказКлиента.Проведен = ИСТИНА
			|			ТОГДА 0
			|		КОГДА ДокументЗаказКлиента.ПометкаУдаления = ИСТИНА
			|			ТОГДА 1
			|		ИНАЧЕ 2
			|	КОНЕЦ КАК СостояниеДокумента,
			|	ДокументЗаказКлиента.Партнер КАК Партнер,
			|	ДокументЗаказКлиента.Партнер.ОсновнойМенеджер КАК МенеджерКонтрагента,
			|	ДокументЗаказКлиента.Контрагент КАК Контрагент,
			|	ДокументЗаказКлиента.Организация КАК Организация,
			|	ДокументЗаказКлиента.Валюта КАК Валюта,
			|	ДокументЗаказКлиента.СуммаДокумента КАК СуммаДокумента,
			|	ДокументЗаказКлиента.Склад КАК Склад,
			|	ДокументЗаказКлиента.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
			|	ДокументЗаказКлиента.Менеджер КАК Менеджер,
			|	ДокументЗаказКлиента.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
			|	ВЫБОР
			|		КОГДА ДокументЗаказКлиента.ПометкаУдаления = ИСТИНА
			|			ТОГДА 6
			|		КОГДА ДокументЗаказКлиента.Проведен = ЛОЖЬ
			|				И ДокументЗаказКлиента.ПометкаУдаления = ЛОЖЬ
			|			ТОГДА 4
			|		КОГДА ДокументЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован)
			|			ТОГДА 2
			|		КОГДА ДокументЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОбеспечению)
			|			ТОГДА 0
			|		КОГДА ДокументЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОтгрузке)
			|			ТОГДА 3
			|		КОГДА ДокументЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт)
			|			ТОГДА 5
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК Статус,
			|	ДокументЗаказКлиента.Статус КАК СтатусСсылка,
			|	ДокументЗаказКлиента.Согласован КАК Согласован,
			|	ДокументЗаказКлиента.Комментарий КАК Комментарий,
			|	ДокументЗаказКлиента.Автор КАК Автор,
			|	ДокументЗаказКлиента.Закрыт КАК Закрыт,
			|	ЕСТЬNULL(ДополнительныеРеквизитыДокумента.Значение, ЛОЖЬ) КАК ДокументыВозвращены,
			|	ЕСТЬNULL(РасчетыСКлиентамиОстаткиИОбороты.КОплатеПриход, 0) КАК КОплатеПриход,
			|	ЕСТЬNULL(РасчетыСКлиентамиОстаткиИОбороты.КОплатеРасход, 0) КАК КОплатеРасход,
			|	ЕСТЬNULL(РасчетыСКлиентамиОстаткиИОбороты.КОплатеКонечныйОстаток, 0) КАК КОплатеКонечныйОстаток,
			|	ЕСТЬNULL(ТоварыКОтгрузкеОстаткиИОбороты.КОтгрузкеПриход, 0) КАК КОтгрузкеПриход,
			|	ЕСТЬNULL(ТоварыКОтгрузкеОстаткиИОбороты.КОтгрузкеРасход, 0) КАК КОтгрузкеРасход,
			|	ЕСТЬNULL(ТоварыКОтгрузкеОстаткиИОбороты.КОтгрузкеКонечныйОстаток, 0) КАК КОтгрузкеКонечныйОстаток,
			|	ДокументЗаказКлиента.КонтактноеЛицо КАК КонтактноеЛицо,
			|	СостоянияЗаказовКлиентов.Состояние КАК Состояние,
			|	ВЫБОР
			|		КОГДА СостоянияЗаказовКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт)
			|			ТОГДА 0
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК СостояниеЗаказа,
			|	ДокументЗаказКлиента.СпособДоставки КАК СпособДоставки,
			|	ВЫБОР
			|		КОГДА ТоварыКОтгрузкеОстаткиИОбороты.КОтгрузкеПриход ЕСТЬ НЕ NULL 
			|				И НЕ ТоварыКОтгрузкеОстаткиИОбороты.КОтгрузкеПриход = 0
			|			ТОГДА ВЫРАЗИТЬ(ТоварыКОтгрузкеОстаткиИОбороты.КОтгрузкеРасход * 100 / ТоварыКОтгрузкеОстаткиИОбороты.КОтгрузкеПриход КАК ЧИСЛО(3, 0))
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ПроцентОтгрузки2,
			|	ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаОплаты, 0) КАК СуммаОплаты,
			|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентОплаты, 0) КАК ПроцентОплаты,
			|	ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаОтгрузки, 0) КАК СуммаОтгрузки,
			|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентОтгрузки, 0) КАК ПроцентОтгрузки,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаДолга, 0) < 0
			|			ТОГДА ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаДолга, 0)
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК НашДолг,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаДолга, 0) > 0
			|			ТОГДА ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаДолга, 0)
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ДолгКлиента,
			|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентДолга, 0) КАК ПроцентДолга,
			|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ДатаСобытия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСобытия,
			|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ЕстьРасхожденияОрдерНакладная, ЛОЖЬ) КАК ЕстьРасхожденияОрдерНакладная,
			|	ВЫБОР
			|		КОГДА НЕ ДокументЗаказКлиента.Проведен
			|			ТОГДА ЛОЖЬ
			|		КОГДА СостоянияЗаказовКлиентов.ДатаСобытия <> ДАТАВРЕМЯ(1, 1, 1)
			|				И &ДатаАктуальности > СостоянияЗаказовКлиентов.ДатаСобытия
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК Просрочен
			|ИЗ
			|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДокументЗаказКлиента
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				ДополнительныеРеквизиты.Ссылка КАК ДокументСсылка,
			|				ДополнительныеРеквизиты.Свойство КАК Свойство,
			|				ДополнительныеРеквизиты.Значение КАК Значение
			|			ИЗ
			|				Документ.ЗаказКлиента.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
			|			ГДЕ
			|				ДополнительныеРеквизиты.Свойство.Заголовок ПОДОБНО ""Документы возвращены"") КАК ДополнительныеРеквизитыДокумента
			|			ПО (ДополнительныеРеквизитыДокумента.ДокументСсылка = ДокументЗаказКлиента.Ссылка)
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.ОстаткиИОбороты(, , Период, Движения, ) КАК РасчетыСКлиентамиОстаткиИОбороты
			|			ПО ДокументЗаказКлиента.Ссылка = РасчетыСКлиентамиОстаткиИОбороты.ОбъектРасчетов.Объект
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.ОстаткиИОбороты(, , Период, Движения, ) КАК ТоварыКОтгрузкеОстаткиИОбороты
			|			ПО ДокументЗаказКлиента.Ссылка = ТоварыКОтгрузкеОстаткиИОбороты.Назначение.Заказ
			|		ПО СостоянияЗаказовКлиентов.Заказ = ДокументЗаказКлиента.Ссылка
			|ГДЕ
			|	ДокументЗаказКлиента.Партнер.ГруппаДоступа В(&ГруппаДоступа)
			|	И ДокументЗаказКлиента.Партнер.ГруппаДоступа <> ЗНАЧЕНИЕ(Справочник.ГруппыДоступаПартнеров.ПустаяСсылка)";
			Если МассивОрганизаций.Количество() > 0 Тогда
				НовыйЗапрос.Текст = НовыйЗапрос.Текст + 
								"
								|   И ДокументЗаказКлиента.Организация В (&Организация)"; 
			КонецЕсли;
				
			ЗаказыКлиентовСписок.ТекстЗапроса = НовыйЗапрос.Текст;
			ЗаказыКлиентовСписок.Параметры.УстановитьЗначениеПараметра("ГруппаДоступа",СписокГруппДоступа);
			Если МассивОрганизаций.Количество() > 0 Тогда
				ЗаказыКлиентовСписок.Параметры.УстановитьЗначениеПараметра("Организация",МассивОрганизаций);
			КонецЕсли;	
			
		КонецЕсли;	
	КонецЕсли;
	
	//********************************
	
	// Документ имеет высокий приоритет
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Документ имеет высокий приоритет'");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Приоритет");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.Приоритеты.ПолучитьВысшийПриоритет();
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ВысокийПриоритетДокумента);
	
	
	// Документ имеет низкий приоритет
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Документ имеет низкий приоритет'");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Приоритет");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.Приоритеты.ПолучитьНизшийПриоритет();
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.НизкийПриоритетДокумента);
	
	
	//// Выделение цветом состояния "Закрыт"
	//Элемент = СписокУсловноеОформление.Элементы.Добавить();
	//Элемент.Представление = НСтр("ru = 'Выделение цветом состояния ""Закрыт""'");
	//
	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Состояние");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = Перечисления.СостоянияЗаказовКлиентов.Закрыт;
	//
	//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЗакрытыйДокумент);
	
	
	// Выделение цветом просроченного заказа
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Выделение цветом просроченного заказа'");
	
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Состояние");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("ДатаСобытия");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Просрочен");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныйДокумент);
	
	
	//**  
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Состояние");
	
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "ЗаказыКлиентовСписок.Дата", Элементы.ЗаказыКлиентовДата.Имя);

	УсловноеОформлениеРасширение(СписокУсловноеОформление);

КонецПроцедуры	// УстановитьУсловноеОформление()

&НаСервере
Процедура УсловноеОформлениеРасширение(СписокУсловноеОформление)

	// Ввыделение цветом Не отгруженные, но готовые к отгрузке
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Выделение цветом не отгруженные, но готовые к отгрузке'");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Состояние");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СостоянияЗаказовКлиентов.ГотовКОтгрузке;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроцентДолга");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроцентОплаты");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроцентОтгрузки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(135,206,235));	//голубой
	
	
	// Выделение цветом заказа оплаченного, отгруженного, по которому вернули документы (выделяем зеленым цветом)
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Выделение цветом успешно закрытого заказа'");
	
	//Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Дата");
	//Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Номер");
	
	ГруппаЭлементовОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.[Документы возвращены (Список заказов клиентов)]");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроцентОплаты");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = 100;
	
	ОтборЭлемента = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроцентОтгрузки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = 100;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(204,255,204)); // что то близкое к зеленому
	
	
	// Выделение цветом заказа оплаченного, отгруженного, по которому НЕ вернули документы (выделяем красным цветом)
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Выделение цветом оплаченного, отгруженного заказа, по которому нет документов'");
	
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Ссылка.[Документы возвращены (Список заказов клиентов)]"); // выделяем поле признака возврата документов
	
	ГруппаЭлементовОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.[Документы возвращены (Список заказов клиентов)]");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроцентОплаты");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = 100;
	
	ОтборЭлемента = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроцентОтгрузки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = 100;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255,176,135)); // что-то близкое к красному
	
	
	// Выделение цветом заказа отгруженного но не оплаченного - красным
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Выделение цветом отгруженного, но не оплаченного заказа'");
	
	ГруппаЭлементовОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроцентОплаты");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ОтборЭлемента = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроцентОтгрузки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = 1;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255,176,135)); // что-то близкое к красному
	
	
	// Выделение цветом заказа не отгруженного но оплаченного - красным - зеленым 50/50
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Выделение красным цветом не отгруженного, но оплаченного заказа'");
	
	ГруппаЭлементовОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроцентОплаты");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = 1;
	
	ОтборЭлемента = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроцентОтгрузки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255,170,135)); // что-то близкое к красному
	
	
	//**
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Выделение зеленым цветом не отгруженного, но оплаченного заказа'");
	
	
	// перечислим оформляемые поля
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Приоритет");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Дата");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Номер");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("СуммаДокумента");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Партнер");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Состояние");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("ПроцентОплаты");
	//Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("ПроцентДолга");
	//Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("ПроцентОтгрузки");
	//Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Ссылка.[Документы возвращены (Список заказов клиентов)]"); // выделяем поле признака возврата документов
	
	ГруппаЭлементовОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроцентОплаты");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = 1;
	
	ОтборЭлемента = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроцентОтгрузки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(205,255,200)); // что-то близкое к зеленому
	
	
	//Отбор по "Документы возвращены"
	СписокОтбор = ЗаказыКлиентовСписок.КомпоновщикНастроек.Настройки.Отбор;
	ОтборЭлемента = СписокОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.[Документы возвращены (Список заказов клиентов)]"); // выделяем поле признака возврата документов
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	ОтборЭлемента.Использование = Ложь;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеЗадач()
	
	УсловноеОформление.Элементы.Очистить();
	БизнесПроцессыИЗадачиСервер.УстановитьОформлениеЗадач(ЗадачиПользователяСписок);
	
КонецПроцедуры	// УстановитьУсловноеОформлениеЗадач()

//**Изменено 07.10.19 Максимов

&НаСервере
Процедура УстановитьУсловноеОформлениеРеализация()
	
	// Условное оформление динамического списка "Список"
	СписокУсловноеОформление = РеализацияТоваровУслугСписок.КомпоновщикНастроек.Настройки.УсловноеОформление;
	СписокУсловноеОформление.Элементы.Очистить();
	
	Если НЕ РольДоступна("АдминистраторСистемы") Тогда
		Если НЕ РольДоступна("Администрирование") Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			 "ВЫБРАТЬ
			 |	ГруппыДоступа.Ссылка КАК Ссылка,
			 |	ГруппыДоступа.Пользователи.(
			 |		Пользователь КАК Пользователь
			 |	) КАК Пользователи,
			 |	ГруппыДоступа.ЗначенияДоступа.(
			 |		ЗначениеДоступа КАК ЗначениеДоступа
			 |	) КАК ЗначенияДоступа
			 |ИЗ
			 |	Справочник.ГруппыДоступа КАК ГруппыДоступа
			 |ГДЕ
			 |	ГруппыДоступа.Пользователи.Пользователь = &Пользователь";
			
			Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
			
			ГруппыДоступа = Запрос.Выполнить().Выгрузить();

			СписокГруппДоступа = Новый Массив;
			Для Каждого Группа Из ГруппыДоступа Цикл
				Для Каждого Стр Из Группа.ЗначенияДоступа Цикл			
			 		СписокГруппДоступа.Добавить(Стр.ЗначениеДоступа);
				КонецЦикла;
			КонецЦикла;	
				
			НовыйЗапрос = Новый Запрос;
			НовыйЗапрос.Текст = 
			"ВЫБРАТЬ
			|	ДокументРеализацияТоваровУслуг.Ссылка КАК Ссылка,
			|	ДокументРеализацияТоваровУслуг.ПометкаУдаления КАК ПометкаУдаления,
			|	ДокументРеализацияТоваровУслуг.Номер КАК Номер,
			|	ДокументРеализацияТоваровУслуг.Дата КАК Дата,
			|	ДокументРеализацияТоваровУслуг.Проведен КАК Проведен,
			|	ДокументРеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
			|	ДокументРеализацияТоваровУслуг.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
			|	ДокументРеализацияТоваровУслуг.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
			|	ДокументРеализацияТоваровУслуг.БанковскийСчетГрузоотправителя КАК БанковскийСчетГрузоотправителя,
			|	ДокументРеализацияТоваровУслуг.БанковскийСчетГрузополучателя КАК БанковскийСчетГрузополучателя,
			|	ДокументРеализацияТоваровУслуг.Валюта КАК Валюта,
			|	ДокументРеализацияТоваровУслуг.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
			|	ДокументРеализацияТоваровУслуг.Грузоотправитель КАК Грузоотправитель,
			|	ДокументРеализацияТоваровУслуг.Грузополучатель КАК Грузополучатель,
			|	ДокументРеализацияТоваровУслуг.ДоверенностьВыдана КАК ДоверенностьВыдана,
			|	ДокументРеализацияТоваровУслуг.ДоверенностьДата КАК ДоверенностьДата,
			|	ДокументРеализацияТоваровУслуг.ДоверенностьЛицо КАК ДоверенностьЛицо,
			|	ДокументРеализацияТоваровУслуг.ДоверенностьНомер КАК ДоверенностьНомер,
			|	ДокументРеализацияТоваровУслуг.ЗаказКлиента КАК ЗаказКлиента,
			|	ДокументРеализацияТоваровУслуг.Организация КАК Организация,
			|	ДокументРеализацияТоваровУслуг.Контрагент КАК Контрагент,
			|	ДокументРеализацияТоваровУслуг.Менеджер КАК Менеджер,
			|	ДокументРеализацияТоваровУслуг.НалогообложениеНДС КАК НалогообложениеНДС,
			|	ДокументРеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
			|	ДокументРеализацияТоваровУслуг.Партнер КАК Партнер,
			|	ДокументРеализацияТоваровУслуг.Подразделение КАК Подразделение,
			|	ДокументРеализацияТоваровУслуг.Сделка КАК Сделка,
			|	ДокументРеализацияТоваровУслуг.СкидкиРассчитаны КАК СкидкиРассчитаны,
			|	ДокументРеализацияТоваровУслуг.Склад КАК Склад,
			|	ДокументРеализацияТоваровУслуг.Согласован КАК Согласован,
			|	ДокументРеализацияТоваровУслуг.Соглашение КАК Соглашение,
			|	ДокументРеализацияТоваровУслуг.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
			|	ДокументРеализацияТоваровУслуг.Комментарий КАК Комментарий,
			|	ДокументРеализацияТоваровУслуг.ФормаОплаты КАК ФормаОплаты,
			|	ДокументРеализацияТоваровУслуг.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
			|	ДокументРеализацияТоваровУслуг.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
			|	ДокументРеализацияТоваровУслуг.Касса КАК Касса,
			|	ДокументРеализацияТоваровУслуг.Отпустил КАК Отпустил,
			|	ДокументРеализацияТоваровУслуг.ОтпустилДолжность КАК ОтпустилДолжность,
			|	ДокументРеализацияТоваровУслуг.РеализацияПоЗаказам КАК РеализацияПоЗаказам,
			|	ДокументРеализацияТоваровУслуг.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
			|	ДокументРеализацияТоваровУслуг.КартаЛояльности КАК КартаЛояльности,
			|	ДокументРеализацияТоваровУслуг.Договор КАК Договор,
			|	ДокументРеализацияТоваровУслуг.Основание КАК Основание,
			|	ДокументРеализацияТоваровУслуг.Статус КАК Статус,
			|	ДокументРеализацияТоваровУслуг.Автор КАК Автор,
			|	ДокументРеализацияТоваровУслуг.СпособДоставки КАК СпособДоставки,
			|	ДокументРеализацияТоваровУслуг.ЗонаДоставки КАК ЗонаДоставки,
			|	ДокументРеализацияТоваровУслуг.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
			|	ДокументРеализацияТоваровУслуг.ПеревозчикПартнер КАК ПеревозчикПартнер,
			|	ДокументРеализацияТоваровУслуг.ВремяДоставкиС КАК ВремяДоставкиС,
			|	ДокументРеализацияТоваровУслуг.ВремяДоставкиПо КАК ВремяДоставкиПо,
			|	ДокументРеализацияТоваровУслуг.АдресДоставкиПеревозчика КАК АдресДоставкиПеревозчика,
			|	ДокументРеализацияТоваровУслуг.АдресДоставкиПеревозчикаЗначенияПолей КАК АдресДоставкиПеревозчикаЗначенияПолей,
			|	ДокументРеализацияТоваровУслуг.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
			|	ДокументРеализацияТоваровУслуг.КонтактноеЛицо КАК КонтактноеЛицо,
			|	ДокументРеализацияТоваровУслуг.Руководитель КАК Руководитель,
			|	ДокументРеализацияТоваровУслуг.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
			|	ДокументРеализацияТоваровУслуг.ПорядокРасчетов КАК ПорядокРасчетов,
			|	ДокументРеализацияТоваровУслуг.ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
			|	ДокументРеализацияТоваровУслуг.ДатаВозвратаМногооборотнойТары КАК ДатаВозвратаМногооборотнойТары,
			|	ДокументРеализацияТоваровУслуг.СостояниеЗаполненияМногооборотнойТары КАК СостояниеЗаполненияМногооборотнойТары,
			|	ДокументРеализацияТоваровУслуг.ВидыЗапасовУказаныВручную КАК ВидыЗапасовУказаныВручную,
			|	ДокументРеализацияТоваровУслуг.ТребуетсяЗалогЗаТару КАК ТребуетсяЗалогЗаТару,
			|	ДокументРеализацияТоваровУслуг.ОснованиеДата КАК ОснованиеДата,
			|	ДокументРеализацияТоваровУслуг.ОснованиеНомер КАК ОснованиеНомер,
			|	ДокументРеализацияТоваровУслуг.ДопоставкаПоРеализации КАК ДопоставкаПоРеализации,
			|	ДокументРеализацияТоваровУслуг.ДатаПереходаПраваСобственности КАК ДатаПереходаПраваСобственности,
			|	ДокументРеализацияТоваровУслуг.ВариантОформленияПродажи КАК ВариантОформленияПродажи,
			|	ДокументРеализацияТоваровУслуг.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
			|	ДокументРеализацияТоваровУслуг.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
			|	ДокументРеализацияТоваровУслуг.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
			|	ДокументРеализацияТоваровУслуг.НаправлениеДеятельности КАК НаправлениеДеятельности,
			|	ДокументРеализацияТоваровУслуг.ЕстьМаркируемаяПродукцияГИСМ КАК ЕстьМаркируемаяПродукцияГИСМ,
			|	ДокументРеализацияТоваровУслуг.СуммаВзаиморасчетовПоТаре КАК СуммаВзаиморасчетовПоТаре,
			|	ВложенныйЗапрос.СостояниеОригиналаПервичногоДокумента КАК СостояниеОригиналаПервичногоДокумента,
			|	ВложенныйЗапрос.СостояниеОригиналПолучен КАК СостояниеОригиналПолучен,
			|	ДокументРеализацияТоваровУслуг.Товары.(
			|		Ссылка КАК Ссылка,
			|		НомерСтроки КАК НомерСтроки,
			|		Номенклатура КАК Номенклатура,
			|		Характеристика КАК Характеристика,
			|		Назначение КАК Назначение,
			|		Упаковка КАК Упаковка,
			|		КоличествоУпаковок КАК КоличествоУпаковок,
			|		Количество КАК Количество,
			|		ВидЦены КАК ВидЦены,
			|		Цена КАК Цена,
			|		Сумма КАК Сумма,
			|		СтавкаНДС КАК СтавкаНДС,
			|		СуммаНДС КАК СуммаНДС,
			|		СуммаСНДС КАК СуммаСНДС,
			|		КодСтроки КАК КодСтроки,
			|		СуммаРучнойСкидки КАК СуммаРучнойСкидки,
			|		СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
			|		ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
			|		ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
			|		КлючСвязи КАК КлючСвязи,
			|		Склад КАК Склад,
			|		СтатусУказанияСерий КАК СтатусУказанияСерий,
			|		СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
			|		ЗаказКлиента КАК ЗаказКлиента,
			|		СрокПоставки КАК СрокПоставки,
			|		ИдентификаторСтроки КАК ИдентификаторСтроки,
			|		Серия КАК Серия,
			|		АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
			|		НоменклатураНабора КАК НоменклатураНабора,
			|		ХарактеристикаНабора КАК ХарактеристикаНабора,
			|		АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
			|		КодТНВЭД КАК КодТНВЭД
			|	) КАК Товары
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК ДокументРеализацияТоваровУслуг
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			СостоянияОригиналовПервичныхДокументов.Состояние КАК СостояниеОригиналаПервичногоДокумента,
			|			СостоянияОригиналовПервичныхДокументов.ОбщееСостояние КАК ОбщееСостояние,
			|			ВЫБОР
			|				КОГДА СостоянияОригиналовПервичныхДокументов.Состояние = ЗНАЧЕНИЕ(Справочник.СостоянияОригиналовПервичныхДокументов.ОригиналПолучен)
			|					ТОГДА 1
			|				ИНАЧЕ 0
			|			КОНЕЦ КАК СостояниеОригиналПолучен,
			|			СостоянияОригиналовПервичныхДокументов.Владелец КАК Ссылка
			|		ИЗ
			|			РегистрСведений.СостоянияОригиналовПервичныхДокументов КАК СостоянияОригиналовПервичныхДокументов
			|		ГДЕ
			|			СостоянияОригиналовПервичныхДокументов.ОбщееСостояние) КАК ВложенныйЗапрос
			|		ПО ДокументРеализацияТоваровУслуг.Ссылка = ВложенныйЗапрос.Ссылка
			|ГДЕ
			|	ДокументРеализацияТоваровУслуг.Партнер.ГруппаДоступа В(&ГруппаДоступа)"; 
			
			РеализацияТоваровУслугСписок.ТекстЗапроса = НовыйЗапрос.Текст;
			РеализацияТоваровУслугСписок.Параметры.УстановитьЗначениеПараметра("ГруппаДоступа",СписокГруппДоступа);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьУсловноеОформлениеЗаказНаСборку()
	
	СписокУсловноеОформление = ЗаказНаСборкуСписок.КомпоновщикНастроек.Настройки.УсловноеОформление;
	СписокУсловноеОформление.Элементы.Очистить();
	
	Если НЕ РольДоступна("АдминистраторСистемы") Тогда
		Если НЕ РольДоступна("Администрирование") Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			 "ВЫБРАТЬ
			 |	ГруппыДоступа.Ссылка КАК Ссылка,
			 |	ГруппыДоступа.Пользователи.(
			 |		Пользователь КАК Пользователь
			 |	) КАК Пользователи,
			 |	ГруппыДоступа.ЗначенияДоступа.(
			 |		ЗначениеДоступа КАК ЗначениеДоступа
			 |	) КАК ЗначенияДоступа
			 |ИЗ
			 |	Справочник.ГруппыДоступа КАК ГруппыДоступа
			 |ГДЕ
			 |	ГруппыДоступа.Пользователи.Пользователь = &Пользователь";
			
			Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
			
			ГруппыДоступа = Запрос.Выполнить().Выгрузить();

			СписокГруппДоступа = Новый Массив;
			Для Каждого Группа Из ГруппыДоступа Цикл
				Для Каждого Стр Из Группа.ЗначенияДоступа Цикл			
			 		СписокГруппДоступа.Добавить(Стр.ЗначениеДоступа);
				КонецЦикла;
			КонецЦикла;	
				
			НовыйЗапрос = Новый Запрос;
			НовыйЗапрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказНаСборку.Ссылка КАК Ссылка,
			|	ЗаказНаСборку.ВерсияДанных КАК ВерсияДанных,
			|	ЗаказНаСборку.ПометкаУдаления КАК ПометкаУдаления,
			|	ЗаказНаСборку.Номер КАК Номер,
			|	ЗаказНаСборку.Дата КАК Дата,
			|	ЗаказНаСборку.Проведен КАК Проведен,
			|	ЗаказНаСборку.Организация КАК Организация,
			|	ЗаказНаСборку.Склад КАК Склад,
			|	ЗаказНаСборку.ДокументОснование КАК ДокументОснование,
			|	ЗаказНаСборку.Ответственный КАК Ответственный,
			|	ЗаказНаСборку.Статус КАК Статус,
			|	ЗаказНаСборку.Номенклатура КАК Номенклатура,
			|	ЗаказНаСборку.Характеристика КАК Характеристика,
			|	ЗаказНаСборку.Упаковка КАК Упаковка,
			|	ЗаказНаСборку.КоличествоУпаковок КАК КоличествоУпаковок,
			|	ЗаказНаСборку.Количество КАК Количество,
			|	ЗаказНаСборку.Комментарий КАК Комментарий,
			|	ЗаказНаСборку.НачалоСборкиРазборки КАК НачалоСборкиРазборки,
			|	ЗаказНаСборку.ОкончаниеСборкиРазборки КАК ОкончаниеСборкиРазборки,
			|	ЗаказНаСборку.ЖелаемаяДатаПоступления КАК ЖелаемаяДатаПоступления,
			|	ЗаказНаСборку.ДлительностьСборкиРазборки КАК ДлительностьСборкиРазборки,
			|	ЗаказНаСборку.МаксимальныйКодСтроки КАК МаксимальныйКодСтроки,
			|	ЗаказНаСборку.ВариантКомплектации КАК ВариантКомплектации,
			|	ЗаказНаСборку.Сделка КАК Сделка,
			|	ЗаказНаСборку.Подразделение КАК Подразделение,
			|	ЗаказНаСборку.СтатусУказанияСерий КАК СтатусУказанияСерий,
			|	ЗаказНаСборку.Назначение КАК Назначение,
			|	ЗаказНаСборку.НазначениеТовары КАК НазначениеТовары,
			|	ЗаказНаСборку.Серия КАК Серия,
			|	ЗаказНаСборку.ВариантОбеспечения КАК ВариантОбеспечения,
			|	ЗаказНаСборку.КоличествоУпаковокОтменено КАК КоличествоУпаковокОтменено,
			|	ЗаказНаСборку.КоличествоОтменено КАК КоличествоОтменено,
			|	ЗаказНаСборку.НаправлениеДеятельности КАК НаправлениеДеятельности,
			|	ЗаказНаСборку.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
			|	ЗаказНаСборку.СборкаПодДеятельность КАК СборкаПодДеятельность,
			|	ЗаказНаСборку.ОбосабливатьПоНазначениюЗаказа КАК ОбосабливатьПоНазначениюЗаказа,
			|	ЗаказНаСборку.ВариантПриемкиТоваров КАК ВариантПриемкиТоваров,
			|	ЗаказНаСборку.Товары.(
			|		Ссылка КАК Ссылка,
			|		НомерСтроки КАК НомерСтроки,
			|		Номенклатура КАК Номенклатура,
			|		Характеристика КАК Характеристика,
			|		Назначение КАК Назначение,
			|		Упаковка КАК Упаковка,
			|		Количество КАК Количество,
			|		КоличествоУпаковок КАК КоличествоУпаковок,
			|		КодСтроки КАК КодСтроки,
			|		СтатусУказанияСерий КАК СтатусУказанияСерий,
			|		УказыватьСерии КАК УказыватьСерии,
			|		ВариантОбеспечения КАК ВариантОбеспечения,
			|		Серия КАК Серия,
			|		Отменено КАК Отменено
			|	) КАК Товары,
			|	ЗаказНаСборку.Серии.(
			|		Ссылка КАК Ссылка,
			|		НомерСтроки КАК НомерСтроки,
			|		Серия КАК Серия,
			|		Количество КАК Количество,
			|		Номенклатура КАК Номенклатура,
			|		Характеристика КАК Характеристика,
			|		Назначение КАК Назначение
			|	) КАК Серии,
			|	ЗаказНаСборку.ДополнительныеРеквизиты.(
			|		Ссылка КАК Ссылка,
			|		НомерСтроки КАК НомерСтроки,
			|		Свойство КАК Свойство,
			|		Значение КАК Значение,
			|		ТекстоваяСтрока КАК ТекстоваяСтрока
			|	) КАК ДополнительныеРеквизиты,
			|	ЗаказНаСборку.Представление КАК Представление,
			|	ЗаказНаСборку.МоментВремени КАК МоментВремени
			|ИЗ
			|	Документ.ЗаказНаСборку КАК ЗаказНаСборку
			|ГДЕ
			|	ЗаказНаСборку.ДокументОснование.Партнер.ГруппаДоступа В(&ГруппаДоступа)"; 
			
			ЗаказНаСборкуСписок.ТекстЗапроса = НовыйЗапрос.Текст;
			ЗаказНаСборкуСписок.Параметры.УстановитьЗначениеПараметра("ГруппаДоступа",СписокГруппДоступа);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура Подключаемый_ОбновитьДанныеТаблиц()
	ТекущиеДанные = Элементы.ЗаказыКлиентов.ТекущиеДанные; // Возвращает структуру с данными
	Если ТипЗнч(ТекущиеДанные) = Тип("ДанныеФормыСтруктура") И ТекущиеДанные.Свойство("Ссылка")	Тогда
		СсылкаНаДокумент = ТекущиеДанные.Ссылка;
	Иначе
		СсылкаНаДокумент = ПолучитьПустуюСсылкуНаЗаказКлиента();
	КонецЕсли;

	
	Если НЕ ( Флаг ) Тогда  
		Если НЕ ( СсылкаНаДокумент.Пустая() ) И ( СсылкаНаДокумент <> ЭтаФорма.мТекущийЗаказКлиента ) Тогда
			ОбновитьДанныеТаблицыТоваровЗаказаНаСервереН(СсылкаНаДокумент );
			ЭтаФорма.мТекущийЗаказКлиента = СсылкаНаДокумент;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВнешнийОтчет(Команда)
	
	ВнешнийОтчет = ПолучитьСсылкуНаВнешнийОтчетНаСервере(Неопределено);
	
	ИмяОбработкиСлужебное = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВнешнийОтчет);
	
	ОткрытьФорму("ВнешнийОтчет." + ИмяОбработкиСлужебное + ".Форма")
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаВнешнийОтчетНаСервере(Отчет)
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("АнализПоказателейЗаказов7.9").Ссылка;	
КонецФункции

&НаКлиенте
Процедура СвязанныеДокументы(Команда)
	
	Если ЭтаФорма.ТекущийЭлемент.Имя = "ЗаказыКлиентов" Тогда
		МенюОтчетыУТКлиент.СтруктураПодчиненности(Элементы.ЗаказыКлиентов.ТекущиеДанные.Ссылка,Неопределено);
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Имя = "ЗаказНаСборкуСписок" Тогда
		МенюОтчетыУТКлиент.СтруктураПодчиненности(Элементы.ЗаказНаСборкуСписок.ТекущаяСтрока,Неопределено);
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Имя = "РеализацияТоваровУслугСписок" Тогда 	
		МенюОтчетыУТКлиент.СтруктураПодчиненности(Элементы.РеализацияТоваровУслугСписок.ТекущаяСтрока,Неопределено);
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Имя = "ЗаявкиНаДоставкуСписок" Тогда
		МенюОтчетыУТКлиент.СтруктураПодчиненности(Элементы.ЗаявкиНаДоставкуСписок.ТекущаяСтрока,Неопределено);
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Имя = "ВнутренниеЗаказы" Тогда    //##
		МенюОтчетыУТКлиент.СтруктураПодчиненности(Элементы.ВнутренниеЗаказы.ТекущаяСтрока,Неопределено);
	КонецЕсли;	
		
КонецПроцедуры

//** Добавлено Максимов В.А.

&НаСервере
Процедура ПолучитьГруппуДоступаДляРеализаций(МассивОрганизаций, СписокГруппДоступа)

	Если НЕ РольДоступна("АдминистраторСистемы") Тогда
		Если НЕ РольДоступна("Администрирование") Тогда	
			Запрос = Новый Запрос;
			Запрос.Текст = 
			 "ВЫБРАТЬ
			 |	ГруппыДоступа.Ссылка КАК Ссылка,
			 |	ГруппыДоступа.Пользователи.(
			 |		Пользователь КАК Пользователь
			 |	) КАК Пользователи,
			 |	ГруппыДоступа.ЗначенияДоступа.(
			 |		ЗначениеДоступа КАК ЗначениеДоступа
			 |	) КАК ЗначенияДоступа
			 |ИЗ
			 |	Справочник.ГруппыДоступа КАК ГруппыДоступа
			 |ГДЕ
			 |	ГруппыДоступа.Пользователи.Пользователь = &Пользователь";
			
			Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
			
			ГруппыДоступа = Запрос.Выполнить().Выгрузить();

			Для Каждого Группа Из ГруппыДоступа Цикл
				Для Каждого Стр Из Группа.ЗначенияДоступа Цикл
					Если ТипЗнч(Стр.ЗначениеДоступа) = Тип("СправочникСсылка.ГруппыДоступаПартнеров") Тогда
			 			СписокГруппДоступа.Добавить(Стр.ЗначениеДоступа);
					КонецЕсли;	
					Если ТипЗнч(Стр.ЗначениеДоступа) = Тип("СправочникСсылка.Организации") Тогда
						МассивОрганизаций.Добавить(Стр.ЗначениеДоступа);
					КонецЕсли;	
				КонецЦикла;
			КонецЦикла;
			
			НовыйЗапрос = Новый Запрос;
			НовыйЗапрос.Текст =
			"ВЫБРАТЬ
			|	ДокументРеализацияТоваровУслуг.Ссылка КАК Ссылка,
			|	ДокументРеализацияТоваровУслуг.ПометкаУдаления КАК ПометкаУдаления,
			|	ДокументРеализацияТоваровУслуг.Номер КАК Номер,
			|	ДокументРеализацияТоваровУслуг.Дата КАК Дата,
			|	ДокументРеализацияТоваровУслуг.Проведен КАК Проведен,
			|	ДокументРеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
			|	ДокументРеализацияТоваровУслуг.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
			|	ДокументРеализацияТоваровУслуг.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
			|	ДокументРеализацияТоваровУслуг.БанковскийСчетГрузоотправителя КАК БанковскийСчетГрузоотправителя,
			|	ДокументРеализацияТоваровУслуг.БанковскийСчетГрузополучателя КАК БанковскийСчетГрузополучателя,
			|	ДокументРеализацияТоваровУслуг.Валюта КАК Валюта,
			|	ДокументРеализацияТоваровУслуг.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
			|	ДокументРеализацияТоваровУслуг.Грузоотправитель КАК Грузоотправитель,
			|	ДокументРеализацияТоваровУслуг.Грузополучатель КАК Грузополучатель,
			|	ДокументРеализацияТоваровУслуг.ДоверенностьВыдана КАК ДоверенностьВыдана,
			|	ДокументРеализацияТоваровУслуг.ДоверенностьДата КАК ДоверенностьДата,
			|	ДокументРеализацияТоваровУслуг.ДоверенностьЛицо КАК ДоверенностьЛицо,
			|	ДокументРеализацияТоваровУслуг.ДоверенностьНомер КАК ДоверенностьНомер,
			|	ДокументРеализацияТоваровУслуг.ЗаказКлиента КАК ЗаказКлиента,
			|	ДокументРеализацияТоваровУслуг.Организация КАК Организация,
			|	ДокументРеализацияТоваровУслуг.Контрагент КАК Контрагент,
			|	ДокументРеализацияТоваровУслуг.Менеджер КАК Менеджер,
			|	ДокументРеализацияТоваровУслуг.НалогообложениеНДС КАК НалогообложениеНДС,
			|	ДокументРеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
			|	ДокументРеализацияТоваровУслуг.Партнер КАК Партнер,
			|	ДокументРеализацияТоваровУслуг.Подразделение КАК Подразделение,
			|	ДокументРеализацияТоваровУслуг.Сделка КАК Сделка,
			|	ДокументРеализацияТоваровУслуг.СкидкиРассчитаны КАК СкидкиРассчитаны,
			|	ДокументРеализацияТоваровУслуг.Склад КАК Склад,
			|	ДокументРеализацияТоваровУслуг.Согласован КАК Согласован,
			|	ДокументРеализацияТоваровУслуг.Соглашение КАК Соглашение,
			|	ДокументРеализацияТоваровУслуг.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
			|	ДокументРеализацияТоваровУслуг.Комментарий КАК Комментарий,
			|	ДокументРеализацияТоваровУслуг.ФормаОплаты КАК ФормаОплаты,
			|	ДокументРеализацияТоваровУслуг.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
			|	ДокументРеализацияТоваровУслуг.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
			|	ДокументРеализацияТоваровУслуг.Касса КАК Касса,
			|	ДокументРеализацияТоваровУслуг.Отпустил КАК Отпустил,
			|	ДокументРеализацияТоваровУслуг.ОтпустилДолжность КАК ОтпустилДолжность,
			|	ДокументРеализацияТоваровУслуг.РеализацияПоЗаказам КАК РеализацияПоЗаказам,
			|	ДокументРеализацияТоваровУслуг.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
			|	ДокументРеализацияТоваровУслуг.КартаЛояльности КАК КартаЛояльности,
			|	ДокументРеализацияТоваровУслуг.Договор КАК Договор,
			|	ДокументРеализацияТоваровУслуг.Основание КАК Основание,
			|	ДокументРеализацияТоваровУслуг.Статус КАК Статус,
			|	ДокументРеализацияТоваровУслуг.Автор КАК Автор,
			|	ДокументРеализацияТоваровУслуг.СпособДоставки КАК СпособДоставки,
			|	ДокументРеализацияТоваровУслуг.ЗонаДоставки КАК ЗонаДоставки,
			|	ДокументРеализацияТоваровУслуг.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
			|	ДокументРеализацияТоваровУслуг.ПеревозчикПартнер КАК ПеревозчикПартнер,
			|	ДокументРеализацияТоваровУслуг.ВремяДоставкиС КАК ВремяДоставкиС,
			|	ДокументРеализацияТоваровУслуг.ВремяДоставкиПо КАК ВремяДоставкиПо,
			|	ДокументРеализацияТоваровУслуг.АдресДоставкиПеревозчика КАК АдресДоставкиПеревозчика,
			|	ДокументРеализацияТоваровУслуг.АдресДоставкиПеревозчикаЗначенияПолей КАК АдресДоставкиПеревозчикаЗначенияПолей,
			|	ДокументРеализацияТоваровУслуг.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
			|	ДокументРеализацияТоваровУслуг.КонтактноеЛицо КАК КонтактноеЛицо,
			|	ДокументРеализацияТоваровУслуг.Руководитель КАК Руководитель,
			|	ДокументРеализацияТоваровУслуг.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
			|	ДокументРеализацияТоваровУслуг.ПорядокРасчетов КАК ПорядокРасчетов,
			|	ДокументРеализацияТоваровУслуг.ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
			|	ДокументРеализацияТоваровУслуг.ДатаВозвратаМногооборотнойТары КАК ДатаВозвратаМногооборотнойТары,
			|	ДокументРеализацияТоваровУслуг.СостояниеЗаполненияМногооборотнойТары КАК СостояниеЗаполненияМногооборотнойТары,
			|	ДокументРеализацияТоваровУслуг.ВидыЗапасовУказаныВручную КАК ВидыЗапасовУказаныВручную,
			|	ДокументРеализацияТоваровУслуг.ТребуетсяЗалогЗаТару КАК ТребуетсяЗалогЗаТару,
			|	ДокументРеализацияТоваровУслуг.ОснованиеДата КАК ОснованиеДата,
			|	ДокументРеализацияТоваровУслуг.ОснованиеНомер КАК ОснованиеНомер,
			|	ДокументРеализацияТоваровУслуг.ДопоставкаПоРеализации КАК ДопоставкаПоРеализации,
			|	ДокументРеализацияТоваровУслуг.ДатаПереходаПраваСобственности КАК ДатаПереходаПраваСобственности,
			|	ДокументРеализацияТоваровУслуг.ВариантОформленияПродажи КАК ВариантОформленияПродажи,
			|	ДокументРеализацияТоваровУслуг.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
			|	ДокументРеализацияТоваровУслуг.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
			|	ДокументРеализацияТоваровУслуг.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
			|	ДокументРеализацияТоваровУслуг.НаправлениеДеятельности КАК НаправлениеДеятельности,
			|	ДокументРеализацияТоваровУслуг.ЕстьМаркируемаяПродукцияГИСМ КАК ЕстьМаркируемаяПродукцияГИСМ,
			|	ДокументРеализацияТоваровУслуг.СуммаВзаиморасчетовПоТаре КАК СуммаВзаиморасчетовПоТаре,
			|	ДокументРеализацияТоваровУслуг.Товары.(
			|		Ссылка КАК Ссылка,
			|		НомерСтроки КАК НомерСтроки,
			|		Номенклатура КАК Номенклатура,
			|		Характеристика КАК Характеристика,
			|		Назначение КАК Назначение,
			|		Упаковка КАК Упаковка,
			|		КоличествоУпаковок КАК КоличествоУпаковок,
			|		Количество КАК Количество,
			|		ВидЦены КАК ВидЦены,
			|		Цена КАК Цена,
			|		Сумма КАК Сумма,
			|		СтавкаНДС КАК СтавкаНДС,
			|		СуммаНДС КАК СуммаНДС,
			|		СуммаСНДС КАК СуммаСНДС,
			|		КодСтроки КАК КодСтроки,
			|		СуммаРучнойСкидки КАК СуммаРучнойСкидки,
			|		СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
			|		ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
			|		ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
			|		КлючСвязи КАК КлючСвязи,
			|		Склад КАК Склад,
			|		СтатусУказанияСерий КАК СтатусУказанияСерий,
			|		СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
			|		ЗаказКлиента КАК ЗаказКлиента,
			|		СрокПоставки КАК СрокПоставки,
			|		ИдентификаторСтроки КАК ИдентификаторСтроки,
			|		Серия КАК Серия,
			|		АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
			|		НоменклатураНабора КАК НоменклатураНабора,
			|		ХарактеристикаНабора КАК ХарактеристикаНабора,
			|		АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
			|		КодТНВЭД КАК КодТНВЭД
			|	) КАК Товары,
			|	ВложенныйЗапрос.СостояниеОригиналПолучен КАК СостояниеОригиналПолучен,
			|	ВложенныйЗапрос.СостояниеОригиналаПервичногоДокумента КАК СостояниеОригиналаПервичногоДокумента
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК ДокументРеализацияТоваровУслуг
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			СостоянияОригиналовПервичныхДокументов.Состояние КАК СостояниеОригиналаПервичногоДокумента,
			|			СостоянияОригиналовПервичныхДокументов.ОбщееСостояние КАК ОбщееСостояние,
			|			ВЫБОР
			|				КОГДА СостоянияОригиналовПервичныхДокументов.Состояние = ЗНАЧЕНИЕ(Справочник.СостоянияОригиналовПервичныхДокументов.ОригиналПолучен)
			|					ТОГДА 1
			|				ИНАЧЕ 0
			|			КОНЕЦ КАК СостояниеОригиналПолучен,
			|			СостоянияОригиналовПервичныхДокументов.Владелец КАК Ссылка
			|		ИЗ
			|			РегистрСведений.СостоянияОригиналовПервичныхДокументов КАК СостоянияОригиналовПервичныхДокументов
			|		ГДЕ
			|			СостоянияОригиналовПервичныхДокументов.ОбщееСостояние) КАК ВложенныйЗапрос
			|		ПО ДокументРеализацияТоваровУслуг.Ссылка = ВложенныйЗапрос.Ссылка
			|ГДЕ
			|	ДокументРеализацияТоваровУслуг.Партнер.ГруппаДоступа В(&ГруппаДоступа)
			|	И ДокументРеализацияТоваровУслуг.Партнер.ГруппаДоступа <> ЗНАЧЕНИЕ(Справочник.ГруппыДоступаПартнеров.ПустаяСсылка)";
			
			Если МассивОрганизаций.Количество() > 0 Тогда
				НовыйЗапрос.Текст = НовыйЗапрос.Текст + 
								"
								|   И ДокументРеализацияТоваровУслуг.Организация В (&Организация)"; 
			КонецЕсли;
				
			РеализацияТоваровУслугСписок.ТекстЗапроса = НовыйЗапрос.Текст;
			РеализацияТоваровУслугСписок.Параметры.УстановитьЗначениеПараметра("ГруппаДоступа",СписокГруппДоступа);
			Если МассивОрганизаций.Количество() > 0 Тогда
				РеализацияТоваровУслугСписок.Параметры.УстановитьЗначениеПараметра("Организация",МассивОрганизаций);
			КонецЕсли;			
		КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ГруппыДоступаДляЗаявкаНаДоставку(МассивОрганизаций, СписокГруппДоступа)
	
	Если НЕ РольДоступна("АдминистраторСистемы") Тогда
		Если НЕ РольДоступна("Администрирование") Тогда	
			Запрос = Новый Запрос;
			Запрос.Текст = 
			 "ВЫБРАТЬ
			 |	ГруппыДоступа.Ссылка КАК Ссылка,
			 |	ГруппыДоступа.Пользователи.(
			 |		Пользователь КАК Пользователь
			 |	) КАК Пользователи,
			 |	ГруппыДоступа.ЗначенияДоступа.(
			 |		ЗначениеДоступа КАК ЗначениеДоступа
			 |	) КАК ЗначенияДоступа
			 |ИЗ
			 |	Справочник.ГруппыДоступа КАК ГруппыДоступа
			 |ГДЕ
			 |	ГруппыДоступа.Пользователи.Пользователь = &Пользователь";
			
			Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
			
			ГруппыДоступа = Запрос.Выполнить().Выгрузить();

			Для Каждого Группа Из ГруппыДоступа Цикл
				Для Каждого Стр Из Группа.ЗначенияДоступа Цикл
					Если ТипЗнч(Стр.ЗначениеДоступа) = Тип("СправочникСсылка.ГруппыДоступаПартнеров") Тогда
			 			СписокГруппДоступа.Добавить(Стр.ЗначениеДоступа);
					КонецЕсли;	
					Если ТипЗнч(Стр.ЗначениеДоступа) = Тип("СправочникСсылка.Организации") Тогда
						МассивОрганизаций.Добавить(Стр.ЗначениеДоступа);
					КонецЕсли;	
				КонецЦикла;
			КонецЦикла;
	
			НовыйЗапрос = Новый Запрос;
			НовыйЗапрос.Текст =
			"ВЫБРАТЬ
			|	Документ_ЗаявкаНаДоставку.Ссылка КАК Ссылка,
			|	Документ_ЗаявкаНаДоставку.ПометкаУдаления КАК ПометкаУдаления,
			|	Документ_ЗаявкаНаДоставку.Номер КАК Номер,
			|	Документ_ЗаявкаНаДоставку.Дата КАК Дата,
			|	Документ_ЗаявкаНаДоставку.Проведен КАК Проведен,
			|	Документ_ЗаявкаНаДоставку.Партнер КАК Партнер,
			|	Документ_ЗаявкаНаДоставку.Контрагент КАК Контрагент,
			|	Документ_ЗаявкаНаДоставку.Организация КАК Организация,
			|	Документ_ЗаявкаНаДоставку.Валюта КАК Валюта,
			|	Документ_ЗаявкаНаДоставку.СуммаДокумента КАК СуммаДокумента,
			|	Документ_ЗаявкаНаДоставку.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
			|	Документ_ЗаявкаНаДоставку.Склад КАК Склад,
			|	Документ_ЗаявкаНаДоставку.Менеджер КАК Менеджер,
			|	Документ_ЗаявкаНаДоставку.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
			|	Документ_ЗаявкаНаДоставку.ДокументОснование КАК ДокументОснование,
			|	Документ_ЗаявкаНаДоставку.НеОтгружатьЧастями КАК НеОтгружатьЧастями,
			|	Документ_ЗаявкаНаДоставку.Статус КАК Статус,
			|	Документ_ЗаявкаНаДоставку.ДатаОтгрузки КАК ДатаОтгрузки,
			|	Документ_ЗаявкаНаДоставку.АдресДоставки КАК АдресДоставки,
			|	Документ_ЗаявкаНаДоставку.Комментарий КАК Комментарий,
			|	Документ_ЗаявкаНаДоставку.Грузоотправитель КАК Грузоотправитель,
			|	Документ_ЗаявкаНаДоставку.Грузополучатель КАК Грузополучатель,
			|	Документ_ЗаявкаНаДоставку.Подразделение КАК Подразделение,
			|	Документ_ЗаявкаНаДоставку.Автор КАК Автор,
			|	Документ_ЗаявкаНаДоставку.СпособДоставки КАК СпособДоставки,
			|	Документ_ЗаявкаНаДоставку.ПеревозчикПартнер КАК ПеревозчикПартнер,
			|	Документ_ЗаявкаНаДоставку.ЗонаДоставки КАК ЗонаДоставки,
			|	Документ_ЗаявкаНаДоставку.ВремяДоставкиС КАК ВремяДоставкиС,
			|	Документ_ЗаявкаНаДоставку.ВремяДоставкиПо КАК ВремяДоставкиПо,
			|	Документ_ЗаявкаНаДоставку.АдресДоставкиПеревозчика КАК АдресДоставкиПеревозчика,
			|	Документ_ЗаявкаНаДоставку.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
			|	Документ_ЗаявкаНаДоставку.АдресДоставкиПеревозчикаЗначенияПолей КАК АдресДоставкиПеревозчикаЗначенияПолей,
			|	Документ_ЗаявкаНаДоставку.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
			|	Документ_ЗаявкаНаДоставку.КонтактноеЛицо КАК КонтактноеЛицо,
			|	Документ_ЗаявкаНаДоставку.НаправлениеДеятельности КАК НаправлениеДеятельности,
			|	Документ_ЗаявкаНаДоставку.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
			|	Документ_ЗаявкаНаДоставку.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
			|	Документ_ЗаявкаНаДоставку.КлючУникальности КАК КлючУникальности,
			|	СостоянияЗаказовКлиентов.Состояние КАК СостояниеЗаказа,
			|	Документ_ЗаявкаНаДоставку.Заказы.(
			|		Ссылка КАК Ссылка,
			|		НомерСтроки КАК НомерСтроки,
			|		НомерЗаказа КАК НомерЗаказа,
			|		ДатаЗаказа КАК ДатаЗаказа,
			|		ЗаказКлиента КАК ЗаказКлиента,
			|		НужныДокументы КАК НужныДокументы
			|	) КАК Заказы,
			|	Документ_ЗаявкаНаДоставку.Товары.(
			|		Ссылка КАК Ссылка,
			|		НомерСтроки КАК НомерСтроки,
			|		ДатаОтгрузки КАК ДатаОтгрузки,
			|		Номенклатура КАК Номенклатура,
			|		Характеристика КАК Характеристика,
			|		Упаковка КАК Упаковка,
			|		КоличествоУпаковок КАК КоличествоУпаковок,
			|		Количество КАК Количество,
			|		ВидЦены КАК ВидЦены,
			|		Цена КАК Цена,
			|		Сумма КАК Сумма,
			|		СтавкаНДС КАК СтавкаНДС,
			|		СуммаНДС КАК СуммаНДС,
			|		СуммаСНДС КАК СуммаСНДС,
			|		ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
			|		СуммаРучнойСкидки КАК СуммаРучнойСкидки,
			|		ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
			|		СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
			|		ПричинаОтмены КАК ПричинаОтмены,
			|		КодСтроки КАК КодСтроки,
			|		Отменено КАК Отменено,
			|		КлючСвязи КАК КлючСвязи,
			|		Склад КАК Склад,
			|		СрокПоставки КАК СрокПоставки,
			|		Содержание КАК Содержание,
			|		СтатусУказанияСерий КАК СтатусУказанияСерий,
			|		ВариантОбеспечения КАК ВариантОбеспечения,
			|		Серия КАК Серия,
			|		НоменклатураНабора КАК НоменклатураНабора,
			|		ХарактеристикаНабора КАК ХарактеристикаНабора,
			|		НаименованиеДляПечати КАК НаименованиеДляПечати,
			|		Артикул КАК Артикул,
			|		_УИДОтгрузка КАК _УИДОтгрузка
			|	) КАК Товары,
			|	Документ_ЗаявкаНаДоставку.МоментВремени КАК МоментВремени
			|ИЗ
			|	Документ._ЗаявкаНаДоставку КАК Документ_ЗаявкаНаДоставку
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
			|		ПО Документ_ЗаявкаНаДоставку.ДокументОснование = СостоянияЗаказовКлиентов.Заказ
			|ГДЕ
			|	Документ_ЗаявкаНаДоставку.ДокументОснование.Партнер.ГруппаДоступа В(&ГруппаДоступа)
			|	И Документ_ЗаявкаНаДоставку.ДокументОснование.Партнер.ГруппаДоступа <> ЗНАЧЕНИЕ(Справочник.ГруппыДоступаПартнеров.ПустаяСсылка)";
	
			Если МассивОрганизаций.Количество() > 0 Тогда
				НовыйЗапрос.Текст = НовыйЗапрос.Текст + 
								"
								|   И Документ_ЗаявкаНаДоставку.ДокументОснование.Организация В (&Организация)"; 
			КонецЕсли;
				
			ЗаявкиНаДоставкуСписок.ТекстЗапроса = НовыйЗапрос.Текст;
			ЗаявкиНаДоставкуСписок.Параметры.УстановитьЗначениеПараметра("ГруппаДоступа",СписокГруппДоступа);
			Если МассивОрганизаций.Количество() > 0 Тогда
				ЗаявкиНаДоставкуСписок.Параметры.УстановитьЗначениеПараметра("Организация",МассивОрганизаций);
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры	

&НаСервере
Процедура ГруппыДоступаДляЗаявкаНаСборку(МассивОрганизаций, СписокГруппДоступа)
	
	Если НЕ РольДоступна("АдминистраторСистемы") Тогда
		Если НЕ РольДоступна("Администрирование") Тогда	
			Запрос = Новый Запрос;
			Запрос.Текст = 
			 "ВЫБРАТЬ
			 |	ГруппыДоступа.Ссылка КАК Ссылка,
			 |	ГруппыДоступа.Пользователи.(
			 |		Пользователь КАК Пользователь
			 |	) КАК Пользователи,
			 |	ГруппыДоступа.ЗначенияДоступа.(
			 |		ЗначениеДоступа КАК ЗначениеДоступа
			 |	) КАК ЗначенияДоступа
			 |ИЗ
			 |	Справочник.ГруппыДоступа КАК ГруппыДоступа
			 |ГДЕ
			 |	ГруппыДоступа.Пользователи.Пользователь = &Пользователь";
			
			Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
			
			ГруппыДоступа = Запрос.Выполнить().Выгрузить();

			Для Каждого Группа Из ГруппыДоступа Цикл
				Для Каждого Стр Из Группа.ЗначенияДоступа Цикл
					Если ТипЗнч(Стр.ЗначениеДоступа) = Тип("СправочникСсылка.ГруппыДоступаПартнеров") Тогда
			 			СписокГруппДоступа.Добавить(Стр.ЗначениеДоступа);
					КонецЕсли;	
					Если ТипЗнч(Стр.ЗначениеДоступа) = Тип("СправочникСсылка.Организации") Тогда
						МассивОрганизаций.Добавить(Стр.ЗначениеДоступа);
					КонецЕсли;	
				КонецЦикла;
			КонецЦикла;
	
			НовыйЗапрос = Новый Запрос;
			НовыйЗапрос.Текст =
			"ВЫБРАТЬ
			|	ДокументЗаказНаСборку.Ссылка КАК Ссылка,
			|	ДокументЗаказНаСборку.ПометкаУдаления КАК ПометкаУдаления,
			|	ДокументЗаказНаСборку.Номер КАК Номер,
			|	ДокументЗаказНаСборку.Дата КАК Дата,
			|	ДокументЗаказНаСборку.Проведен КАК Проведен,
			|	ДокументЗаказНаСборку.Организация КАК Организация,
			|	ДокументЗаказНаСборку.Склад КАК Склад,
			|	ДокументЗаказНаСборку.ДокументОснование КАК ДокументОснование,
			|	ДокументЗаказНаСборку.Ответственный КАК Ответственный,
			|	ДокументЗаказНаСборку.Статус КАК Статус,
			|	ДокументЗаказНаСборку.Номенклатура КАК Номенклатура,
			|	ДокументЗаказНаСборку.Характеристика КАК Характеристика,
			|	ДокументЗаказНаСборку.Упаковка КАК Упаковка,
			|	ДокументЗаказНаСборку.КоличествоУпаковок КАК КоличествоУпаковок,
			|	ДокументЗаказНаСборку.Количество КАК Количество,
			|	ДокументЗаказНаСборку.Комментарий КАК Комментарий,
			|	ДокументЗаказНаСборку.НачалоСборкиРазборки КАК НачалоСборкиРазборки,
			|	ДокументЗаказНаСборку.ОкончаниеСборкиРазборки КАК ОкончаниеСборкиРазборки,
			|	ДокументЗаказНаСборку.ЖелаемаяДатаПоступления КАК ЖелаемаяДатаПоступления,
			|	ДокументЗаказНаСборку.ДлительностьСборкиРазборки КАК ДлительностьСборкиРазборки,
			|	ДокументЗаказНаСборку.МаксимальныйКодСтроки КАК МаксимальныйКодСтроки,
			|	ДокументЗаказНаСборку.ВариантКомплектации КАК ВариантКомплектации,
			|	ДокументЗаказНаСборку.Сделка КАК Сделка,
			|	ДокументЗаказНаСборку.Подразделение КАК Подразделение,
			|	ДокументЗаказНаСборку.СтатусУказанияСерий КАК СтатусУказанияСерий,
			|	ДокументЗаказНаСборку.Назначение КАК Назначение,
			|	ДокументЗаказНаСборку.НазначениеТовары КАК НазначениеТовары,
			|	ДокументЗаказНаСборку.Серия КАК Серия,
			|	ДокументЗаказНаСборку.ВариантОбеспечения КАК ВариантОбеспечения,
			|	ДокументЗаказНаСборку.КоличествоУпаковокОтменено КАК КоличествоУпаковокОтменено,
			|	ДокументЗаказНаСборку.КоличествоОтменено КАК КоличествоОтменено,
			|	ДокументЗаказНаСборку.НаправлениеДеятельности КАК НаправлениеДеятельности,
			|	ДокументЗаказНаСборку.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
			|	ДокументЗаказНаСборку.СборкаПодДеятельность КАК СборкаПодДеятельность,
			|	ДокументЗаказНаСборку.ОбосабливатьПоНазначениюЗаказа КАК ОбосабливатьПоНазначениюЗаказа,
			|	ДокументЗаказНаСборку.ВариантПриемкиТоваров КАК ВариантПриемкиТоваров,
			|	ДокументЗаказНаСборку.Товары.(
			|		Ссылка КАК Ссылка,
			|		НомерСтроки КАК НомерСтроки,
			|		Номенклатура КАК Номенклатура,
			|		Характеристика КАК Характеристика,
			|		Назначение КАК Назначение,
			|		Упаковка КАК Упаковка,
			|		Количество КАК Количество,
			|		КоличествоУпаковок КАК КоличествоУпаковок,
			|		КодСтроки КАК КодСтроки,
			|		СтатусУказанияСерий КАК СтатусУказанияСерий,
			|		УказыватьСерии КАК УказыватьСерии,
			|		ВариантОбеспечения КАК ВариантОбеспечения,
			|		Серия КАК Серия,
			|		Отменено КАК Отменено
			|	) КАК Товары,
			|	ДокументЗаказНаСборку.Серии.(
			|		Ссылка КАК Ссылка,
			|		НомерСтроки КАК НомерСтроки,
			|		Серия КАК Серия,
			|		Количество КАК Количество,
			|		Номенклатура КАК Номенклатура,
			|		Характеристика КАК Характеристика,
			|		Назначение КАК Назначение
			|	) КАК Серии,
			|	ДокументЗаказНаСборку.ДополнительныеРеквизиты.(
			|		Ссылка КАК Ссылка,
			|		НомерСтроки КАК НомерСтроки,
			|		Свойство КАК Свойство,
			|		Значение КАК Значение,
			|		ТекстоваяСтрока КАК ТекстоваяСтрока
			|	) КАК ДополнительныеРеквизиты,
			|	ДокументЗаказНаСборку.МоментВремени КАК МоментВремени
			|ИЗ
			|	Документ.ЗаказНаСборку КАК ДокументЗаказНаСборку
			|ГДЕ
			|	ДокументЗаказНаСборку.ДокументОснование.Партнер.ГруппаДоступа В(&ГруппаДоступа)
			|	И ДокументЗаказНаСборку.ДокументОснование.Партнер.ГруппаДоступа <> ЗНАЧЕНИЕ(Справочник.ГруппыДоступаПартнеров.ПустаяСсылка)";
			
			Если МассивОрганизаций.Количество() > 0 Тогда
				НовыйЗапрос.Текст = НовыйЗапрос.Текст + 
								"
								|   И ДокументЗаказНаСборку.ДокументОснование.Организация В (&Организация)"; 
			КонецЕсли;
				
			ЗаказНаСборкуСписок.ТекстЗапроса = НовыйЗапрос.Текст;
			ЗаказНаСборкуСписок.Параметры.УстановитьЗначениеПараметра("ГруппаДоступа",СписокГруппДоступа);
			Если МассивОрганизаций.Количество() > 0 Тогда
				ЗаказНаСборкуСписок.Параметры.УстановитьЗначениеПараметра("Организация",МассивОрганизаций);
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	


//**НОВОЕ

//+++ Ниронов Не найдено ссылок на данных процедуры **************************************

//&НаСервере
//Функция ПолучитьДатуОтгрузки(Номенклатура, Заказ)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ГрафикОтгрузкиТоваровОбороты.ДатаОтгрузки КАК ДатаОтгрузки
//	|ИЗ
//	|	РегистрНакопления.ГрафикОтгрузкиТоваров.Обороты КАК ГрафикОтгрузкиТоваровОбороты
//	|ГДЕ
//	|	ГрафикОтгрузкиТоваровОбороты.Номенклатура = &Номенклатура
//	|	И ГрафикОтгрузкиТоваровОбороты.Назначение.Заказ = &Заказ";
//	
//	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
//	Запрос.УстановитьПараметр("Заказ", Заказ);
//	
//	Результат = Запрос.Выполнить().Выгрузить();
//	
//	Если Результат.Количество() > 0 Тогда
//		Возврат Результат[0].ДатаОтгрузки;
//	Иначе
//		Возврат "";
//	КонецЕсли;
//	
//КонецФункции	

//&НаКлиенте
//Процедура ЗаказНаСборкуСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	
//	Если ТипЗнч(ВыбраннаяСтрока) <> Тип("ДокументСсылка.ЗаказНаСборку") Тогда
//		НомерДокумента = Элемент.ТекущиеДанные.Номер;
//		СсылкаДокСборки = НайтиСсылкуЗаказНаСборку(НомерДокумента);
//		ПоказатьЗначение(,СсылкаДокСборки);
//	Иначе
//		ПоказатьЗначение(,ВыбраннаяСтрока);		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РеализацияТоваровУслугСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	ПоказатьЗначение(,ВыбраннаяСтрока);
//КонецПроцедуры

//--- ****************************************************************************

&НаСервере
Функция НайтиСсылкуЗаказНаСборку(Номер)

	Запрос = Новый ЗАпрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказНаСборку.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказНаСборку КАК ЗаказНаСборку
	|ГДЕ
	|	ЗаказНаСборку.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номер", Номер);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат[0].Ссылка;
	
КонецФункции
	
//***************************	
	
#КонецОбласти



#Область РаботаСоСпискомЗаявокНаДоставку

&НаКлиенте
Процедура ЗаявкиНаДоставкуСписокПриАктивизацииСтроки(Элемент)
	
	Если (Элемент.ТекущиеДанные = Неопределено) Тогда
		АктивнаяЗаявкаНаДоставку = ПредопределенноеЗначение("Документ._ЗаявкаНаДоставку.ПустаяСсылка");
	Иначе	
		АктивнаяЗаявкаНаДоставку = Элемент.ТекущиеДанные.Ссылка;
	
		Если ( АктивнаяЗаявкаНаДоставку = ТекущаяЗаявкаНаДоставку ) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьЗаказыЗаявкиНаДоставку",0.2, Истина);	
	
	
	// Уберем этот онанизм
	
	//Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
	//	Заказ = Элемент.ТекущиеДанные.ДокументОснование; 
	//	ЗаявкаНаДоставку = Элемент.ТекущиеДанные.Ссылка;
	//	СтатусОрдер = "";	
	//	
	//	ЗаявкиНаДоставкуСписокПриАктивизацииСтрокиНаСервере(Заказ, ЗаявкаНаДоставку, СтатусОрдер);	
	//	
	//	Для Каждого Строка Из Элемент.ТекущиеДанные.Товары Цикл
	//		Попытка
	//			Строка.СтатусОрдер = СтатусОрдер;
	//		Исключение
	//		КонецПопытки;	
	//	КонецЦикла;	
	//КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьЗаказыЗаявкиНаДоставку()
	ТекущаяЗаявкаНаДоставку = АктивнаяЗаявкаНаДоставку;
	
	Элементы.ГруппаЗаказыЗаявки.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Заказы заявки: %1",АктивнаяЗаявкаНаДоставку);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗаявкиНаДоставку_Заказы, "ЗаявкаНаДоставку", АктивнаяЗаявкаНаДоставку, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗаявкиНаДоставку_Товары, "ЗаявкаНаДоставку", АктивнаяЗаявкаНаДоставку, Истина);
	
	ОтключитьОбработчикОжидания("Подключаемый_ОбновитьЗаказыЗаявкиНаДоставку");
КонецПроцедуры	



#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ОбновитьОтборыДинамическихСписков()
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗаявкиНаДоставку_Заказы, "ЗаявкаНаДоставку", АктивнаяЗаявкаНаДоставку, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗаявкиНаДоставку_Товары, "ЗаявкаНаДоставку", АктивнаяЗаявкаНаДоставку, Истина);
КонецПроцедуры	


#КонецОбласти

#Область ПодключаемыйСистемаНапоминаний

&НаКлиенте
Процедура ПодключаемыйСоздатьНапоминание(Команда)
	ОткрытьФорму("РегистрСведений.НапоминанияПользователя.Форма.Напоминание");
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйИзменитьНапоминание(Команда)
	ОткрытьФорму("РегистрСведений.НапоминанияПользователя.Форма.Напоминание", Новый Структура("Ключ", Элементы.СписокНапоминаний.ТекущаяСтрока));
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйУдалитьНапоминание(Команда)
	УдалитьНапоминаниеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНапоминаниеНаКлиенте()
	
	КнопкиДиалога = Новый СписокЗначений;
	КнопкиДиалога.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Удалить';
														|en = 'Delete'"));
	КнопкиДиалога.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Не удалять';
															|en = 'Do not delete'"));
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьНапоминаниеЗавершение", ЭтотОбъект);
	
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Удалить напоминание?';
											|en = 'Do you want to delete the reminder?'"), КнопкиДиалога);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНапоминаниеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	КлючЗаписи = Элементы.СписокНапоминаний.ТекущаяСтрока;
	ПараметрыНапоминания = Новый Структура("Пользователь,ВремяСобытия,Источник");
	ЗаполнитьЗначенияСвойств(ПараметрыНапоминания, Элементы.СписокНапоминаний.ТекущиеДанные);
	
	ПараметрыНапоминания.Пользователь = ПользователиКлиент.ТекущийПользователь();
	
	ОтключитьНапоминание(ПараметрыНапоминания);
	НапоминанияПользователяКлиент.УдалитьЗаписьИзКэшаОповещений(ПараметрыНапоминания);
	Оповестить("Запись_НапоминанияПользователя", Новый Структура, КлючЗаписи);
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.НапоминанияПользователя"));
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьНапоминание(ПараметрыНапоминания)
	НапоминанияПользователяСлужебный.ОтключитьНапоминание(ПараметрыНапоминания, Ложь);
КонецПроцедуры

//РИВ +++ 11.07.25
&НаКлиенте
Процедура СчетОферта(Команда)

	ЗаявкаСсылка = Элементы.ЗаказыКлиентов.ТекущиеДанные.Ссылка;
	Если ( ЗаявкаСсылка = Неопределено ) Тогда
		Возврат;
	КонецЕсли;
		
	ПараметрКоманды = Новый Массив;
	ПараметрКоманды.Добавить(ЗаявкаСсылка);
	
	СписокДокументов = Новый СписокЗначений;
	СписокДокументов.Добавить(ЗаявкаСсылка);
	
	ПараметрыПечати  = Новый Структура;
	ПараметрыПечати.Вставить("СписокДокументов"		,  ПоместитьВоВременноеХранилище(СписокДокументов));
	ПараметрыПечати.Вставить("КоличествоЭкземпляров",  1);
	ПараметрыПечати.Вставить("СтруктураМакетаШаблона", Неопределено);
	           
	           
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Обработка.ВПФ_Счет_оферта",
		"ПФ_MXL_СчетОферта",
		ПараметрКоманды,,
		ПараметрыПечати);
		
КонецПроцедуры
//РИВ --- 11.07.25

//РИВ +++ 14.10.25
&НаСервереБезКонтекста
Процедура РеализацияТоваровУслугСписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	//УчетОригиналовПервичныхДокументов.ПриПолученииДанныхНаСервере(Строки);
	РИВ_ПриПолученииДанныхНаСервере(Строки);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	//++ Локализация
	//СоответствиеТребованиямГИСМТ.ПриПолученииДанныхНаСервереДокумента(Строки);
	//-- Локализация
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РИВ_ПриПолученииДанныхНаСервере(СтрокиСписка) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетОригиналовПервичныхДокументов") = Ложь 
	Или Не ПравоДоступа("Чтение",Метаданные.РегистрыСведений.СостоянияОригиналовПервичныхДокументов) Тогда
		Возврат;
	КонецЕсли;
	
	Ссылки = Новый Массив;
	ИмяКлючевогоПоля = "Ссылка";
	 
	Для Каждого СтрокаСписка Из СтрокиСписка Цикл
		//СтрокаСписка = СтрокиСписка[СтрокаСписка.Значение];
		//СтрокаСписка = СтрокаСписка.Значение; 
		//Если Не СтрокаСписка.Данные.Свойство("Ссылка")
		//	Или (СтрокаСписка.Оформление.Получить("СостояниеОригиналаПервичногоДокумента") = Неопределено 
		//	И СтрокаСписка.Оформление.Получить("СостояниеОригиналПолучен") = Неопределено) Тогда
		//	Возврат;
		//КонецЕсли;
		//Ссылки.Добавить(СтрокаСписка.Данные[ИмяКлючевогоПоля]);
		Ссылки.Добавить(СтрокаСписка.Ключ);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СостоянияОригиналовПервичныхДокументов.Состояние КАК СостояниеОригиналаПервичногоДокумента,
	               |	СостоянияОригиналовПервичныхДокументов.ОбщееСостояние КАК ОбщееСостояние,
	               |	ВЫБОР
	               |		КОГДА СостоянияОригиналовПервичныхДокументов.Состояние = ЗНАЧЕНИЕ(Справочник.СостоянияОригиналовПервичныхДокументов.ОригиналПолучен)
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СостояниеОригиналПолучен,
	               |	СостоянияОригиналовПервичныхДокументов.Владелец КАК Ссылка
	               |ИЗ
	               |	РегистрСведений.СостоянияОригиналовПервичныхДокументов КАК СостоянияОригиналовПервичныхДокументов
	               |ГДЕ
	               |	СостоянияОригиналовПервичныхДокументов.ОбщееСостояние
	               |	И СостоянияОригиналовПервичныхДокументов.Владелец В(&Ссылка)"; 

	Запрос.УстановитьПараметр("Ссылка", Ссылки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не СтрокаСписка.Значение.Оформление.Получить("СостояниеОригиналаПервичногоДокумента") = Неопределено Тогда
		Для Каждого Строка Из СтрокиСписка Цикл
			СтрИнф = СтрокиСписка[Строка.Ключ];
			СтрСсылка = Строка.Ключ;
			Выборка.Сбросить();
			Если Выборка.НайтиСледующий(СтрСсылка, "Ссылка") Тогда 

				СтрИнф.Данные["СостояниеОригиналаПервичногоДокумента"] = Выборка.СостояниеОригиналаПервичногоДокумента;
				СтрИнф.Оформление["СостояниеОригиналаПервичногоДокумента"].УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ГиперссылкаЦвет); 
			Иначе
				СтрИнф.Данные["СостояниеОригиналаПервичногоДокумента"] = НСтр("ru = '<Неизвестно>'");
				СтрИнф.Оформление["СостояниеОригиналаПервичногоДокумента"].УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет); 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не СтрокаСписка.Значение.Оформление.Получить("СостояниеОригиналПолучен") = Неопределено Тогда
		Для Каждого Строка Из СтрокиСписка Цикл
			СтрИнф = СтрокиСписка[Строка.Ключ];
			СтрСсылка = Строка.Ключ;
			Выборка.Сбросить();
			Если Выборка.НайтиСледующий(СтрСсылка, "Ссылка") Тогда 
				СтрИнф.Данные["СостояниеОригиналПолучен"] = Выборка.СостояниеОригиналПолучен;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
//РИВ --- 14.10.25

//РИВ +++ 23.10.25
&НаКлиенте
Процедура ОтчетДоговорыБезОригиналов(Команда)
	
	УсловияОтбора = Новый Структура("Менеджер", ПолучитьПользователя());
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", УсловияОтбора, Истина);
	ОткрытьФорму("Отчет.ДоговорыБезОригиналов.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры   

&НаСервере
Функция ПолучитьПользователя()

	Возврат Пользователи.ТекущийПользователь();	

КонецФункции // ПолучитьПользователя()



//РИВ --- 23.10.25
#КонецОбласти