#Область ПеременныеМодуля

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

#КонецОбласти

#Область ПрограммныйИнтерфейс

&НаСервере
Процедура ОформлениеФормы()

	Если Объект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда
		ЭтаФорма.Элементы.ЗонаДоставки.Видимость = Ложь;
	Иначе
		ЭтаФорма.Элементы.ЗонаДоставки.Видимость = Истина;				
	КонецЕсли;	
	
	Если Объект.ВеземДокументы Тогда
		ЭтаФорма.Элементы.ОткрытьПоручениеЭкспедитору.Видимость		= Истина;

		Если ( ЗначениеЗаполнено( Объект.ПоручениеЭкспидитору ) )  Тогда
			ЭтаФорма.Элементы.ОткрытьПоручениеЭкспедитору.Доступность	= Истина;
			ЭтаФорма.Элементы.ВеземДокументы.Доступность = Ложь;
		КонецЕсли;
		
	Иначе	
		ЭтаФорма.Элементы.ОткрытьПоручениеЭкспедитору.Видимость		= Ложь;
		ЭтаФорма.Элементы.ОткрытьПоручениеЭкспедитору.Доступность	= Ложь;
		//ЭтаФорма.Элементы.ВеземДокументы.Доступность = Истина;
	КонецЕсли;
	
	Если ( Объект._ВидЗаявки = Перечисления._ВидыЗаявки.ОтПоставщика )	Тогда
		Элементы.ГруппаДоверенность.Видимость = Истина;
	Иначе
		Элементы.ГруппаДоверенность.Видимость = Ложь;
	КонецЕсли;	
	
	//Если ( Объект.Заказы.Количество() > 0 ) Тогда
	//	Элементы.СтраницаЗаказы.Видимость = Истина;
	//	Элементы.ДокументОснование.Видимость = Ложь;
	//Иначе	
	//	Элементы.СтраницаЗаказы.Видимость = Ложь;
	//	Элементы.ДокументОснование.Видимость = Истина;
	//КонецЕсли;
	
	УстановитьВидимостьКонтрагента();
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьВидимостьКонтрагента()
	
	Об = РеквизитФормыВЗначение("Объект");
	
	ВидимостьКонтрагента = НЕ Об.ОснованиеЗаказНаВнутреннееПотребление();
	
	Если Элементы.Найти("ГруппаКлиент") <> Неопределено Тогда
		Элементы.ГруппаКлиент.Видимость = ВидимостьКонтрагента;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	_ОбработкаДоставкиТоваровСервер.УстановитьСтраницуДоставки(Элементы, Объект);
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Статус = Перечисления._СтатусыЗаявокНаДоставку.КВыполнению;
	Иначе	
		Если ( Объект.ВеземДокументы ) И ( Объект.ПоручениеЭкспидитору = ПредопределенноеЗначение("Документ.ПоручениеЭкспедитору.ПустаяСсылка" )) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ПоручениеЭкспедитору.Ссылка КАК Ссылка
			               |ИЗ
			               |	Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
			               |ГДЕ
			               |	ПоручениеЭкспедитору._ЗаявкаНаДоставку = &_ЗаявкаНаДоставку";
			Запрос.УстановитьПараметр("_ЗаявкаНаДоставку", Объект.Ссылка );
			Результат = Запрос.Выполнить();
			Если НЕ ( Результат.Пустой() ) Тогда
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				Объект.ПоручениеЭкспидитору = Выборка.Ссылка;
			КонецЕсли;	
			
		КонецЕсли;	
	КонецЕсли; 
	
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяДоставкиС);
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяДоставкиПо);

	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
КонецПроцедуры	//ПриЧтенииСозданииНаСервере()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ( Объект.Ссылка.Пустая() ) И НЕ ( ЗначениеЗаполнено( Объект.ДокументОснование ) ) И ( Объект.Заказы.Количество() = 0 ) Тогда
		ВызватьИсключение НСтр("ru='Документ может быть создан только на основании заказа клиента или заказа поставщику.'");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	ИспользоватьНаправленияДеятельности = ПолучитьФункциональнуюОпцию("ИспользоватьУчетДоходовПоНаправлениямДеятельности");
	
	ПриЧтенииСозданииНаСервере();
	ОбновитьИнформациюОДоверенности();
	ОформлениеФормы();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюСервер()
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОтгрузки) Тогда
		Объект.ДатаОтгрузки = Объект.ЖелаемаяДатаОтгрузки;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюСервер()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи, ПараметрыПроведения)
	
	Если ( Объект.СпособДоставки <> ПредопределенноеЗначение("Перечисление.СпособыДоставки.Самовывоз" )  ) Тогда
		Если ПустаяСтрока(Объект.АдресДоставки)  Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru='Не заполнен адрес доставки'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;  
	КонецЕсли;	

	
	//++ Сухарев Б.В. 31.01.2019
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Если ( Объект._ВидЗаявки = ПредопределенноеЗначение("Перечисление._ВидыЗаявки.ДоКлиента" )) Тогда
			Для Каждого ТекЗаказ Из Объект.Заказы Цикл
				тЗаказ = ТекЗаказ.ЗаказКлиента;
				Если НЕ тЗаказ = _ДоработкиСлужебный.ПолучитьПустуюСсылку(ТипЗнч(Объект.ДокументОснование)) Тогда
					Парам  = Новый Структура("Ключ",тЗаказ);
					мФорма = ПолучитьФорму("Документ.ЗаказКлиента.ФормаОбъекта", Парам); 
					Попытка
						мФорма.Закрыть(0);
					Исключение
	//** 					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Заказ '") + ТекЗаказ + НСтр("ru=' открыт другим пользователем или фоновым заданием'"));
					КонецПопытки;
				КонецЕсли; 
			КонецЦикла;		// ТекЗаказ Из Заказы  
		КонецЕсли;	
	КонецЕсли;
	//== Сухарев Б.В
	
	Если НеВыполнятьПроверкуПередЗаписью Тогда
		НеВыполнятьПроверкуПередЗаписью = Ложь;
		Возврат;
	КонецЕсли;
	ПередЗаписьюСервер();
		

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ( Объект.ВеземДокументы ) И ( Объект.ПоручениеЭкспидитору = ПредопределенноеЗначение("Документ.ПоручениеЭкспедитору.ПустаяСсылка" )) Тогда
		НовыйПоручениеЭкспедитору = ОбновитьПоручение();
		НовыйПоручениеЭкспедитору._ЗаявкаНаДоставку = ТекущийОбъект.Ссылка;
		НовыйПоручениеЭкспедитору.Записать(РежимЗаписиДокумента.Проведение);
		
		ТекущийОбъект.ПоручениеЭкспидитору = НовыйПоручениеЭкспедитору.Ссылка;	
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОформлениеФормы();
	
	ВыбранныеЗаказы = Новый Структура();
	Для Каждого ТекЗаказ Из Объект.Заказы Цикл
		//**Изменено 20.09.19 Максимов
		//ВыбранныеЗаказы.Вставить(ТекЗаказ.НомерЗаказа, ТекЗаказ.ЗаказКлиента);
		
		Если ТипЗнч(ТекЗаказ.ЗаказКлиента) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда 
			//ВыбранныеЗаказы.Вставить(ТекЗаказ.НомерЗаказа, ТекЗаказ.ЗаказКлиента);  
			ЗаписатьИнфоВЗаказПоставщику();
		Иначе	
			Если Лев(ТекЗаказ.НомерЗаказа, 1) = "К" ИЛИ Лев(ТекЗаказ.НомерЗаказа, 1) = "И" Тогда
				ВыбранныеЗаказы.Вставить(ТекЗаказ.НомерЗаказа, ТекЗаказ.ЗаказКлиента);
			Иначе	
				ВыбранныеЗаказы.Вставить("С" + ТекЗаказ.НомерЗаказа, ТекЗаказ.ЗаказКлиента);		
			КонецЕсли;		
		КонецЕсли;		
		//****************************
	КонецЦикла;
	ПараметрыЗаписи.Вставить("ВыбранныеЗаказы", ВыбранныеЗаказы);
	ПараметрыЗаписи.Вставить("Объект", Объект);
	Оповестить("Запись_ЗаказаНаОтгрузку", ПараметрыЗаписи, Объект.Ссылка);

КонецПроцедуры  

&НаСервере
Процедура ЗаписатьИнфоВЗаказПоставщику() 
	
	ТаблЗаказов = Объект.Заказы.Выгрузить();
	ТаблЗаказов.Свернуть("ЗаказКлиента");
	
	Для Каждого ТекЗаказ Из ТаблЗаказов Цикл
		ЗаказПостОбъект = ТекЗаказ.ЗаказКлиента.ПолучитьОбъект();
		ЗаказПостОбъект.СпособДоставки = Объект.Ссылка.СпособДоставки;
		ЗаказПостОбъект.АдресДоставки  = Объект.Ссылка.АдресДоставки;
		ЗаказПостОбъект.АдресДоставкиЗначенияПолей = Объект.Ссылка.АдресДоставкиЗначенияПолей;
		ЗаказПостОбъект.ДополнительнаяИнформацияПоДоставке = Объект.Ссылка.ДополнительнаяИнформацияПоДоставке;
		Если НачалоДня(ЗаказПостОбъект.ЖелаемаяДатаПоступления) <> НачалоДня(Объект.Ссылка.ЖелаемаяДатаОтгрузки) Тогда
			ЗаказПостОбъект.ЖелаемаяДатаПоступления = Объект.Ссылка.ЖелаемаяДатаОтгрузки;
		КонецЕсли; 
		
		Если НачалоДня(ЗаказПостОбъект.ДатаПоступления) <> НачалоДня(Объект.Ссылка.ЖелаемаяДатаОтгрузки) И ЗаказПостОбъект.ПоступлениеОднойДатой Тогда
			ЗаказПостОбъект.ДатаПоступления = Объект.Ссылка.ЖелаемаяДатаОтгрузки;
		КонецЕсли; 
		Для Каждого Стр ИЗ ЗаказПостОбъект.Товары Цикл
			Стр.ДатаПоступления = Объект.Ссылка.ЖелаемаяДатаОтгрузки;
		КонецЦикла;

		ЗаказПостОбъект.Записать(РежимЗаписиДокумента.Проведение); 
	КонецЦикла;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура СпособДоставкиПриИзменении(Элемент)
	Если Объект.Проведен Тогда
		Сообщить("Для внесения изменений отмените проведение документа");
		Возврат;
	КонецЕсли;
	
	СпособДоставкиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОсобыеУсловияПеревозкиПриИзменении(Элемент)
	Если Объект.Проведен Тогда
		Сообщить("Для внесения изменений отмените проведение документа");
		Возврат;
	КонецЕсли;
	ОсобыеУсловияПеревозкиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Сообщить("Вы не можете изменить ""Клиента""");
		Возврат;
	ИначеЕсли Объект.Товары.Количество() > 0 Тогда
		Сообщить("Вы не можете изменить ""Клиента""");
		Возврат;
	КонецЕсли; 
	ПриИзмененииПартнераСервер();
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИмяРеквизитаАдресаДоставки = ДоставкаТоваровКлиентСервер.ИменаРеквизитовАдресовДоставки(Элемент.Имя);
	ДоставкаТоваровКлиент.ОткрытьФормуВыбораАдресаИОбработатьРезультат(
	    Элемент,
		Объект,
		ИмяРеквизитаАдресаДоставки,
		СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	АдресДоставкиПриИзменении(Элемент);
	
	ДоставкаТоваровКлиент.АдресДоставкиОбработкаВыбора(Элементы, Объект, Элемент.Имя, ВыбранноеЗначение);
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиПриИзменении(Элемент)
	
	Если Объект.Проведен Тогда
		Сообщить("Для внесения изменений отмените проведение документа");
		Возврат;
	КонецЕсли;
	
	ИменаРеквизитовАдресовДоставки = ДоставкаТоваровКлиентСервер.ИменаРеквизитовАдресовДоставки(Элемент.Имя);
	
	ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(
	    Элемент,
		Объект[ИменаРеквизитовАдресовДоставки.ИмяРеквизитаАдресаДоставки],
		Объект[ИменаРеквизитовАдресовДоставки.ИмяРеквизитаАдресаДоставкиЗначенияПолей]);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИмяРеквизитаАдресаДоставки(Элемент)
	
	Если СтрНайти(Элемент.Имя, "АдресДоставкиПеревозчика") > 0 Тогда
		ИмяРеквизитаАдреса = "АдресДоставкиПеревозчика";
	Иначе
		ИмяРеквизитаАдреса = "АдресДоставки";
	КонецЕсли;
	
	Возврат ИмяРеквизитаАдреса;
	
КонецФункции

&НаКлиенте
Процедура АдресДоставкиОчистка(Элемент, СтандартнаяОбработка)
	
	АдресДоставкиПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоПриИзменении(Элемент)
	
	Если Объект.КонтактноеЛицо.Пустая() Тогда
		Возврат;
	ИначеЕсли Не Объект.Партнер.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ПартнерИзменился = Ложь;
	КонтактноеЛицоПриИзмененииСервер(ПартнерИзменился);
	
	Если Не ПартнерИзменился Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеДеятельностиПриИзменении(Элемент)
	НаправлениеДеятельностиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗонаДоставкиПриИзменении(Элемент)
	Если Объект.Проведен Тогда
		Сообщить("Для внесения изменений отмените проведение документа");
		Возврат;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительнаяИнформацияПриИзменении(Элемент)
	Если Объект.Проведен Тогда
		Сообщить("Для внесения изменений отмените проведение документа");
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОсобыеУсловияПеревозкиОписаниеПриИзменении(Элемент)
	Если Объект.Проведен Тогда
		Сообщить("Для внесения изменений отмените проведение документа");
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВремяДоставкиСПриИзменении(Элемент)
	Если Объект.Проведен Тогда
		Сообщить("Для внесения изменений отмените проведение документа");
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВремяДоставкиПоПриИзменении(Элемент)
	Если Объект.Проведен Тогда
		Сообщить("Для внесения изменений отмените проведение документа");
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекДанн = Элемент.ТекущиеДанные; 
	
	Если  (Поле.Имя = "ЗаказыЗаказКлиента" ) ИЛИ
		  (Поле.Имя = "ЗаказыНомерЗаказа"  ) ИЛИ
		  (Поле.Имя = "ЗаказыДатаЗаказа"   ) Тогда
		  
		Если ТекДанн <> Неопределено Тогда
			ОбъектСсылка = ТекДанн.ЗаказКлиента;
			ПоказатьЗначение(,ОбъектСсылка); 
		КонецЕсли;
		
	ИначеЕсли  (Поле.Имя = "ЗаказыНужныДокументы" )Тогда
		
		Если ТекДанн <> Неопределено Тогда
			ТекДанн.НужныДокументы = ?(ТекДанн.НужныДокументы, Ложь, Истина);
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗаказыОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПередУдалением(Элемент, Отказ)
	Если Объект.Проведен Тогда
		Сообщить("Для внесения изменений отмените проведение документа");
		Возврат;
	КонецЕсли;
	Если ( ЗначениеЗаполнено(Объект.ДокументОснование) ) И ( Элемент.ТекущиеДанные.ЗаказКлиента = Объект.ДокументОснование  ) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ПриОбработкеУдаленияЕаСервере(Элемент.ТекущиеДанные.ЗаказКлиента, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ДатаДоставкиПриИзменении(Элемент)
	Если Объект.Проведен Тогда
		Сообщить("Для внесения изменений отмените проведение документа");
		Возврат;
	КонецЕсли;
	ДатаДоставкиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВеземДокументыПриИзменении(Элемент) 
	Если Объект.ВеземДокументы Тогда
		Объект.СпособДоставки	= ПоручениеЭкспедиторуСоСклада();
		СпособДоставкиПриИзмененииНаСервере();
	Иначе	
		Объект.СпособДоставки	= ПолучитьДоставкудоКлиента();
		СпособДоставкиПриИзмененииНаСервере();
	КонецЕсли;

	ОбработкаВеземДокументыСервер();	
	ОформлениеФормы();
КонецПроцедуры

&НаКлиенте
Процедура ТекстДоверенностьНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ( ДоверенностьВыданная = ПредопределенноеЗначение("Документ.ДоверенностьВыданная.ПустаяСсылка") ) Тогда
		Если ( Объект.Ссылка.Пустая() ) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запишите документ");
			Возврат;
		КонецЕсли;	
		
		ДоверенностьВыданная = СоздатьДоверенностьНаСервере();
		ТекстДоверенность = Строка( ДоверенностьВыданная );
	Иначе
		ПараметрыФормы = Новый Структура("Ключ", ДоверенностьВыданная);
		ОткрытьФорму("Документ.ДоверенностьВыданная.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;	
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДополнитьИнформациюПоДоставкеКонтактами(Команда)
	ДополнитьИнформациюПоДоставкеКонтактамиСервер();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьЗаказ(Команда)
	
	Если Объект.Проведен Тогда
		Сообщить("Для внесения изменений отмените проведение документа");
		Возврат;
	КонецЕсли;
	
	ВыполнятьОтбор = ЗначениеЗаполнено(Объект.Партнер);
	Если ВыполнятьОтбор Тогда
		ПараметрыОтбора = Новый Структура("Партнер, Закрыт", Объект.Партнер, Ложь);		
		ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор, Отбор", Истина, Ложь, ПараметрыОтбора);
	Иначе
		ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор, Отбор", Истина, Ложь);
	КонецЕсли;     
	
	ОповещениеОВыборе = Новый ОписаниеОповещения("ВыборДополнительногоЗаказа",ЭтотОбъект);
	
	Если ( Объект._ВидЗаявки = ПредопределенноеЗначение("Перечисление._ВидыЗаявки.ДоКлиента" )) Тогда
		ОткрытьФорму("Документ.ЗаказКлиента.ФормаВыбора", ПараметрыПодбора,  ЭтаФорма,,,,ОповещениеОВыборе); 
	Иначе
		ОткрытьФорму("Документ.ЗаказПоставщику.ФормаВыбора", ПараметрыПодбора,  ЭтаФорма,,,,ОповещениеОВыборе); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДополнительногоЗаказа( Результат, ДопПараметры ) Экспорт
	Если ( Результат = Неопределено ) Тогда
		Возврат;
	КонецЕсли;	
	
	Если ( Объект.ДокументОснование = Результат ) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбранный заказ является документом-основанием заявки");
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаДобавленияТоваров", ЭтотОбъект, Новый Структура("Заказ",Результат));	
 
    ПоказатьВопрос(Оповещение,"Добавить товары из выбранного заказа?",
        РежимДиалогаВопрос.ДаНетОтмена,0,КодВозвратаДиалога.Да);   
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗакрытияВопросаДобавленияТоваров(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;	
	
    Если Результат = КодВозвратаДиалога.Да Тогда
       ДобавитьВыбранныйЗаказНаСервере( ДопПараметры.Заказ, Истина ); 
   	Иначе
	   ДобавитьВыбранныйЗаказНаСервере( ДопПараметры.Заказ, Ложь );
    КонецЕсли;	
 
КонецПроцедуры


&НаКлиенте
Процедура СоздатьРасходныйОрдерНаТовары(Команда)
	Если Объект.Заказы.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Нет заказв к отгрузке.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;  
	
	МассивСсылок = Новый Массив;
	Для Каждого ТекЗаказ Из Объект.Заказы Цикл
		МассивСсылок.Добавить(ТекЗаказ.ЗаказКлиента);
	КонецЦикла;		
	_ОбработкаДоставкиТоваровКлиент.СоздатьРасходныйОрдерНаТоварыПоДоставке(МассивСсылок, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйРасходныйОрдерНаТовары(Команда)
	Если Объект.Заказы.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Нет заказв к отгрузке.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;  
	
	МассивСсылок = Новый Массив;
	Для Каждого ТекЗаказ Из Объект.Заказы Цикл
		МассивСсылок.Добавить(ТекЗаказ.ЗаказКлиента);
	КонецЦикла;		
	_ОбработкаДоставкиТоваровКлиент.СоздатьРасходныйОрдерНаТоварыПоДоставке(МассивСсылок, Объект.Ссылка, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдресДаставки(Команда)
	ЗаполнитьАдресДаставкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПоручениеЭкспедитору(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПоручениеЭкспидитору) Тогда
		Возврат;
	КонецЕсли;
	
    Парам = Новый Структура;
    Парам.Вставить("Ключ", Объект.ПоручениеЭкспидитору);

    ОткрытьФорму("Документ.ПоручениеЭкспедитору.ФормаОбъекта", Парам);
	
КонецПроцедуры




#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьВыбранныйЗаказНаСервере( СсылкаЗаказа , ДобавлятьТовары ) 
		
	Объект.НужныДокументы	= Истина;

	НоваяСтрока = Объект.Заказы.Добавить();
	НоваяСтрока.НомерЗаказа		= СсылкаЗаказа.Номер;
	НоваяСтрока.ДатаЗаказа      = СсылкаЗаказа.Дата;
	НоваяСтрока.ЗаказКлиента    = СсылкаЗаказа;
	НоваяСтрока.НужныДокументы  = Истина;
	
	ЭтаФорма.Модифицированность = Истина;
	
	Если НЕ ( ДобавлятьТовары ) Тогда
		Возврат;
	КонецЕсли;	
	
	Об = РеквизитФормыВЗначение("Объект");
	Если ( ТипЗнч( СсылкаЗаказа ) = Тип("ДокументСсылка.ЗаказКлиента") ) Тогда
		Об.ЗаполнитьТЧТовары(СсылкаЗаказа);
	Иначе
		Об.ЗаполнитьТЧПоЗаказуПоставщика(СсылкаЗаказа);
	КонецЕсли;	
	
	ЗначениеВРеквизитФормы(Об,"Объект");
	
КонецПроцедуры	

&НаСервере
Процедура ОбработкаВеземДокументыСервер()
	 ДокументОбъект = РеквизитФормыВЗначение("Объект");
	 ДокументОбъект.ОбработкаВеземДокументыМодуль();
	 ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры	// ()

&НаСервере
Функция ПолучитьДоставкудоКлиента()
	Возврат Перечисления.СпособыДоставки.ДоКлиента;
КонецФункции // ПолучитьДоставкудоКлиента()

&НаСервере
Функция ПолучитьСамовывоз()
	Возврат Перечисления.СпособыДоставки.Самовывоз;
КонецФункции // ПолучитьСамовывоз()

&НаСервере
Функция ПоручениеЭкспедиторуСоСклада()
	Возврат Перечисления.СпособыДоставки.ПоручениеЭкспедиторуСоСклада;
КонецФункции // ПоручениеЭкспедиторуСоСклада()

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыПоНоменклатуре()
	Для Каждого ТекСтрока Из Объект.Товары Цикл
		Если ( ТекСтрока.Артикул <> ТекСтрока.Номенклатура.Артикул ) Тогда
			ТекСтрока.Артикул = ТекСтрока.Номенклатура.Артикул;
			ЭтаФорма.Модифицированность = Истина;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СпособДоставкиПриИзмененииНаСервере()
	
	//**ДОБАВЛЕНО Максимов В.А.
	
	Если Объект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда
		ЭтаФорма.Элементы.ЗонаДоставки.Видимость = Ложь;
	Иначе
		ЭтаФорма.Элементы.ЗонаДоставки.Видимость = Истина;		
	КонецЕсли;	
	
	//*************************
	
	_ОбработкаДоставкиТоваровСервер.УстановитьСтраницуДоставки(Элементы, Объект);
КонецПроцедуры

&НаСервере
Процедура ОсобыеУсловияПеревозкиПриИзмененииНаСервере()
	_ОбработкаДоставкиТоваровСервер.УстановитьСтраницуДоставки(Элементы, Объект);
КонецПроцедуры

&НаСервере
Процедура ДополнитьИнформациюПоДоставкеКонтактамиСервер()
	ДоставкаТоваров.ДополнитьИнформациюПоДоставкеКонтактами(Объект);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПартнераСервер()
	
	_ОбработкаДоставкиТоваровСервер.ЗаявкаОчиститьРеквизитыДоставки(Элементы, Объект);
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Партнер, Объект.Контрагент,  Истина);
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		_ОбработкаДоставкиТоваровСервер.ЗаполнитьПодчиненныеСвойстваПартнера( Объект);
	КонецЕсли; 
	
	НаправленияДеятельностиКэшированныеЗначения = Новый Структура("ИспользоватьНаправленияДеятельности, 
																																							| ИспользоватьОбособленноеОбеспечениеЗаказов,
																																							| НазначениеПоУмолчанию", ИспользоватьНаправленияДеятельности, Истина, Неопределено);
	Если ИспользоватьНаправленияДеятельности Тогда
		НаправленияДеятельностиСервер.ЗаполнитьНаправлениеПоУмолчанию(Объект.НаправлениеДеятельности, Объект.Соглашение, Объект.Договор);
	КонецЕсли;
	ИзмененныеСтроки = НаправленияДеятельностиСервер.ПриИзмененииНаправленияДеятельности(ЭтотОбъект);
	ЗакупкиСервер.ОчиститьРеквизитыСписанияНаРасходыПриУстановкеНазначенияВТабличнойЧасти(ИзмененныеСтроки);
	
	ЗаполнитьАдресДаставкиНаСервере();
	ПартнерыИКонтрагенты.ЗаполнитьКонтактноеЛицоПартнераПоУмолчанию(Объект.Партнер, Объект.КонтактноеЛицо);
	
КонецПроцедуры	//ПриИзмененииПартнераСервер()()
 
&НаСервере
Процедура КонтактноеЛицоПриИзмененииСервер(ПартнерИзменился)
	
	ВладелецКонтактногоЛица = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.КонтактноеЛицо, "Владелец");
	Если ВладелецКонтактногоЛица <> Объект.Партнер Тогда
		Объект.Партнер = ВладелецКонтактногоЛица;
		ПриИзмененииПартнераСервер();
		ПартнерИзменился = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		
		ЗаполнитьДоговорПоУмолчанию();
		
		Если ИспользоватьНаправленияДеятельности Тогда
			НаправленияДеятельностиСервер.ЗаполнитьНаправлениеПоУмолчанию(Объект.НаправлениеДеятельности, Объект.Соглашение, Объект.Договор);
		КонецЕсли;
		
	КонецЕсли;
	
	//** НаправленияДеятельностиСервер.ПриИзмененииНаправленияДеятельностиСервер(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура НаправлениеДеятельностиПриИзмененииНаСервере()
	ИзмененныеСтроки = НаправленияДеятельностиСервер.ПриИзмененииНаправленияДеятельности(ЭтотОбъект);
	ЗакупкиСервер.ОчиститьРеквизитыСписанияНаРасходыПриУстановкеНазначенияВТабличнойЧасти(ИзмененныеСтроки);
КонецПроцедуры

&НаСервере
Процедура  ЗаполнитьДоговорПоУмолчанию()
	
КонецПроцедуры	// ЗаполнитьДоговорПоУмолчанию()

&НаСервере
Функция ДобавитьТовары(ВыбранныйЗаказ)
	
	ПроверкаЗаполненостиТЧТовары = Ложь;
	СтароеКолСтрок 	 = Объект.Товары.Количество();
	СтароеКоличество = Объект.Товары.Итог("Количество");
	ДокументОбъект	 = РеквизитФормыВЗначение("Объект"); 
	Выборка			 = ДокументОбъект.ПолучитьЗаказ(ВыбранныйЗаказ,Объект.Дата);
	
	Для Каждого ТекСтрока Из ВыбранныйЗаказ.Товары Цикл
		Отбор = Новый Структура("КодСтроки, Номенклатура", ТекСтрока.НомерСтроки, ТекСтрока.Номенклатура);
		МассивНайденныхСтрок = Выборка.НайтиСтроки(Отбор);
		Если МассивНайденныхСтрок.Количество() > 0 Тогда
			НайденнаяСтрока = МассивНайденныхСтрок[0];
			//ОстатокПоЗаказу = ДокументОбъект.ОстаткиПоЗаказу(ВыбранныйЗаказ, ТекСтрока, Объект.Дата);
			ОстатокПоЗаказу = НайденнаяСтрока.ОстатокПоЗаказу;
			ОстатокНаСкладе = ДокументОбъект.ПроверкаКоличестваНаСкладе(ТекСтрока, Объект.Дата);
			Если ОстатокНаСкладе > 0 Тогда
				Если ОстатокПоЗаказу > ОстатокНаСкладе Тогда
					КолВОтгрузку = ОстатокНаСкладе;
				Иначе
					КолВОтгрузку = ОстатокПоЗаказу;
				КонецЕсли;
			Иначе
				КолВОтгрузку = 0
			КонецЕсли;		//ОстатокНаСкладе > 0 
			
			Если Не КолВОтгрузку = 0 Тогда
				
				Если Объект.Товары.НайтиСтроки( Новый Структура("Номенклатура, Характеристика, Серия",ТекСтрока.Номенклатура, ТекСтрока.Характеристика, ТекСтрока.Серия ) ).Количество() = 0 Тогда
					НоваяСтрока	= Объект.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
					НоваяСтрока.Артикул = ТекСтрока.Номенклатура.Артикул;
					Если НоваяСтрока.Количество > КолВОтгрузку Тогда
						НоваяСтрока.Количество = КолВОтгрузку;
						Если ТекСтрока.Упаковка.Числитель = 0 Тогда
							Числитель = 1;
						Иначе
							Числитель = ТекСтрока.Упаковка.Числитель;
						КонецЕсли;
						НоваяСтрока.КоличествоУпаковок = КолВОтгрузку / Числитель;
					КонецЕсли;		//НоваяСтрока.Количество > КолВОтгрузку
				Иначе			// Объект.Товары.НайтиСтроки
					НоваяСтрока	= Объект.Товары.НайтиСтроки( Новый Структура("Номенклатура, Характеристика, Серия",ТекСтрока.Номенклатура, ТекСтрока.Характеристика, ТекСтрока.Серия )  )[0];
					Если НоваяСтрока.Количество + ТекСтрока.Количество > КолВОтгрузку Тогда
						ТекущийОстаток = НоваяСтрока.Количество + ( КолВОтгрузку - ТекСтрока.Количество);
						НоваяСтрока.Количество = ТекущийОстаток;
						Если ТекСтрока.Упаковка.Числитель = 0 Тогда
							Числитель = 1;
						Иначе
							Числитель = ТекСтрока.Упаковка.Числитель;
						КонецЕсли;
						НоваяСтрока.КоличествоУпаковок = ТекущийОстаток / Числитель;	//**  НоваяСтрока.КоличествоУпаковок + ТекущийОстаток / Числитель;
					Иначе			//НоваяСтрока.Количество + ТекСтрока.Количество
						НоваяСтрока.Количество = НоваяСтрока.Количество + ТекСтрока.Количество;
  						НоваяСтрока.КоличествоУпаковок = НоваяСтрока.КоличествоУпаковок + ТекСтрока.КоличествоУпаковок;
					КонецЕсли;		//НоваяСтрока.Количество + ТекСтрока.Количество
				КонецЕсли;		//Объект.Товары.НайтиСтроки
			КонецЕсли;		//Не КолВОтгрузку = 0 		 
		КонецЕсли;		//МассивНайденныхСтрок.Количество() > 0
	КонецЦикла;
	
	Если (НЕ Объект.Товары.Количество() = СтароеКолСтрок) ИЛИ
		 (НЕ Объект.Товары.Итог("Количество") = СтароеКоличество) Тогда
		ПроверкаЗаполненостиТЧТовары = Истина;
	КонецЕсли;
	Возврат ПроверкаЗаполненостиТЧТовары;
	
КонецФункции //ДобавитьТовары(ВыбранноеЗначение)()

&НаСервере
Процедура ЗаказыОбработкаВыбораНаСервере(ВыбранноеЗначение )
	
	Если ( НЕ  ЗначениеЗаполнено(Объект.Партнер) ) И ( Объект.Заказы.Количество() = 0 ) Тогда
		Объект.Партнер = ВыбранноеЗначение.Партнер;
		ПриИзмененииПартнераСервер();
	КонецЕсли;
	
	Если Объект.Заказы.НайтиСтроки(Новый Структура("ЗаказКлиента", ВыбранноеЗначение.Ссылка)).Количество() = 0 Тогда
		ПроверкаЗаполненостиТЧТовары = ДобавитьТовары(ВыбранноеЗначение);;
		Если ПроверкаЗаполненостиТЧТовары Тогда
			
			Объект.НужныДокументы	= Истина;

			НоваяСтрока					= Объект.Заказы.Добавить();
			НоваяСтрока.НомерЗаказа		= ВыбранноеЗначение.Номер;
			НоваяСтрока.ДатаЗаказа		= ВыбранноеЗначение.Дата;
			НоваяСтрока.ЗаказКлиента	= ВыбранноеЗначение.Ссылка;
			НоваяСтрока.НужныДокументы	= Истина;
			ДобавитьТовары(ВыбранноеЗначение);	
		КонецЕсли;		//ПроверкаЗаполненостиТЧТовары 		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриОбработкеУдаленияЕаСервере(ТекущийЗаказКлиента, Отказ);
	
	Если НЕ Отказ Тогда
		Для Каждого ТекСтрока Из ТекущийЗаказКлиента.Товары Цикл
			Если НЕ Объект.Товары.НайтиСтроки( Новый Структура("Номенклатура, Характеристика, Серия",ТекСтрока.Номенклатура, ТекСтрока.Характеристика, ТекСтрока.Серия )  ).Количество() = 0 Тогда
				УдаляемыеСтроки	= Объект.Товары.НайтиСтроки( Новый Структура("Номенклатура, Характеристика, Серия",ТекСтрока.Номенклатура, ТекСтрока.Характеристика, ТекСтрока.Серия )  );
				Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
					Если ( УдаляемаяСтрока.Количество  = ТекСтрока.Количество ) И (УдаляемаяСтрока.КоличествоУпаковок  = ТекСтрока.КоличествоУпаковок ) Тогда
						Объект.Товары.Удалить(УдаляемаяСтрока);
					Иначе
						УдаляемаяСтрока.Количество = УдаляемаяСтрока.Количество - ТекСтрока.Количество;
						УдаляемаяСтрока.КоличествоУпаковок = УдаляемаяСтрока.Количество;
					КонецЕсли; 
				КонецЦикла;
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры	//ПриобработкеУдаленияЕаСервере(Элемент.ТекущиеДанные.ЗаказКлиента);()

&НаСервере
Процедура ДатаДоставкиПриИзмененииНаСервере()
	Объект.ДатаОтгрузки = Объект.ЖелаемаяДатаОтгрузки;
	Для Каждого ТекСтрока Из Объект.Товары Цикл
		ТекСтрока.ДатаОтгрузки = Объект.ЖелаемаяДатаОтгрузки;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАдресДаставкиНаСервере() 
	
	Об = РеквизитФормыВЗначение("Объект");
	
	Если Об.ОснованиеЗаказНаВнутреннееПотребление() Тогда
		ВладелецАдреса = Объект.Организация;
		ВидФактическийАдрес = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;
		ВидЮридическийАдрес = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;
	Иначе
		Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
			ВладелецАдреса = Объект.Контрагент;
			ВидФактическийАдрес = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
			ВидЮридическийАдрес = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
		Иначе
			ВладелецАдреса = Объект.Партнер;
			ВидФактическийАдрес = Справочники.ВидыКонтактнойИнформации.АдресПартнера;
			ВидЮридическийАдрес = Справочники.ВидыКонтактнойИнформации.АдресПартнера;
		КонецЕсли;
	КонецЕсли;
	
	ФактическийАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
			ВладелецАдреса,
			ВидФактическийАдрес,
			ТекущаяДатаСеанса());
			
	ЮридическийАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
			ВладелецАдреса,
			ВидЮридическийАдрес,
			ТекущаяДатаСеанса());
			
			
	Если ЗначениеЗаполнено(ФактическийАдрес) Тогда
		Элементы.АдресДоставки.СписокВыбора.Добавить(ФактическийАдрес);
		Объект.АдресДоставки = ФактическийАдрес;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЮридическийАдрес) Тогда
		Элементы.АдресДоставки.СписокВыбора.Добавить(ЮридическийАдрес);
		 Если НЕ  ЗначениеЗаполнено(ФактическийАдрес) Тогда
			Объект.АдресДоставки = ЮридическийАдрес;
		 КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьРасходныйОрдерНаТоварыНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Функция ОбновитьПоручение()
	
	Если НЕ ( ЗначениеЗаполнено( Объект.ПоручениеЭкспидитору ) ) Тогда
		НовыйПоручениеЭкспедитору				= Документы.ПоручениеЭкспедитору.СоздатьДокумент(); 
	Иначе
		НовыйПоручениеЭкспедитору				= Объект.ПоручениеЭкспидитору;
		НовыйПоручениеЭкспедитору				= НовыйПоручениеЭкспедитору.ПолучитьОбъект();
		НовыйПоручениеЭкспедитору.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли; 	
						
	НовыйПоручениеЭкспедитору.Дата				= Объект.ЖелаемаяДатаОтгрузки;	//ТекущаяДата();
	НовыйПоручениеЭкспедитору.ДатаВыполнения	= Объект.ЖелаемаяДатаОтгрузки;
	
	
	НовыйПоручениеЭкспедитору.Склад				= Объект.Склад;
	НовыйПоручениеЭкспедитору.Пункт				= Объект.Партнер;
	НовыйПоручениеЭкспедитору.ЗонаДоставки		= Объект.ЗонаДоставки;
	НовыйПоручениеЭкспедитору.АдресДоставки		= Объект.АдресДоставки;
	НовыйПоручениеЭкспедитору.ВремяДоставкиС	= Объект.ВремяДоставкиС;
	НовыйПоручениеЭкспедитору.ВремяДоставкиПо	= Объект.ВремяДоставкиПо;
	НовыйПоручениеЭкспедитору.КонтактноеЛицо	= Объект.КонтактноеЛицо;
	НовыйПоручениеЭкспедитору.Ответственный		= Объект.Автор;
	НовыйПоручениеЭкспедитору.СпособДоставки	= Объект.СпособДоставки;						// Перечисления.СпособыДоставки.ПоручениеЭкспедиторуСоСклада;
	СтрокаЗаказа								= "Заказ клиента №" + Объект.ДокументОснование.Номер + " от " +  Объект.ДокументОснование.Дата + "  " + СокрЛП(Объект.ДокументОснование.Партнер.НаименованиеПолное);
	НовыйПоручениеЭкспедитору.ДополнительнаяИнформацияПоДоставке = СокрЛП(Объект.ДополнительнаяИнформацияПоДоставке);
	НовыйПоручениеЭкспедитору.ОсобыеУсловияПеревозкиОписание	 = "Доставка документов. " + 
																	СтрокаЗаказа + 
//																	СокрЛП(ЭтотОбъект.ДокументОснование.ДополнительнаяИнформацияПоДоставке) + 
																	?(Объект.ОсобыеУсловияПеревозки, Символы.ПС + СокрЛП(Объект.ОсобыеУсловияПеревозкиОписание), "");
	
	Возврат НовыйПоручениеЭкспедитору;
	
КонецФункции // НовоеПоручение()

&НаСервере
Процедура ОбновитьИнформациюОДоверенности()
	Если ( Объект.Ссылка.Пустая() ) Тогда 
		ЭтаФорма.ТекстДоверенность = "Для создания доверенности запишите документ";
		Возврат;
	КонецЕсли;	
	
	Если НЕ ( Объект._ВидЗаявки = Перечисления._ВидыЗаявки.ОтПоставщика )	Тогда
		ЭтаФорма.ТекстДоверенность = "Доверенность создается если вид заявки - от поставщика ";
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоверенностьВыданная.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ДоверенностьВыданная КАК ДоверенностьВыданная
	               |ГДЕ
	               |	ДоверенностьВыданная._ЗаявкаНаДоставку = &_ЗаявкаНаДоставку"; 
	Запрос.УстановитьПараметр("_ЗаявкаНаДоставку", Объект.Ссылка );
	Результат = Запрос.Выполнить();
	Если НЕ ( Результат.Пустой() ) Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЭтаФорма.ТекстДоверенность = Строка( Выборка.Ссылка );
		ЭтаФорма.ДоверенностьВыданная = Выборка.Ссылка;  
	Иначе
		ЭтаФорма.ТекстДоверенность = "Ввести доверенность";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьДоверенностьНаСервере()
	НовДок = Документы.ДоверенностьВыданная.СоздатьДокумент();
	НовДок.ЗаполнитьПоЗаявкеНаДоставку( Объект.Ссылка ); 
	НовДок.Дата = ТекущаяДатаСеанса();
	НовДок._ЗаявкаНаДоставку = Объект.Ссылка;
	НовДок.Статус = Перечисления.СтатусыДоверенностей.НеВыдана;//Перечисления.СтатусыДоверенностей.Выдана; //РИВ  
	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(НовДок);    
	НовДок.Товары.Очистить();
	Для Каждого Стр ИЗ Объект.Ссылка.Товары Цикл
		НовСтр = НовДок.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	КонецЦикла;
	
	
	НовДок.Записать(РежимЗаписиДокумента.Запись);
	Возврат НовДок.Ссылка;
КонецФункции	

&НаКлиентеНаСервереБезКонтекста
Функция ЗависимыеРеквизиты()
	
	Возврат Новый Структура(
		"Отменено",
		"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Форма)
	
	СтруктураПересчетаСуммы = Новый Структура;
	СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Истина);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	//СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ЭтаФорма);
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

КонецПроцедуры

&НаСервере
Процедура НужныДокументыПриИзмененииНаСервере()
	// Вставить содержимое обработчика.  
	
	Для каждого Стр Из Объект.Заказы Цикл
	   Стр.НужныДокументы = Объект.НужныДокументы;
    КонецЦикла;
   
КонецПроцедуры

&НаКлиенте
Процедура НужныДокументыПриИзменении(Элемент)
	НужныДокументыПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти





