
#Область СлужебныеПроцедурыИФункции

Функция СообщениеОПредназначенииКомандыСоздатьНаОсновании(ТипыОбъектовСоздатьНаОсновании) Экспорт
	ТекстСообщения = НСтр("ru = 'Выбранная команда создания на основании предназначена для объектов'") 
		+ ?(ТипыОбъектовСоздатьНаОсновании.Количество() = 1, " ", ": " + Символы.ПС);
	Для Каждого Тип Из ТипыОбъектовСоздатьНаОсновании Цикл
		МетаТип = Метаданные.НайтиПоТипу(Тип);
		ТекстСообщения = ТекстСообщения + " - " +  ?(ЗначениеЗаполнено(МетаТип.ПредставлениеСписка),МетаТип.ПредставлениеСписка, МетаТип.Синоним) +";"+ Символы.ПС;
	КонецЦикла;
	
	Если СтрЗаканчиваетсяНа(ТекстСообщения,";"+ Символы.ПС) Тогда
		ТекстСообщения = Лев(ТекстСообщения, СтрДлина(ТекстСообщения)-2) + ".";
	КонецЕсли;
	
	Возврат СокрЛП(ТекстСообщения);
КонецФункции

Функция ДоступноПравоПроведения(СписокДокументов) Экспорт
	//** 
	//Возврат ВводНаОсновании.ДоступноПравоПроведения(СписокДокументов);
	Возврат Неопределено;
	//** 
КонецФункции

//***********************************************************************
//ИЗМЕНЕНО Сухарев Б.В. 03.08.2018
Процедура ПроверкаВводвЗаявкиДоставкиСервер(ЗаказКлиента) Экспорт
	_ОбработкаДоставкиТоваровСервер.ПроверитьВозможностьВводаЗаявкиНаДоставку(ЗаказКлиента);
КонецПроцедуры	//ПроверкаВводвЗаявкиДоставкиСервер()

//***********************************************************************


#КонецОбласти
