
&После("ПриНачалеРаботыСистемы")
Процедура Расш1_ПриНачалеРаботыСистемы()
	
	ПодключитьОбработчикОжидания("Компит_ВыводсообщенийПользователю", 10*60, Ложь); //10*60
	//+++ Ниронов
	//Если _РаботаСИнтерфейсомСервер.ИспользоватьСообщенияПользователям() Тогда
	//	_РаботаСИнтерфейсомКлиент.ВыводСообщенийПользователю();
	//КонецЕсли;
	//--- *****************
	
	
	//**ИЗМЕНЕНО Максимов
	_РаботаСИнтерфейсомСервер.МинимальныйИнтерфейс();
    ОбновитьИнтерфейс();
	//*******************

КонецПроцедуры


#Область СистемаОповещенийПользователя

Процедура Компит_ВыводсообщенийПользователю() Экспорт
	Если _РаботаСИнтерфейсомСервер.ИспользоватьСообщенияПользователям() Тогда
		_РаботаСИнтерфейсомКлиент.ВыводСообщенийПользователю();
	КонецЕсли;
КонецПроцедуры	// Компит_ВыводсообщенийПользователю()


#КонецОбласти
