
&После("УстановкаПараметровСеанса")
Процедура Кт_УстановкаПараметровСеанса(ИменаПараметровСеанса)
	Если РольДоступна("Кт_РабочийСтол") Тогда    
		
		НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;
		СоставФорм = Новый СоставФормНачальнойСтраницы;
		НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
	    // Кладем объект настроек текущему пользователю.
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы",,НастройкиНачальнойСтраницы); 
		
		///****
		
		НастройкиИнтерфейса = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
		НастройкиСостава = НастройкиИнтерфейса.ПолучитьСостав();
		
		// Очистить настройки состава.
		НастройкиСостава.Верх.Очистить();
		НастройкиСостава.Лево.Очистить();
		НастройкиСостава.Низ.Очистить();
		НастройкиСостава.Право.Очистить();
		
		//Добавить снизу панель открытых
		НастройкиСостава.Низ.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых"));
		
		// Загрузить настройки состава в пустой объект настроек.
		НастройкиИнтерфейса.УстановитьСостав(НастройкиСостава);
		
		// Положить объект настроек текущему пользователю в хранилище.
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", , НастройкиИнтерфейса);
	КонецЕсли; 

КонецПроцедуры
