
&НаКлиенте
Процедура Кт_СписокПриАктивизацииСтрокиПосле(Элемент)
	
	//**Изменено 07.10.19 Максимов
	ПолучитьДанныеПоТоварамЗаказаКлиента(Элемент.ТекущиеДанные.Ссылка);
	ОбновитьДанныеТаблицыТоваровЗаказаНаСервере(Элемент.ТекущиеДанные.Ссылка);
	//****************************
	
КонецПроцедуры

//**Изменено 07.10.19 Максимов
#Область ВспомогательныеФункциии

&НаСервере
Процедура ОбновитьДанныеТаблицыТоваровЗаказаНаСервере(СсылкаНаДокумент)

	ДанныеЗаполнения = ПолучитьДанныеПоТоварамЗаказаКлиента(СсылкаНаДокумент);
	
	//ЗаказыКлиентовТовары = РеквизитФормыВЗначение("ЗаказыКлиентовТовары");
	
	ЭтотОбъект.ЗаказыКлиентовТовары.Очистить(); // очистим таблицу перед заполнением                     
	
	
	// Заполним данные по товарам заказа клиента
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") И НЕ ДанныеЗаполнения.Количество() = 0 Тогда
		
		
		Для Каждого СтрокаДанных Из ДанныеЗаполнения Цикл
			
			// Данные не соответствуют ожидаемым
			Если НЕ ТипЗнч(СтрокаДанных) = Тип("Структура") Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДанныхПоТоварамЗаказаКлиента = ЭтотОбъект.ЗаказыКлиентовТовары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДанныхПоТоварамЗаказаКлиента, СтрокаДанных);
			
			//Если СтрокаДанных.Комплектующая И НЕ ЭтаФорма.Элементы.ЗаказыКлиентовТовары.ТекущийЭлемент = Неопределено Тогда
			//	ЭтаФорма.Элементы.ЗаказыКлиентовТовары.ЦветФона = Новый Цвет(205,255,200);
			//КонецЕсли;
			//
		КонецЦикла;
		
	КонецЕсли;
	//ЗначениеВРеквизитФормы(ЗаказыКлиентовТовары,"ЗаказыКлиентовТовары");
КонецПроцедуры

Функция ПолучитьДанныеПоТоварамЗаказаКлиента(СсылкаНаДокумент)

	МассивРезультатаЗапроса = Новый Массив;
	
	// Проверка типа
	Если НЕ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Возврат МассивРезультатаЗапроса;
	КонецЕсли;
	
	// Проверка на пустую ссылку
	Если СсылкаНаДокумент.Пустая() Тогда
		Возврат МассивРезультатаЗапроса;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ЗаказПоставщику.Ссылка КАК Ссылка
					|ИЗ
					|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
					|ГДЕ
					|	ЗаказПоставщику.ДокументОснование = &ДокументОснование
					|	И ЗаказПоставщику.ПометкаУдаления = ЛОЖЬ
					|	И ЗаказПоставщику.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("ДокументОснование", СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборПоОснованию = Истина;
	Иначе
		ВыборПоОснованию = Ложь;
	КонецЕсли;
	
	// данные периода в запрос, от начала дня даты заказа до тек. даты
	ЗапросОтгрузки = Новый Запрос;
	ЗапросОтгрузки.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                       |	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	                       |	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	                       |	МАКСИМУМ(ЗаказКлиентаТовары.ДатаОтгрузки) КАК ДатаОтгрузки
	                       |ИЗ
	                       |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	                       |ГДЕ
	                       |	ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
	                       |
	                       |СГРУППИРОВАТЬ ПО
	                       |	ЗаказКлиентаТовары.Номенклатура,
	                       |	ЗаказКлиентаТовары.Характеристика";
	
	ЗапросОтгрузки.УстановитьПараметр("ЗаказКлиента", СсылкаНаДокумент);
	
	ДатаОтгрузки = ЗапросОтгрузки.Выполнить().Выгрузить()[0].ДатаОтгрузки;
	КонецПериода = ?(ЗначениеЗаполнено(СсылкаНаДокумент.ДатаОтгрузки), СсылкаНаДокумент.ДатаОтгрузки, ТекущаяДата()); 
	КонецПериода = ?(КонецПериода >= ДатаОтгрузки, КонецПериода, ДатаОтгрузки);
	КонецПериода = ?(КонецПериода >= ТекущаяДата(), КонецПериода, ТекущаяДата());
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиентаСсылка,
	               |	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
	               |	ВЫБОР
	               |		КОГДА ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	               |			ТОГДА ЗаказКлиентаТовары.Ссылка.Склад
	               |		ИНАЧЕ ЗаказКлиентаТовары.Склад
	               |	КОНЕЦ КАК Склад,
	               |	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	               |	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	               |	ЗаказКлиентаТовары.Количество КАК Количество,
	               |	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ЗаказКлиентаТовары.Упаковка КАК Упаковка,
	               |	ЗаказКлиентаТовары.Цена КАК Цена,
	               |	ЗаказКлиентаТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	               |	ЗаказКлиентаТовары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	               |	ЗаказКлиентаТовары.Сумма КАК Сумма,
	               |	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	               |	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
	               |	ЗаказКлиентаТовары.СуммаСНДС КАК СуммаСНДС
	               |ПОМЕСТИТЬ ВТ_ДанныеТабличнойЧасти
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |ГДЕ
	               |	ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ЗаказКлиентаТовары.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказКлиентаТовары.ЗаказКлиентаСсылка КАК ЗаказКлиентаСсылка,
	               |	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
	               |	ЗаказКлиентаТовары.Склад КАК Склад,
	               |	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	               |	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	               |	ЗаказКлиентаТовары.Количество КАК Количество,
	               |	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ЗаказКлиентаТовары.Упаковка КАК Упаковка,
	               |	ЗаказКлиентаТовары.Цена КАК Цена,
	               |	ЗаказКлиентаТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	               |	ЗаказКлиентаТовары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	               |	ЗаказКлиентаТовары.Сумма КАК Сумма,
	               |	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	               |	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
	               |	ЗаказКлиентаТовары.СуммаСНДС КАК СуммаСНДС,
	               |	0 КАК КоличествоВНаличииПодЗаказ,
	               |	0 КАК КоличествоВНаличииНаСкладе,
	               |	0 КАК КоличествоНаСкладе,
	               |	0 КАК КоличествоКОтгрузке,
	               |	0 КАК КоличествоОтгружено,
	               |	0 КАК КоличествоЗаказано
	               |ИЗ
	               |	ВТ_ДанныеТабличнойЧасти КАК ЗаказКлиентаТовары
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗаказКлиентаТовары.НомерСтроки";
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ЗаказКлиента",  СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат МассивРезультатаЗапроса;
	КонецЕсли;
	
	// результат запроса
	ТаблицаДокумента  = РезультатЗапроса.Выгрузить();
	ТаблицаДокумента.Колонки.Добавить("Комплектующая", Новый ОписаниеТипов("Булево"));
	
	ТаблицаДокумента  = ОбработатьКомплекты(ТаблицаДокумента);
	
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();
	ТаблицаРезультата.Колонки.Добавить("Комплектующая", Новый ОписаниеТипов("Булево"));
	ТаблицаРезультата = ОбработатьКомплекты(ТаблицаРезультата);
	
	ТаблицаРезультата.Свернуть("ЗаказКлиентаСсылка, Номенклатура, Склад, СтавкаНДС, Упаковка, Цена, 
							   |ПроцентАвтоматическойСкидки, ПроцентРучнойСкидки, Комплектующая  
							   |",
							   "Количество, КоличествоУпаковок, Сумма, СуммаНДС, СуммаСНДС,
	                           |КоличествоВНаличииНаСкладе, КоличествоВНаличииПодЗаказ, КоличествоЗаказано, КоличествоКОтгрузке, 
							   |КоличествоНаСкладе, КоличествоОтгружено
							   |");
	
	// Наименования ключей структуры из имен колонок
	ПоляСтруктурыРезультата = "";
	Для Каждого КолонкаТаблицы Из ТаблицаДокумента.Колонки Цикл
		ПоляСтруктурыРезультата = ПоляСтруктурыРезультата + "," + КолонкаТаблицы.Имя;
	КонецЦикла;
	
	ПоляСтруктурыРезультата = Прав(ПоляСтруктурыРезультата, СтрДлина(ПоляСтруктурыРезультата) - 1); // уберем первую запятайку
	
	// Заполним массив необходимыми данными, а все потому, что на клиента нельзя передать таб. значений
	Для Каждого СтрокаДанных Из ТаблицаРезультата Цикл
		СтруктураРезультата = Новый Структура(ПоляСтруктурыРезультата);
		ЗаполнитьЗначенияСвойств(СтруктураРезультата, СтрокаДанных);
		
		МассивСтрок = ТаблицаДокумента.НайтиСтроки(Новый Структура("ЗаказКлиентаСсылка, Номенклатура, Цена ", СтруктураРезультата.ЗаказКлиентаСсылка, СтруктураРезультата.Номенклатура, СтруктураРезультата.Цена));
		Если НЕ МассивСтрок.Количество() = 0 Тогда
			СтруктураРезультата.НомерСтроки = МассивСтрок[0].НомерСтроки;
		Иначе
			СтруктураРезультата.НомерСтроки = 0;
		КонецЕсли;
		
		ПараметраЗаказа = Новый Структура("СтруктураРезультата, КонецПериода, ЗаказКлиента",СтруктураРезультата, КонецПериода, СсылкаНаДокумент);
		
		СтруктураРезультата.КоличествоЗаказано			= ЗаказаноПоставщику(ПараметраЗаказа);
		
		МассивКолЗаказа  = СтруктураРезультата.ЗаказКлиентаСсылка.Товары.НайтиСтроки(Новый Структура("Номенклатура", СтруктураРезультата.Номенклатура));
		КолЗаказа = 0;
		Для Каждого ТекЗнач Из МассивКолЗаказа Цикл
			КолЗаказа = КолЗаказа + ТекЗнач.КоличествоУпаковок;
		КонецЦикла;		// ТекЗнач Из 
		
		Если СтрокаДанных.Комплектующая Тогда
			КолЗаказа = СтрокаДанных.КоличествоУпаковок;
		КонецЕсли;
		СтруктураРезультата.КоличествоУпаковок			= КолЗаказа;
		СтруктураРезультата.Количество					= КолЗаказа;
		
		СтруктураОстатков = ОстаткиНаСкладе(ПараметраЗаказа);
		СтруктураРезультата.КоличествоВНаличииПодЗаказ	= СтруктураОстатков.ВНаличииПодЗаказ;
		СтруктураРезультата.КоличествоВНаличииНаСкладе	= СтруктураОстатков.ВНаличииНаСкладе;
		СтруктураРезультата.КоличествоНаСкладе			= СтруктураОстатков.ВНаличииНаСкладе + СтруктураОстатков.ВНаличииПодЗаказ;
		
		Если НЕ СтрокаДанных.Комплектующая Тогда
			СтруктураОтгрузки = ДанныеПоОтгрузке(ПараметраЗаказа);
			СтруктураРезультата.КоличествоКОтгрузке			= СтруктураОтгрузки.КОтгрузке;
			СтруктураРезультата.КоличествоОтгружено			= СтруктураОтгрузки.Отгружено;
		КонецЕсли;
		
		МассивРезультатаЗапроса.Добавить(СтруктураРезультата);
	КонецЦикла;
	
	Возврат МассивРезультатаЗапроса;

КонецФункции

&НаСервереБезКонтекста
Функция ОбработатьКомплекты(ТаблицаОбработки)
	
	Для Каждого ТекСтрока Из ТаблицаОбработки Цикл
		Если ТекСтрока.Номенклатура.ВидНоменклатуры.Наименование = "Комплекты" Тогда
			Если  ТекСтрока.НомерСтроки = Неопределено Тогда
				НомерСтроки = ТекСтрока.НомерСтроки;
				ТЗКомплекта = _ОбработкаЗакупкиСервер.ПолучитьНоборКомплекта(ТекСтрока.Номенклатура, ТекСтрока.Характеристика);
				Если ТЗКомплекта.Количество() > 0 Тогда
					ДоляСтоимости = ТЗКомплекта.Итог("ДоляСтоимости");
					Если ДоляСтоимости = 0 Тогда
						ДоляСтоимости = 1;
					КонецЕсли;
					к = 0;
					Для Каждого СтрКомплекта Из ТЗКомплекта Цикл
						к = к + 1;
						НоваяСтрока = ТаблицаОбработки.Вставить(НомерСтроки + к);
//						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока,"ЗаказКлиентаСсылка, Склад, СтавкаНДС, ПроцентАвтоматическойСкидки, ПроцентРучнойСкидки");
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока,"ЗаказКлиентаСсылка, Склад");
						НоваяСтрока.Номенклатура					= СтрКомплекта.Номенклатура;
						НоваяСтрока.Характеристика					= СтрКомплекта.Характеристика;
						НоваяСтрока.Количество						= СтрКомплекта.Количество * ТекСтрока.Количество;
						НоваяСтрока.КоличествоУпаковок				= СтрКомплекта.КоличествоУпаковок * ТекСтрока.КоличествоУпаковок;
						НоваяСтрока.Упаковка						= СтрКомплекта.Упаковка;
//						НоваяСтрока.Цена							= ТекСтрока.Цена / ДоляСтоимости * СтрКомплекта.ДоляСтоимости;
						НоваяСтрока.Комплектующая					= Истина;
					
					КонецЦикла;		// СтрКомплекта Из ТЗКомплекта
				КонецЕсли;
			Иначе	
				НомерСтроки = ТекСтрока.НомерСтроки - 1;
				ТЗКомплекта = _ОбработкаЗакупкиСервер.ПолучитьНоборКомплекта(ТекСтрока.Номенклатура, ТекСтрока.Характеристика);
				Если ТЗКомплекта.Количество() > 0 Тогда
					ДоляСтоимости = ТЗКомплекта.Итог("ДоляСтоимости");
					Если ДоляСтоимости = 0 Тогда
						ДоляСтоимости = 1;
					КонецЕсли;
					к = 0;
					Для Каждого СтрКомплекта Из ТЗКомплекта Цикл
						к = к + 1;
						НоваяСтрока = ТаблицаОбработки.Вставить(НомерСтроки + к);
	//					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока,"ЗаказКлиентаСсылка, Склад, СтавкаНДС, ПроцентАвтоматическойСкидки, ПроцентРучнойСкидки");
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока,"ЗаказКлиентаСсылка, Склад");
						НоваяСтрока.Номенклатура					= СтрКомплекта.Номенклатура;
						НоваяСтрока.Характеристика					= СтрКомплекта.Характеристика;
						НоваяСтрока.Количество						= СтрКомплекта.Количество * ТекСтрока.Количество;
						НоваяСтрока.КоличествоУпаковок				= СтрКомплекта.КоличествоУпаковок * ТекСтрока.КоличествоУпаковок;
						НоваяСтрока.Упаковка						= СтрКомплекта.Упаковка;
	//					НоваяСтрока.Цена							= ТекСтрока.Цена / ДоляСтоимости * СтрКомплекта.ДоляСтоимости;
						НоваяСтрока.Комплектующая					= Истина;
						
					КонецЦикла;		// СтрКомплекта Из ТЗКомплекта
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;		// ТекСтрока Из ТаблицаДокумента
	
	Возврат ТаблицаОбработки;
	
КонецФункции // ОбработатьКомплекты()

&НаСервереБезКонтекста
Функция ЗаказаноПоставщику(ПараметраЗаказа)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗапасыИПотребности.Номенклатура КАК Номенклатура,
	|	ЗапасыИПотребности.Характеристика КАК Характеристика,
	|	ЗапасыИПотребности.Склад КАК Склад,
	|	СУММА(ЗапасыИПотребности.Заказано) КАК Заказано
	|ИЗ
	|	РегистрНакопления.ЗапасыИПотребности КАК ЗапасыИПотребности
	|ГДЕ
	|	ЗапасыИПотребности.Номенклатура = &Номенклатура
	|	И ЗапасыИПотребности.Характеристика = &Характеристика
	|	И ЗапасыИПотребности.Назначение.Заказ = &ЗаказКлиента
	|	И ЗапасыИПотребности.Склад = &Склад
	|	И ЗапасыИПотребности.ВидДвижения = &ВидДвижения
	|	И ТИПЗНАЧЕНИЯ(ЗапасыИПотребности.Регистратор) = ТИП(Документ.ЗаказПоставщику)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыИПотребности.Номенклатура,
	|	ЗапасыИПотребности.Характеристика,
	|	ЗапасыИПотребности.Склад";
	
	Запрос.УстановитьПараметр("Номенклатура",   ПараметраЗаказа.СтруктураРезультата.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", ?(ПараметраЗаказа.СтруктураРезультата.Характеристика = Неопределено, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), ПараметраЗаказа.СтруктураРезультата.Характеристика));
	Запрос.УстановитьПараметр("ЗаказКлиента",   ПараметраЗаказа.ЗаказКлиента);
	Запрос.УстановитьПараметр("Склад",          ПараметраЗаказа.ЗаказКлиента.Склад);
	Запрос.УстановитьПараметр("ВидДвижения",    ВидДвиженияНакопления.Приход);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда
		Возврат 0;
	Иначе
		Возврат Результат[0].Заказано;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОстаткиНаСкладе(ПараметраЗаказа)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеПоОстаткуНаСкладе.Номенклатура КАК Номенклатура,
	               |	ДанныеПоОстаткуНаСкладе.Характеристика КАК Характеристика,
	               |	ДанныеПоОстаткуНаСкладе.Склад КАК Склад,
	               |	СУММА(ДанныеПоОстаткуНаСкладе.ВНаличииПодЗаказ) КАК ВНаличииПодЗаказ,
	               |	СУММА(ДанныеПоОстаткуНаСкладе.ВНаличииНаСкладе) КАК ВНаличииНаСкладе
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТоварыНаСкладахОстаткиИОбороты.Номенклатура КАК Номенклатура,
	               |		ТоварыНаСкладахОстаткиИОбороты.Характеристика КАК Характеристика,
	               |		ТоварыНаСкладахОстаткиИОбороты.Назначение КАК Назначение,
	               |		ТоварыНаСкладахОстаткиИОбороты.Склад КАК Склад,
	               |		ТоварыНаСкладахОстаткиИОбороты.ВНаличииКонечныйОстаток КАК ВНаличииПодЗаказ,
	               |		0 КАК ВНаличииНаСкладе
	               |	ИЗ
	               |		РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	               |				&НачалоПериода,
	               |				&КонецПериода,
	               |				Период,
	               |				ДвиженияИГраницыПериода,
	               |				Номенклатура = &Номенклатура
	               |					И Характеристика = &Характеристика
	               |					И Назначение.Заказ = &ЗаказКлиента) КАК ТоварыНаСкладахОстаткиИОбороты
	               |	
	               |	ОБЪЕДИНИТЬ
	               |	
	               |	ВЫБРАТЬ
	               |		ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	               |		ТоварыНаСкладахОстаткиИОбороты.Характеристика,
	               |		ТоварыНаСкладахОстаткиИОбороты.Назначение,
	               |		ТоварыНаСкладахОстаткиИОбороты.Склад,
	               |		0,
	               |		ТоварыНаСкладахОстаткиИОбороты.ВНаличииКонечныйОстаток
	               |	ИЗ
	               |		РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	               |				&НачалоПериода,
	               |				&КонецПериода,
	               |				Период,
	               |				ДвиженияИГраницыПериода,
	               |				Номенклатура = &Номенклатура
	               |					И Характеристика = &Характеристика
	               |					И Склад = &Склад
				   |					И Назначение = &Назначение) КАК ТоварыНаСкладахОстаткиИОбороты) КАК ДанныеПоОстаткуНаСкладе
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДанныеПоОстаткуНаСкладе.Номенклатура,
	               |	ДанныеПоОстаткуНаСкладе.Характеристика,
	               |	ДанныеПоОстаткуНаСкладе.Склад
				   |";

	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПараметраЗаказа.ЗаказКлиента.Дата));
	Запрос.УстановитьПараметр("КонецПериода",   КонецДня(ПараметраЗаказа.КонецПериода + 60*60*24*181));
	Запрос.УстановитьПараметр("Номенклатура",   ПараметраЗаказа.СтруктураРезультата.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", ?(ПараметраЗаказа.СтруктураРезультата.Характеристика = Неопределено, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), ПараметраЗаказа.СтруктураРезультата.Характеристика));
	Запрос.УстановитьПараметр("ЗаказКлиента",   ПараметраЗаказа.ЗаказКлиента);
	Запрос.УстановитьПараметр("Склад",   ПараметраЗаказа.СтруктураРезультата.Склад);
	Запрос.УстановитьПараметр("Назначение",   Справочники.Назначения.ПустаяСсылка());
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СтруктураВозврата =  Новый Структура("ВНаличииПодЗаказ, ВНаличииНаСкладе", 0, 0);
	
	Если Результат.Количество() = 0 Тогда
		Возврат СтруктураВозврата;
	Иначе
		СтруктураВозврата.ВНаличииПодЗаказ = Результат[0].ВНаличииПодЗаказ;
		СтруктураВозврата.ВНаличииНаСкладе = Результат[0].ВНаличииНаСкладе;
		Возврат СтруктураВозврата;
	КонецЕсли;
	
КонецФункции // ОстаткиНаСкладе()

&НаСервереБезКонтекста
Функция ДанныеПоОтгрузке(ПараметраЗаказа)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыКОтгрузкеОстаткиИОбороты.Склад КАК Склад,
	               |	ТоварыКОтгрузкеОстаткиИОбороты.Номенклатура КАК Номенклатура,
	               |	ТоварыКОтгрузкеОстаткиИОбороты.Характеристика КАК Характеристика,
	               |	ТоварыКОтгрузкеОстаткиИОбороты.Назначение.Заказ КАК ЗаказКлиентаСсылка,
	               |	ТоварыКОтгрузкеОстаткиИОбороты.КОтгрузкеКонечныйОстаток КАК КОтгрузке,
	               |	ТоварыКОтгрузкеОстаткиИОбороты.КОтгрузкеРасход КАК Отгружено
	               |ИЗ
	               |	РегистрНакопления.ТоварыКОтгрузке.ОстаткиИОбороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Период,
	               |			ДвиженияИГраницыПериода,
	               |			Номенклатура = &Номенклатура
	               |				И Характеристика = &Характеристика
	               |				И Назначение.Заказ = &ЗаказКлиента) КАК ТоварыКОтгрузкеОстаткиИОбороты
				   |";

	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПараметраЗаказа.ЗаказКлиента.Дата));
	Запрос.УстановитьПараметр("КонецПериода",   КонецДня(ПараметраЗаказа.КонецПериода + 60*60*24*181));
	Запрос.УстановитьПараметр("Номенклатура",   ПараметраЗаказа.СтруктураРезультата.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", ?(ПараметраЗаказа.СтруктураРезультата.Характеристика = Неопределено, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), ПараметраЗаказа.СтруктураРезультата.Характеристика));
	Запрос.УстановитьПараметр("ЗаказКлиента",   ПараметраЗаказа.ЗаказКлиента);
	Запрос.УстановитьПараметр("Склад",   ПараметраЗаказа.СтруктураРезультата.Склад);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СтруктураВозврата =  Новый Структура("КОтгрузке, Отгружено", 0, 0);
	
	Если Результат.Количество() = 0 Тогда
		Возврат СтруктураВозврата;
	Иначе
		СтруктураВозврата.КОтгрузке = Результат[0].КОтгрузке;
		СтруктураВозврата.Отгружено = Результат[0].Отгружено;
		Возврат СтруктураВозврата;
	КонецЕсли;
	
КонецФункции // ДанныеПоОтгрузке()

#КонецОбласти
//****************************