
&ИзменениеИКонтроль("ОткрытьФормуВыбораАдресаИОбработатьРезультат")
Процедура Кт_ОткрытьФормуВыбораАдресаИОбработатьРезультат(Элемент, Объект, ИменаРеквизитовАдресовДоставки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	АдресПредставление = Объект[ИменаРеквизитовАдресовДоставки.ИмяРеквизитаАдресаДоставки]; // Строка
	АдресЗначенияПолей = Объект[ИменаРеквизитовАдресовДоставки.ИмяРеквизитаАдресаДоставкиЗначенияПолей]; // Строка
	АдресЗначение = Объект[ИменаРеквизитовАдресовДоставки.ИмяРеквизитаАдресаДоставкиЗначение];
	
	Если НЕ ЗначенияПолейАдресаДоставкиВалидны(АдресЗначенияПолей) Тогда
		
		АдресЗначенияПолей = "";
		АдресЗначение = "";
		ОбщегоНазначенияУТВызовСервера.ЗаполнитьЗначенияПолейКИПоПредставлению(АдресПредставление, АдресЗначенияПолей);
		
	КонецЕсли;
	
	ПриИзмененииПредставленияАдреса(Элемент, АдресПредставление, АдресЗначенияПолей, Ложь);
	
	// Откроем диалог редактирования КИ
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВидКонтактнойИнформации", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресПартнера"));
	ПараметрыОткрытия.Вставить("ЗначенияПолей",           ДоставкаТоваровКлиентСервер.ПреобразоватьСтрокуВСписокПолей(АдресЗначенияПолей));
	ПараметрыОткрытия.Вставить("Значение",                АдресЗначение);
	ПараметрыОткрытия.Вставить("Представление",           АдресПредставление);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект",						Объект);
	ДополнительныеПараметры.Вставить("ИмяРеквизитаАдресаДоставки", 	ИменаРеквизитовАдресовДоставки.ИмяРеквизитаАдресаДоставки);
	ДополнительныеПараметры.Вставить("Элемент", 					Элемент);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуВыбораАдресаИОбработатьРезультатЗавершение", 
		ДоставкаТоваровКлиент, ДополнительныеПараметры);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыОткрытия,,Оповещение);
		
КонецПроцедуры
