
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда



#Область ОсновныеПроцедурыИФункции

Процедура УстановитьКлючОбработкиЗаказа( ЗаявкаНаДоставку ) Экспорт
	МенеджерЗаписи = РегистрыСведений.Кт_ОбработкаЗаявкиНаДоставку.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заявка   				= ЗаявкаНаДоставку; 
	МенеджерЗаписи.ОбработкаЗаказаКлиента 	= Истина; 
	МенеджерЗаписи.Записать();    
КонецПроцедуры	

Функция ПолучитьКлючОбработкиЗаказа( ЗаявкаНаДоставку ) Экспорт
	Если ( ЗаявкаНаДоставку.Дата < Дата("20230504") ) Тогда
		Возврат ЗаявкаНаДоставку.ОбработкаЗаказаКлиента;
	КонецЕсли;	
	
    МенеджерЗаписи = РегистрыСведений.Кт_ОбработкаЗаявкиНаДоставку.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заявка   	= ЗаявкаНаДоставку;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат МенеджерЗаписи.ОбработкаЗаказаКлиента;
	КонецЕсли;   	
	Возврат Ложь;
КонецФункции	

Процедура УдалитьКлючОбработкиЗаказа( ЗаявкаНаДоставку ) Экспорт 
	НаборЗаписей = РегистрыСведений.Кт_ОбработкаЗаявкиНаДоставку.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(ЗаявкаНаДоставку);
	НаборЗаписей.Записать();
КонецПроцедуры

#КонецОбласти


#КонецЕсли