
//++ Сухарев Б.В. 28.08.2019
&НаКлиенте
Процедура ОткрытьЗаявкуНаДоставку(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект._ЗаявкаНаДоставку) Тогда
		Возврат;
	КонецЕсли;
	
	Парам = Новый Структура;
	Парам.Вставить("Ключ", Объект._ЗаявкаНаДоставку);
	
	ОткрытьФорму("Документ._ЗаявкаНаДоставку..ФормаОбъекта", Парам);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНомерЗаявкиНаДоставку()
	
	Возврат Объект._ЗаявкаНаДоставку.Номер + " от " + Формат(Объект._ЗаявкаНаДоставку.Дата, "ДЛФ=Д");
	
КонецФункции // ПолучитьНомерЗаявкиНаДоставку()

&НаСервере
Процедура Расш1_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// Обработчик механизма "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
		//**Изменено Максимов В.А.
		//Объект.ДатаВыполнения = НачалоДня(ТекущаяДатаСеанса());
		Объект.Дата = ТекущаяДата();
		Если ДеньНедели(Объект.Дата) < 5 Тогда
			Объект.ДатаВыполнения = Объект.Дата + 86400;
		ИначеЕсли ДеньНедели(Объект.Дата) = 5 Тогда
			Объект.ДатаВыполнения = Объект.Дата + 259200;
		КонецЕсли;
		//************************
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ИнтеграцияС1СДокументооборотом
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры
//== Сухарев Б.В
