
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка._РабочийСтолДоставка.МакетПредупреждение");
	
	//ТекстЗапроса =
	//"ВЫБРАТЬ
	//|	СостоянияИРеквизитыДоставки.Распоряжение КАК Распоряжение,
	//|	СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозкиОписание КАК Описание,
	//|	СостоянияИРеквизитыДоставки.ПолучательОтправитель КАК ПолучательОтправитель,
	//|	СостоянияИРеквизитыДоставки.Адрес КАК Адрес
	//|ИЗ
	//|	РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
	//|ГДЕ
	//|	СостоянияИРеквизитыДоставки.Распоряжение В(&Распоряжения)
	//|	И СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки = ИСТИНА
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	СостоянияИРеквизитыДоставки.ПолучательОтправитель,
	//|	СостоянияИРеквизитыДоставки.Распоряжение";
	//Запрос = Новый Запрос(ТекстЗапроса);
	//Запрос.УстановитьПараметр("Распоряжения", Параметры.Распоряжения);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("Отступ"));
	
	
	//Пока Выборка.Следующий() Цикл
	//	
	//	ЗаполняемаяОбласть = Макет.ПолучитьОбласть("СтрокаТаблицы");
	//	
	//	ТекстРаспоряжение = НСтр("ru = '%ПолучательОтправитель%, %Распоряжение%'");
	//	ТекстРаспоряжение = СтрЗаменить(ТекстРаспоряжение, "%ПолучательОтправитель%", Выборка.ПолучательОтправитель);
	//	ТекстРаспоряжение = СтрЗаменить(ТекстРаспоряжение, "%Распоряжение%", Выборка.Распоряжение);
	//	ЗаполняемаяОбласть.Параметры.ТекстРаспоряжение = ТекстРаспоряжение;
	//	ЗаполняемаяОбласть.Параметры.Заполнить(Выборка);
	//	
	//	ТабличныйДокумент.Вывести(ЗаполняемаяОбласть);
	//	
	//	
	//	
	//КонецЦикла;
	
	МассивРаспоряжений = Параметры.Распоряжения;
	Для Каждого Распоряжение Из МассивРаспоряжений Цикл
		
		ЗаполняемаяОбласть = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ТекстРаспоряжение = НСтр("ru = '%ПолучательОтправитель%, %Распоряжение%'");
		
		Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПоручениеЭкспедитору")  Тогда
			
			Если ЗначениеЗаполнено(Распоряжение.ОсобыеУсловияПеревозкиОписание) Тогда
				ТекстРаспоряжение = СтрЗаменить(ТекстРаспоряжение, "%ПолучательОтправитель%", Распоряжение.Пункт);
				ТекстРаспоряжение = СтрЗаменить(ТекстРаспоряжение, "%Распоряжение%",Распоряжение.Ссылка);
				ЗаполняемаяОбласть.Параметры.Адрес = Распоряжение.АдресДоставки;
				ЗаполняемаяОбласть.Параметры.ТекстРаспоряжение = ТекстРаспоряжение;
				ЗаполняемаяОбласть.Параметры.Описание = Распоряжение.ОсобыеУсловияПеревозкиОписание;
				ЗаполняемаяОбласть.Параметры.Распоряжение = Распоряжение;
				ТабличныйДокумент.Вывести(ЗаполняемаяОбласть);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			
			Если Распоряжение.ОсобыеУсловияПеревозки Тогда
				ТекстРаспоряжение = СтрЗаменить(ТекстРаспоряжение, "%ПолучательОтправитель%", Распоряжение.Партнер);
				ТекстРаспоряжение = СтрЗаменить(ТекстРаспоряжение, "%Распоряжение%",Распоряжение.Ссылка);
				ЗаполняемаяОбласть.Параметры.Адрес = Распоряжение.АдресДоставки;
				ЗаполняемаяОбласть.Параметры.ТекстРаспоряжение = ТекстРаспоряжение;
				ЗаполняемаяОбласть.Параметры.Описание = Распоряжение.ОсобыеУсловияПеревозкиОписание;
				ЗаполняемаяОбласть.Параметры.Распоряжение = Распоряжение;
				ТабличныйДокумент.Вывести(ЗаполняемаяОбласть);
			КонецЕсли; 
			
		ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка._ЗаявкаНаДоставку") Тогда
			
			Если Распоряжение.ОсобыеУсловияПеревозки Тогда
				ТекстРаспоряжение = СтрЗаменить(ТекстРаспоряжение, "%ПолучательОтправитель%", Распоряжение.Партнер);
				ТекстРаспоряжение = СтрЗаменить(ТекстРаспоряжение, "%Распоряжение%",Распоряжение.Ссылка);
				ЗаполняемаяОбласть.Параметры.Адрес = Распоряжение.АдресДоставки;
				ЗаполняемаяОбласть.Параметры.ТекстРаспоряжение = ТекстРаспоряжение;
				ЗаполняемаяОбласть.Параметры.Описание = Распоряжение.ОсобыеУсловияПеревозкиОписание;
				ЗаполняемаяОбласть.Параметры.Распоряжение = Распоряжение;
				ТабличныйДокумент.Вывести(ЗаполняемаяОбласть);
			КонецЕсли;
				
		КонецЕсли
		
	КонецЦикла;		// Распоряжения Из МассивРаспоряжений 
		
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	
КонецПроцедуры

#КонецОбласти