
&ИзменениеИКонтроль("НастройкиФормы")
Функция Кт_НастройкиФормы(Форма)

	СтруктураПараметров = ОписаниеНастроекФормы();

	Если Форма = ПредопределенноеЗначение("Перечисление.ФормыОткрываемыеПриНачалеРаботыСистемы.ПомощникПродаж") Тогда

		СтруктураПараметров.Вставить("ИмяЗапускаемойФормы", "Обработка.ПомощникПродаж.Форма.Форма");
		СтруктураПараметров.Вставить("Роль",                "ИспользованиеПомощникаПродаж");
		СтруктураПараметров.Вставить("ПараметрЗапуска",     "SaleAssistant");

	ИначеЕсли Форма = ПредопределенноеЗначение("Перечисление.ФормыОткрываемыеПриНачалеРаботыСистемы.РабочееМестоРаботникаСклада") Тогда

		СтруктураПараметров.Вставить("ИмяЗапускаемойФормы", "Обработка.РабочееМестоРаботникаСклада.Форма.ФормаРабочегоМеста");
		СтруктураПараметров.Вставить("Роль",                "ИспользованиеРабочегоМестаРаботникаСклада");
		СтруктураПараметров.Вставить("ПараметрЗапуска",     "WarehouseMobileWorkplace");

		СтруктураПараметров.Вставить("НеобходимыНастройки", Истина);
		СтруктураПараметров.Вставить("ИмяФормыНастроек",    "Обработка.РабочееМестоРаботникаСклада.Форма.НастройкиПараметров");

	ИначеЕсли Форма = ПредопределенноеЗначение("Перечисление.ФормыОткрываемыеПриНачалеРаботыСистемы.ЧекККМ") Тогда

		СтруктураПараметров.Вставить("ИмяЗапускаемойФормы", "Документ.ЧекККМ.Форма.ФормаДокументаРМК");
		СтруктураПараметров.Вставить("Роль",                "ДобавлениеИзменениеЧековККМ");
		СтруктураПараметров.Вставить("ПараметрЗапуска",     "CashRegisterReceipt");

	ИначеЕсли Форма = ПредопределенноеЗначение("Перечисление.ФормыОткрываемыеПриНачалеРаботыСистемы.РабочееМестоМенеджераПоДоставке") Тогда

		СтруктураПараметров.Вставить("ИмяЗапускаемойФормы", "Обработка.РабочееМестоМенеджераПоДоставке.Форма.Форма");
		СтруктураПараметров.Вставить("Роль",                "ИспользованиеРабочегоМестаДоставки");
		СтруктураПараметров.Вставить("ПараметрЗапуска",     "DeliveryWorkplace");


	ИначеЕсли Форма = ПредопределенноеЗначение("Перечисление.ФормыОткрываемыеПриНачалеРаботыСистемы.МобильноеРабочееМестоСборкиИКурьерскойДоставки") Тогда

		СтруктураПараметров.Вставить("ИмяЗапускаемойФормы", "Обработка.МобильноеРабочееМестоСборкиИКурьерскойДоставки.Форма.РабочийСтол");
		СтруктураПараметров.Вставить("Роль",                "ИспользованиеРабочегоМестаСборкиИКурьерскойДоставки");
		СтруктураПараметров.Вставить("ПараметрЗапуска",     "AssemblyAndCourierDeliveryWorkplace");

	ИначеЕсли Форма = ПредопределенноеЗначение("Перечисление.ФормыОткрываемыеПриНачалеРаботыСистемы.МобильноеРабочееМестоКладовщика") Тогда

		СтруктураПараметров.Вставить("ИмяЗапускаемойФормы", "Обработка.МобильноеРабочееМестоКладовщика.Форма.РабочийСтол");
		СтруктураПараметров.Вставить("Роль",                "ИспользованиеРабочегоМестаКладовщика");
		СтруктураПараметров.Вставить("ПараметрЗапуска",     "WarehouseWorkplace");

	ИначеЕсли Форма = ПредопределенноеЗначение("Перечисление.ФормыОткрываемыеПриНачалеРаботыСистемы.МониторЦелевыхПоказателей") Тогда

		СтруктураПараметров.Вставить("ИмяЗапускаемойФормы", "Отчет.МониторЦелевыхПоказателей.Форма.ФормаМониторЦелевыхПоказателей");
		СтруктураПараметров.Вставить("Роль",                "РазделОтчетыИМониторингЦелевыеПоказатели");
		СтруктураПараметров.Вставить("ПараметрЗапуска",     "PerformanceDashboard");

	#Вставка		
	//++ Сухарев Б.В. 06.08.2019
	ИначеЕсли Форма = ПредопределенноеЗначение("Перечисление.ФормыОткрываемыеПриНачалеРаботыСистемы._РабочийСтолДоставка") Тогда
		СтруктураПараметров.Вставить("ИмяЗапускаемойФормы", "Обработка._РабочийСтолДоставка.Форма.Форма");
		СтруктураПараметров.Вставить("Роль",                "ИспользованиеРабочегоМестаДоставки");
		СтруктураПараметров.Вставить("ПараметрЗапуска",     "DeliveryWorkplace");
		
	ИначеЕсли Форма = ПредопределенноеЗначение("Перечисление.ФормыОткрываемыеПриНачалеРаботыСистемы._РабочийСтолМенеджераПоЗакупкамДинамическийСписок") Тогда
		СтруктураПараметров.Вставить("ИмяЗапускаемойФормы", "Обработка._РабочийСтолМенеджераПоЗакупкамДинамическийСписок.Форма.Форма");
		СтруктураПараметров.Вставить("Роль",                "ПодсистемаЗакупки");
		СтруктураПараметров.Вставить("ПараметрЗапуска",     "ProcurementAssistant");
		
	ИначеЕсли Форма = ПредопределенноеЗначение("Перечисление.ФормыОткрываемыеПриНачалеРаботыСистемы._РабочийСтолМенеджераПоПродажам") Тогда
		СтруктураПараметров.Вставить("ИмяЗапускаемойФормы", "Обработка._РабочийСтолМенеджераПоПродажам.Форма.Форма");
		СтруктураПараметров.Вставить("Роль",                "ПодсистемаПродажи");
		СтруктураПараметров.Вставить("ПараметрЗапуска",     "SaleAssistant");
	//== Сухарев Б.В
	#КонецВставки
	КонецЕсли;

	Возврат СтруктураПараметров;

КонецФункции
