
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПараметрыОткрытияФормы = Новый Структура;

	ИмяФормы = "Справочник._ОповещенияПользователей.Форма.ФормаПросмотраНовостей"; // ИмяФормы
	ОбработкаНовостейКлиентПереопределяемый.ПереопределитьПараметрыОткрытияФормыСпискаНовостей(
		ИмяФормы,
		ПараметрыОткрытияФормы,
		ПараметрКоманды,
		ПараметрыВыполненияКоманды);

	ПараметрыОткрытияФормы.Вставить("ЗаголовокФормы", "Сообщения пользователям");
	
	ОткрытьФорму(
		ИмяФормы,
		ПараметрыОткрытияФормы,
		Неопределено,
		""); // Уникальность
	
КонецПроцедуры
