//1.0.1.6   Переделка заявки на доставку  KOMPIT-298
//1.0.1.7   Исправление распроведения заказа поставщику (Битая ссылка)
//1.0.1.8   Доработка печатной формы Отбор товара из Расходного ордера 
//1.0.1.9   (30.04.23) Система нумерации документов
//1.0.1.10  (01.05.23) Нумерация документов - Добавление в номер префикса организации
//1.0.1.11  (03.05.23) Регистрация изменения заявки на доставку 
//1.0.1.12  (04.05.23) Исправление ошибок
//1.0.1.13  Нумерация реализации из рабочего стола доставки
//1.0.1.14  Нумерация заказов поставщику
//1.0.1.15  Добавление информации по контракту в заказ клиента, и вывод ее в УПД
//1.0.1.16  Добавление столбцов о поставщике в рабочий стол менеджера по продажам 
//1.0.1.17  Доработка переноса особых условий задания на отгрузку в комментарий расходного ордера и вывод его на печать
//1.0.1.18  Печать счета по контракту







